[{"id":0,"name":"Lemon Ricotta Pancakes","tags":["Breakfast","Pancakes"],"servings":"8 small pancakes","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["milk","baking soda","ricotta cheese","lemon zest","sugar","egg","anilla extract","butter","lemon","self-rising flour"],"ingredientlist":["3/4 cup cold water or ;milk;","1/2 teaspoon ;baking soda;","1/2 cup ;ricotta cheese;","1 tablespoon grated ;lemon zest;","1 tablespoon vegetable oil","1 tablespoon white ;sugar;","1 large ;egg;","1/8 teaspoon v;anilla extract;","2 tablespoons melted ;butter;","1 tablespoon ;lemon; juice","1 cup ;self-rising flour; (bloem + tl bakpoeder)","2 tablespoons self-rising flour"],"directions":"Whisk water and baking soda together in a mixing bowl. Add ricotta cheese, lemon zest, vegetables oil, sugar, egg, and vanilla. Whisk until smooth, breaking up lumps of cheese as you mix. Add melted butter, lemon juice, and 1 cup plus 2 tablespoons self-rising flour. Whisk together, stirring until most of flour disappears into the batter.\nLet batter sit at room temperature about 15 minutes.\nHeat lightly greased cast iron skillet or griddle over medium-high heat. Portion out 1/4 cup scoops of batter onto skillet. Transfer to a warm plate."},{"id":1,"name":"Ham Kaas Croissants met Ei","tags":["Breakfast","Croissant"],"servings":"6 stuks","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["croissantdeeg","ei","slagroom","schouderham","kaas","peterselie"],"ingredientlist":["1 rol ;croissantdeeg;","2 kleine ;ei;eren","75 ml ;slagroom;","6 plakken ;schouderham;","handje geraspte ;kaas;","peper en zout","snuf ;peterselie;"],"directions":"Verwarm de oven op 200 graden. Klop de eieren door elkaar en voeg de room toe. Verhit een beetje boter in een pan en voeg het eimengsel toe en laat een paar seconde stollen. Schep dan met een houten spatel door elkaar, van buiten naar binnen. Voeg de peterselie, peper, zout en kaas toe en zet het vuur uit. Laat het ei niet te lang doorbakken ander wordt deze droog. \nRol het croissantdeeg uit en snijd op de naden door. Maak een klein sneetje in het midden van de rechte zijde. Leg een plak schouderham op het midden van het brede gedeelte. Schep hier wat roerei op en rol het croissantje voorzichtig op. \nLeg ze op de bakplaat en bestrijk met een beetje slagroom (of ei) en bak 12 min in de oven. Ze kunnen zowel warm als koud worden geserveerd maar zijn warm net iets lekkerder."},{"id":2,"name":"Whole Wheat Banana Pancakes","tags":["Breakfast","Pancakes","Vegan"],"servings":"10 pancakes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["flour","sugar","baking soda","nondairy milk","banana","Coconut oil"],"ingredientlist":["2.5 cups ;flour;","2tbsp brown or white ;sugar;","2tsp ;baking soda;","1/2tsp salt","2 cups ;nondairy milk;","1 small ;banana;, mashed",";Coconut oil;"],"directions":"In a big bowl, whisk together the flour, sugar, baking soda and salt. Make a crater in the middle and add the milk and banana. Mix up until there are no more dry spots, not too roughly.\nCook it up."},{"id":3,"name":"To-Go Breakfast Bars","tags":["Breakfast","Take out","Vegan"],"servings":"10 bars","source":"Thug Kitchen","image":null,"cooktime":null,"preptime":null,"ingredienttags":["oats","quinoa","millet","cranberries","dried fruit","maple syrup","peanut butter","vanilla extract"],"ingredientlist":["2 cups rolled ;oats;","3/4 cup uncooked ;quinoa;","1/4 cup uncooked ;millet;","1 1/2 cups chopped mixed nuts or seeds(for example pumpkin seeds, sunflower seeds and sliced almonds)","1/2 cups dried ;cranberries; or similar ;dried fruit;","1/4 tsp salt","1/2 cup ;maple syrup;","1/2 cup ;peanut butter;","1/4 cup refined coconut oil or olive oil","1tsp ;vanilla extract;"],"directions":"Heat oven to 180C. grab a decently sized baking dish and line it with parchment.\nHeat a large skillet or wok over a medium-low heat and add the oats, quinoa and millet. Stir them all around until they start to smell toasted, about 3 minutes. Combine the nuts and cranberries in a large bowl. Pour the oat mix and the salt in and mix.\nIn a small saucepan, combine the maple syrup, peanut butter, oil, sugar and vanilla and warm until everything is melted. Pour this all over the dry mix and stir until everything is coated.\nPour the mixture into the baking dish and press it down with a spoon to even it out. Throw it in the oven until it all looks toasted, 25-30 minutes. Let it cool to room temperature in the pan then throw it into the fridge. When it's all nice and cold, cut into bars. They keep best in the fridge."},{"id":4,"name":"Egg en Cheese Breakfast Burritos","tags":[],"servings":"1 burrito","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg","milk","green pepper","cheese","tortilla","salsa","chorizo"],"ingredientlist":["2 ;egg;s","2 tbsp (30 mL) ;milk;","1/2 small sweet ;green pepper;, seeded and diced","Pinch each salt and pepper","2 tbsp (30 mL) shredded Cheddar ;cheese;","small flour ;tortilla;","2 tbsp (30 mL) medium ;salsa;","50gr dry ;chorizo;(optional)"],"directions":"Whisk eggs, milk, green pepper, salt and pepper in small bowl.\nHeat skillet over medium-high heat and melt butter into it. Use the chorizo instead of butter and fry it until slightly browned\nPour in egg mixture and immediately reduce heat to medium-low. As eggs begin to set, gently move spatula across bottom and side of skillet to form large, soft curds. Cook until eggs are thickened and no visible liquid egg remains, but the eggs are not dry.\nSprinkle with cheese.\nSpoon the eggs in the centre of the tortilla and top with salsa. Fold up the bottom and then the sides to enclose filling."},{"id":5,"name":"One-Pot Gingery Chicken and Rice With Peanut Sauce","tags":["Main Dishes","Rice","Chicken"],"servings":"6 servings","source":"https://www.bonappetit.com/recipe/one-pot-chicken-and-rice","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["<b>Chicken and Rice</b","6 small skin-on, bone-in chicken thighs (about 3 lb.)","¾ tsp. kosher salt, plus more","2 large shallots, finely chopped","8 garlic cloves, finely chopped","1 2\" piece ginger, peeled, finely chopped","2 cups high-quality basmati rice, rinsed","2 whole star anise","1 Tbsp. soy sauce","Sauce and Assembly","½ cup creamy peanut butter","2 Tbsp. soy sauce","2 Tbsp. unseasoned rice vinegar","5 tsp. Sriracha","1 1\" piece ginger, peeled, finely chopped","1½ tsp. honey","1 English hothouse cucumber, halved lengthwise, thinly sliced on a diagonal","1 cup cilantro leaves with tender stems"],"directions":"Pat chicken dry and season all over with salt. Arrange, skin side down, in a cold, dry medium Dutch oven and set over medium heat. Cook, undisturbed, until skin is golden brown and crisp and easily releases from pot, 8–10 minutes. Slide thighs around to different spots (this will ensure even browning) and continue to cook until deeply browned, 3–5 minutes longer. Transfer chicken to a plate. Let pot cool 2 minutes.\nSet pot over medium-low heat; add shallots, garlic, and ginger and cook, stirring constantly, until very fragrant but not browned, about 2 minutes. Stir in rice and star anise and cook, stirring constantly, 1 minute. Stir in soy sauce, ¾ tsp. salt, and 3 cups water. Nestle chicken back into rice mixture in pot, arranging skin side up. Increase heat to medium and bring liquid to a simmer. Immediately cover pot, reduce heat to low, and cook 25 minutes. Remove from heat and let chicken and rice sit 10 minutes.\nWhile the chicken and rice are cooking, make the sauce. Whisk peanut butter, soy sauce, vinegar, Sriracha, ginger, honey, and ¼ cup warm water in a small bowl until smooth and pourable. If sauce still looks a little thick, continuing adding water until it reaches a drizzle-able consistency.\nRemove lid from pot and fluff rice with a fork. Pluck out and discard star anise. Serve chicken and rice with peanut sauce, cucumber, and cilantro alongside."},{"id":6,"name":"Pilaf","tags":["Rice","Ham","Chicken","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["Hamlappen","kip","ui","perzik"," tomatenpuree","prei","Sambal","Rijst","tomatenblokjes"],"ingredientlist":["300gr ;Hamlappen; of ;kip;, in blokjes","1 ;ui;, gesnipperd","1 blik ;perzik; op siroop","1 blikje; tomatenpuree;","300gr ;prei;(of een hele)",";Sambal; of tabasco","Tijm is blijkbaar normaal",";Rijst;","Eventueel een blik ;tomatenblokjes;"],"directions":"Zet de rijst op en fruit de ui\nVoeg het vlees toe, bak even aan\nVoeg de prei toe, laat slinken\nVoeg de siroop, de ketjap en de tomatenpuree toe. Probeer een goede balans tussen ketjap en siroop te vinden voor de smaak\nLaat even sudderen\nVoeg de perzik en de rijst toe en laat even doorwarmen"},{"id":7,"name":"Southwest Chicken Skillet","tags":["Chicken","Rice","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["white rice","salsa","chicken","black beans","chili powder","chicken broth","cheese","green onion"],"ingredientlist":["1 cup uncooked long grain ;white rice;","225mL ;salsa;","2 pre-cooked ;chicken; breasts","1 (15 oz.) can ;black beans;","1 Tbsp ;chili powder;","400mL cups ;chicken broth;","1 cup shredded ;cheese;","2-3 ;green onion;s, sliced"],"directions":"In a large skillet, combine the rice, salsa, chicken, black beans (drained), chili powder, and chicken broth. Stir until everything is evenly combined.\nPlace a tight fitting lid on the skillet, turn the heat on to high, and let the skillet come to a full boil. As soon as the skillet comes to a boil, turn the heat down to low and let it simmer for 30 minutes. Make sure it is simmering the entire time, turning the heat up slightly if needed (you should be able to hear it simmer quietly).\nAfter 30 minutes, turn off the heat, remove the lid, and fluff the mixture with a fork. All of the liquid should be absorbed and the rice should be tender. Sprinkle 1 cup of shredded cheese over top, replace the lid, and let it sit for a few minutes, or until the cheese is melted. Meanwhile, slice the green onions. Sprinkle the green onions over the melted cheese and serve hot."},{"id":8,"name":"Skillet Pineapple BBQ Chicken","tags":["Chicken","Rice"],"servings":"6 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["Pineapple","BBQ sauce","jalapeño","green onion"],"ingredientlist":["1 Tbsp cooking oil","6 boneless skinless chicken thighs* (about 1kg.)","Pinch Salt and pepper","500gr can ;Pineapple; slices in juice","1/2 cup ;BBQ sauce;","1 ;jalapeño; (optional), sliced thinly","2 ;green onion;s, sliced"],"directions":"Heat the oil in a skillet. Season both sides of the chicken with a pinch of salt and pepper.\nOnce the skillet is hot, add the chicken thighs and cook until golden brown on each side and cooked through. Remove the cooked chicken to a clean plate.\nWhile the chicken is cooking, drain and reserve the juice from the canned pineapple slices.\nAfter removing the chicken from the skillet, turn the heat down to low and add about 1/2 cup of the reserved pineapple juice. Stir to dissolve and loosen the browned chicken bits from the bottom of the skillet. Add the BBQ sauce and stir until a thick sauce forms. Taste the sauce and add salt if needed.\nAdd the cooked chicken thighs and pineapple slices to the skillet, dredging both sides in the pineapple BBQ sauce.  Spoon any excess sauce over the chicken.\nTurn the broiler on to high. Transfer the skillet to the oven and broil for about 5 minutes, or just until the BBQ sauce caramelizes on the edges of the chicken and pineapple. If you don't have an oven safe skillet you can transfer the chicken, pineapple, and ALL of the sauce to a casserole dish for broiling, or skip the broiling step and enjoy as is.\nAfter broiling, sprinkle the sliced jalapeño and green onion over top, and then serve."},{"id":9,"name":"Kedgeree met Kip","tags":["Chicken","Main Dishes","Rice"],"servings":"4 personen","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["25gr boter","2el olijfolie","1ui gesnipperd","1teen knoflook, geperst","2tl kerrie","300gr gekookte basmatirijst","200gr gekookte kip","Schil van 1 citroen(dont waste stuff)","4 gekookte eieren","Dille"],"directions":"Fruit de ui 10min, voeg de knoflook toe bak 1min\nVoeg de kerrie door bak 1min en roer de rijst erdoor\nVoeg de kip en citroenschil toe, verhit 1-2min alvorens de dille en ei toe te voegen\nBreng op smaak, doe er een sla bij"},{"id":10,"name":"Easy Orange Chicken","tags":["Chicken","Rice","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["orange","soy sauce","brown sugar","rice vinegar","ginger","garlic","red pepper flakes","chicken thigh","egg","cornstarch","green onion"],"ingredientlist":["ORANGE SAUCE","1 large ;orange;","3 Tbsp ;soy sauce;","1.5 Tbsp ;brown sugar;","1/2 Tbsp ;rice vinegar;","1 tsp grated fresh ;ginger;","1 clove ;garlic;, minced","1/4 tsp ;red pepper flakes;","1/2 Tbsp cornstarch","STIR FRIED CHICKEN","4 boneless, skinless ;chicken thigh;s (about 1.3 lbs.)","1 large ;egg;","2 Tbsp ;cornstarch;","Pinch of salt and pepper","2 Tbsp cooking oil","4 cups cooked rice","2 ;green onion;s, sliced"],"directions":"Remove the zest from the orange, then squeeze the juice from the orange. You'll need about 1 tsp zest and 1/2 cup juice. Combine the juice and 1 tsp zest with the soy sauce, brown sugar, rice vinegar, grated ginger, minced garlic, red pepper flakes, and 1/2 Tbsp cornstarch in a small sauce pot. Before placing it over heat, whisk until the cornstarch is fully dissolved. Heat the mixture over medium-low until it begins to simmer, thicken, and turns into a glossy glaze (about 3-5 minutes). Remove the sauce from heat and set it aside.\nUse a sharp knife to remove any excess fat from the chicken thighs, then cut them.\nCombine the egg, 2 Tbsp cornstarch, and a pinch of salt and pepper in a mixing bowl and whisk until the mixture is smooth and frothy. Add the chicken pieces and stir to coat them.\nHeat a large skillet over medium to medium-high heat. Once hot, add 2 Tbsp cooking oil. Add the chicken, making sure all the pieces are touching the surface and not piled on top of one another. Let the pieces cook until they are golden brown on the bottom.\nFlip the chicken pieces, breaking them apart from one another as you turn them. Let them cook until golden brown on the second side and cooked through (about 5-7 minutes total cooking).\nTurn the heat off under the skillet and pour on the prepared orange sauce. Stir to coat the chicken pieces in sauce.\nServe the chicken and sauce over cooked rice, garnished with sliced green onions and any left over orange zest."}]