[{"id":0,"name":"Lemon Ricotta Pancakes","tags":["Breakfast","Pancakes"],"servings":"8 small pancakes","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["milk","baking soda","ricotta cheese","lemon zest","sugar","egg","anilla extract","butter","lemon","self-rising flour"],"ingredientlist":["3/4 cup cold water or ;milk;","1/2 teaspoon ;baking soda;","1/2 cup ;ricotta cheese;","1 tablespoon grated ;lemon zest;","1 tablespoon vegetable oil","1 tablespoon white ;sugar;","1 large ;egg;","1/8 teaspoon v;anilla extract;","2 tablespoons melted ;butter;","1 tablespoon ;lemon; juice","1 cup ;self-rising flour; (bloem + tl bakpoeder)","2 tablespoons self-rising flour"],"directions":"Whisk water and baking soda together in a mixing bowl. Add ricotta cheese, lemon zest, vegetables oil, sugar, egg, and vanilla. Whisk until smooth, breaking up lumps of cheese as you mix. Add melted butter, lemon juice, and 1 cup plus 2 tablespoons self-rising flour. Whisk together, stirring until most of flour disappears into the batter.\nLet batter sit at room temperature about 15 minutes.\nHeat lightly greased cast iron skillet or griddle over medium-high heat. Portion out 1/4 cup scoops of batter onto skillet. Transfer to a warm plate."},{"id":1,"name":"Ham Kaas Croissants met Ei","tags":["Breakfast","Croissant"],"servings":"6 stuks","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["croissantdeeg","ei","slagroom","schouderham","kaas","peterselie"],"ingredientlist":["1 rol ;croissantdeeg;","2 kleine ;ei;eren","75 ml ;slagroom;","6 plakken ;schouderham;","handje geraspte ;kaas;","peper en zout","snuf ;peterselie;"],"directions":"Verwarm de oven op 200 graden. Klop de eieren door elkaar en voeg de room toe. Verhit een beetje boter in een pan en voeg het eimengsel toe en laat een paar seconde stollen. Schep dan met een houten spatel door elkaar, van buiten naar binnen. Voeg de peterselie, peper, zout en kaas toe en zet het vuur uit. Laat het ei niet te lang doorbakken ander wordt deze droog. \nRol het croissantdeeg uit en snijd op de naden door. Maak een klein sneetje in het midden van de rechte zijde. Leg een plak schouderham op het midden van het brede gedeelte. Schep hier wat roerei op en rol het croissantje voorzichtig op. \nLeg ze op de bakplaat en bestrijk met een beetje slagroom (of ei) en bak 12 min in de oven. Ze kunnen zowel warm als koud worden geserveerd maar zijn warm net iets lekkerder."},{"id":2,"name":"Whole Wheat Banana Pancakes","tags":["Breakfast","Pancakes","Vegan"],"servings":"10 pancakes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["flour","sugar","baking soda","nondairy milk","banana","Coconut oil"],"ingredientlist":["2.5 cups ;flour;","2tbsp brown or white ;sugar;","2tsp ;baking soda;","1/2tsp salt","2 cups ;nondairy milk;","1 small ;banana;, mashed",";Coconut oil;"],"directions":"In a big bowl, whisk together the flour, sugar, baking soda and salt. Make a crater in the middle and add the milk and banana. Mix up until there are no more dry spots, not too roughly.\nCook it up."},{"id":3,"name":"To-Go Breakfast Bars","tags":["Breakfast","Take out","Vegan"],"servings":"10 bars","source":"Thug Kitchen","image":null,"cooktime":null,"preptime":null,"ingredienttags":["oats","quinoa","millet","cranberries","dried fruit","maple syrup","peanut butter","vanilla extract"],"ingredientlist":["2 cups rolled ;oats;","3/4 cup uncooked ;quinoa;","1/4 cup uncooked ;millet;","1 1/2 cups chopped mixed nuts or seeds(for example pumpkin seeds, sunflower seeds and sliced almonds)","1/2 cups dried ;cranberries; or similar ;dried fruit;","1/4 tsp salt","1/2 cup ;maple syrup;","1/2 cup ;peanut butter;","1/4 cup refined coconut oil or olive oil","1tsp ;vanilla extract;"],"directions":"Heat oven to 180C. grab a decently sized baking dish and line it with parchment.\nHeat a large skillet or wok over a medium-low heat and add the oats, quinoa and millet. Stir them all around until they start to smell toasted, about 3 minutes. Combine the nuts and cranberries in a large bowl. Pour the oat mix and the salt in and mix.\nIn a small saucepan, combine the maple syrup, peanut butter, oil, sugar and vanilla and warm until everything is melted. Pour this all over the dry mix and stir until everything is coated.\nPour the mixture into the baking dish and press it down with a spoon to even it out. Throw it in the oven until it all looks toasted, 25-30 minutes. Let it cool to room temperature in the pan then throw it into the fridge. When it's all nice and cold, cut into bars. They keep best in the fridge."},{"id":4,"name":"Egg en Cheese Breakfast Burritos","tags":[],"servings":"1 burrito","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg","milk","green pepper","cheese","tortilla","salsa","chorizo"],"ingredientlist":["2 ;egg;s","2 tbsp (30 mL) ;milk;","1/2 small sweet ;green pepper;, seeded and diced","Pinch each salt and pepper","2 tbsp (30 mL) shredded Cheddar ;cheese;","small flour ;tortilla;","2 tbsp (30 mL) medium ;salsa;","50gr dry ;chorizo;(optional)"],"directions":"Whisk eggs, milk, green pepper, salt and pepper in small bowl.\nHeat skillet over medium-high heat and melt butter into it. Use the chorizo instead of butter and fry it until slightly browned\nPour in egg mixture and immediately reduce heat to medium-low. As eggs begin to set, gently move spatula across bottom and side of skillet to form large, soft curds. Cook until eggs are thickened and no visible liquid egg remains, but the eggs are not dry.\nSprinkle with cheese.\nSpoon the eggs in the centre of the tortilla and top with salsa. Fold up the bottom and then the sides to enclose filling."}]