[{"id":0,"name":"Lemon Ricotta Pancakes","tags":["Breakfast","Pancakes"],"servings":"8 small pancakes","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["milk","baking soda","ricotta cheese","lemon zest","sugar","egg","vanilla extract","butter","lemon","self-rising flour"],"ingredientlist":["3/4 cup cold #1#water# or ;milk;","1/2 teaspoon ;baking soda;","1/2 cup ;ricotta cheese;","1 tablespoon grated ;lemon zest;","1 tablespoon vegetable oil","1 tablespoon white ;sugar;","1 large ;egg;","1/8 teaspoon v;anilla extract;","2 tablespoons melted ;butter;","1 tablespoon ;lemon; juice","1 cup ;self-rising flour; (bloem + tl bakpoeder)","2 tablespoons self-rising flour"],"directions":"Whisk water and baking soda together in a mixing bowl. Add ricotta cheese, lemon zest, vegetables oil, sugar, egg, and vanilla. Whisk until smooth, breaking up lumps of cheese as you mix. Add melted butter, lemon juice, and 1 cup plus 2 tablespoons self-rising flour. Whisk together, stirring until most of flour disappears into the batter.\nLet batter sit at room temperature about 15 minutes.\nHeat lightly greased cast iron skillet or griddle over medium-high heat. Portion out 1/4 cup scoops of batter onto skillet. Transfer to a warm plate."},{"id":1,"name":"Ham Kaas Croissants met Ei","tags":["Breakfast","Croissant"],"servings":"6 stuks","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["croissantdeeg","ei","slagroom","schouderham","kaas","peterselie"],"ingredientlist":["1 rol ;croissantdeeg;","2 kleine ;ei;eren","75 ml ;slagroom;","6 plakken ;schouderham;","handje geraspte ;kaas;","peper en zout","snuf ;peterselie;"],"directions":"Verwarm de oven op 200 graden. Klop de eieren door elkaar en voeg de room toe. Verhit een beetje boter in een pan en voeg het eimengsel toe en laat een paar seconde stollen. Schep dan met een houten spatel door elkaar, van buiten naar binnen. Voeg de peterselie, peper, zout en kaas toe en zet het vuur uit. Laat het ei niet te lang doorbakken ander wordt deze droog. \nRol het croissantdeeg uit en snijd op de naden door. Maak een klein sneetje in het midden van de rechte zijde. Leg een plak schouderham op het midden van het brede gedeelte. Schep hier wat roerei op en rol het croissantje voorzichtig op. \nLeg ze op de bakplaat en bestrijk met een beetje slagroom (of ei) en bak 12 min in de oven. Ze kunnen zowel warm als koud worden geserveerd maar zijn warm net iets lekkerder."},{"id":2,"name":"Whole Wheat Banana Pancakes","tags":["Breakfast","Pancakes","Vegan"],"servings":"10 pancakes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["flour","sugar","baking soda","nondairy milk","banana","Coconut oil"],"ingredientlist":["2.5 cups ;flour;","2tbsp brown or white ;sugar;","2tsp ;baking soda;","1/2tsp salt","2 cups ;nondairy milk;","1 small ;banana;, mashed",";Coconut oil;"],"directions":"In a big bowl, whisk together the flour, sugar, baking soda and salt. Make a crater in the middle and add the milk and banana. Mix up until there are no more dry spots, not too roughly.\nCook it up."},{"id":3,"name":"To-Go Breakfast Bars","tags":["Breakfast","Take out","Vegan"],"servings":"10 bars","source":"Thug Kitchen","image":null,"cooktime":null,"preptime":null,"ingredienttags":["oats","quinoa","millet","cranberries","dried fruit","maple syrup","peanut butter","vanilla extract"],"ingredientlist":["2 cups rolled ;oats;","3/4 cup uncooked ;quinoa;","1/4 cup uncooked ;millet;","1 1/2 cups chopped mixed nuts or seeds(for example pumpkin seeds, sunflower seeds and sliced almonds)","1/2 cups dried ;cranberries; or similar ;dried fruit;","1/4 tsp salt","1/2 cup ;maple syrup;","1/2 cup ;peanut butter;","1/4 cup refined coconut oil or olive oil","1tsp ;vanilla extract;"],"directions":"Heat oven to 180C. grab a decently sized baking dish and line it with parchment.\nHeat a large skillet or wok over a medium-low heat and add the oats, quinoa and millet. Stir them all around until they start to smell toasted, about 3 minutes. Combine the nuts and cranberries in a large bowl. Pour the oat mix and the salt in and mix.\nIn a small saucepan, combine the maple syrup, peanut butter, oil, sugar and vanilla and warm until everything is melted. Pour this all over the dry mix and stir until everything is coated.\nPour the mixture into the baking dish and press it down with a spoon to even it out. Throw it in the oven until it all looks toasted, 25-30 minutes. Let it cool to room temperature in the pan then throw it into the fridge. When it's all nice and cold, cut into bars. They keep best in the fridge."},{"id":4,"name":"Egg en Cheese Breakfast Burritos","tags":[],"servings":"1 burrito","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg","milk","green pepper","cheese","tortilla","salsa","chorizo"],"ingredientlist":["2 ;egg;s","2 tbsp (30 mL) ;milk;","1/2 small sweet ;green pepper;, seeded and diced","Pinch each salt and pepper","2 tbsp (30 mL) shredded Cheddar ;cheese;","small flour ;tortilla;","2 tbsp (30 mL) medium ;salsa;","50gr dry ;chorizo;(optional)"],"directions":"Whisk eggs, milk, green pepper, salt and pepper in small bowl.\nHeat skillet over medium-high heat and melt butter into it. Use the chorizo instead of butter and fry it until slightly browned\nPour in egg mixture and immediately reduce heat to medium-low. As eggs begin to set, gently move spatula across bottom and side of skillet to form large, soft curds. Cook until eggs are thickened and no visible liquid egg remains, but the eggs are not dry.\nSprinkle with cheese.\nSpoon the eggs in the centre of the tortilla and top with salsa. Fold up the bottom and then the sides to enclose filling."},{"id":5,"name":"One-Pot Gingery Chicken and Rice With Peanut Sauce","tags":["Main Dishes","Rice","Chicken"],"servings":"6 servings","source":"https://www.bonappetit.com/recipe/one-pot-chicken-and-rice","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["<b>Chicken and Rice</b","6 small skin-on, bone-in chicken thighs (about 3 lb.)","¾ tsp. kosher salt, plus more","2 large shallots, finely chopped","8 garlic cloves, finely chopped","1 2\" piece ginger, peeled, finely chopped","2 cups high-quality basmati rice, rinsed","2 whole star anise","1 Tbsp. soy sauce","Sauce and Assembly","½ cup creamy peanut butter","2 Tbsp. soy sauce","2 Tbsp. unseasoned rice vinegar","5 tsp. Sriracha","1 1\" piece ginger, peeled, finely chopped","1½ tsp. honey","1 English hothouse cucumber, halved lengthwise, thinly sliced on a diagonal","1 cup cilantro leaves with tender stems"],"directions":"Pat chicken dry and season all over with salt. Arrange, skin side down, in a cold, dry medium Dutch oven and set over medium heat. Cook, undisturbed, until skin is golden brown and crisp and easily releases from pot, 8–10 minutes. Slide thighs around to different spots (this will ensure even browning) and continue to cook until deeply browned, 3–5 minutes longer. Transfer chicken to a plate. Let pot cool 2 minutes.\nSet pot over medium-low heat; add shallots, garlic, and ginger and cook, stirring constantly, until very fragrant but not browned, about 2 minutes. Stir in rice and star anise and cook, stirring constantly, 1 minute. Stir in soy sauce, ¾ tsp. salt, and 3 cups water. Nestle chicken back into rice mixture in pot, arranging skin side up. Increase heat to medium and bring liquid to a simmer. Immediately cover pot, reduce heat to low, and cook 25 minutes. Remove from heat and let chicken and rice sit 10 minutes.\nWhile the chicken and rice are cooking, make the sauce. Whisk peanut butter, soy sauce, vinegar, Sriracha, ginger, honey, and ¼ cup warm water in a small bowl until smooth and pourable. If sauce still looks a little thick, continuing adding water until it reaches a drizzle-able consistency.\nRemove lid from pot and fluff rice with a fork. Pluck out and discard star anise. Serve chicken and rice with peanut sauce, cucumber, and cilantro alongside."},{"id":6,"name":"Pilaf","tags":["Rice","Ham","Chicken","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["Hamlappen","kip","ui","perzik"," tomatenpuree","prei","Sambal","Rijst","tomatenblokjes"],"ingredientlist":["300gr ;Hamlappen; of ;kip;, in blokjes","1 ;ui;, gesnipperd","1 blik ;perzik; op siroop","1 blikje; tomatenpuree;","300gr ;prei;(of een hele)",";Sambal; of tabasco","Tijm is blijkbaar normaal",";Rijst;","Eventueel een blik ;tomatenblokjes;"],"directions":"Zet de rijst op en fruit de ui\nVoeg het vlees toe, bak even aan\nVoeg de prei toe, laat slinken\nVoeg de siroop, de ketjap en de tomatenpuree toe. Probeer een goede balans tussen ketjap en siroop te vinden voor de smaak\nLaat even sudderen\nVoeg de perzik en de rijst toe en laat even doorwarmen"},{"id":7,"name":"Southwest Chicken Skillet","tags":["Chicken","Rice","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["white rice","salsa","chicken","black beans","chili powder","chicken broth","cheese","green onion"],"ingredientlist":["1 cup uncooked long grain ;white rice;","225mL ;salsa;","2 pre-cooked ;chicken; breasts","1 (15 oz.) can ;black beans;","1 Tbsp ;chili powder;","400mL cups ;chicken broth;","1 cup shredded ;cheese;","2-3 ;green onion;s, sliced"],"directions":"In a large skillet, combine the rice, salsa, chicken, black beans (drained), chili powder, and chicken broth. Stir until everything is evenly combined.\nPlace a tight fitting lid on the skillet, turn the heat on to high, and let the skillet come to a full boil. As soon as the skillet comes to a boil, turn the heat down to low and let it simmer for 30 minutes. Make sure it is simmering the entire time, turning the heat up slightly if needed (you should be able to hear it simmer quietly).\nAfter 30 minutes, turn off the heat, remove the lid, and fluff the mixture with a fork. All of the liquid should be absorbed and the rice should be tender. Sprinkle 1 cup of shredded cheese over top, replace the lid, and let it sit for a few minutes, or until the cheese is melted. Meanwhile, slice the green onions. Sprinkle the green onions over the melted cheese and serve hot."},{"id":8,"name":"Skillet Pineapple BBQ Chicken","tags":["Chicken","Rice"],"servings":"6 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["Pineapple","BBQ sauce","jalapeño","green onion"],"ingredientlist":["1 Tbsp cooking oil","6 boneless skinless chicken thighs* (about 1kg.)","Pinch Salt and pepper","500gr can ;Pineapple; slices in juice","1/2 cup ;BBQ sauce;","1 ;jalapeño; (optional), sliced thinly","2 ;green onion;s, sliced"],"directions":"Heat the oil in a skillet. Season both sides of the chicken with a pinch of salt and pepper.\nOnce the skillet is hot, add the chicken thighs and cook until golden brown on each side and cooked through. Remove the cooked chicken to a clean plate.\nWhile the chicken is cooking, drain and reserve the juice from the canned pineapple slices.\nAfter removing the chicken from the skillet, turn the heat down to low and add about 1/2 cup of the reserved pineapple juice. Stir to dissolve and loosen the browned chicken bits from the bottom of the skillet. Add the BBQ sauce and stir until a thick sauce forms. Taste the sauce and add salt if needed.\nAdd the cooked chicken thighs and pineapple slices to the skillet, dredging both sides in the pineapple BBQ sauce.  Spoon any excess sauce over the chicken.\nTurn the broiler on to high. Transfer the skillet to the oven and broil for about 5 minutes, or just until the BBQ sauce caramelizes on the edges of the chicken and pineapple. If you don't have an oven safe skillet you can transfer the chicken, pineapple, and ALL of the sauce to a casserole dish for broiling, or skip the broiling step and enjoy as is.\nAfter broiling, sprinkle the sliced jalapeño and green onion over top, and then serve."},{"id":9,"name":"Kedgeree met Kip","tags":["Chicken","Main Dishes","Rice"],"servings":"4 personen","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["25gr boter","2el olijfolie","1ui gesnipperd","1teen knoflook, geperst","2tl kerrie","300gr gekookte basmatirijst","200gr gekookte kip","Schil van 1 citroen(dont waste stuff)","4 gekookte eieren","Dille"],"directions":"Fruit de ui 10min, voeg de knoflook toe bak 1min\nVoeg de kerrie door bak 1min en roer de rijst erdoor\nVoeg de kip en citroenschil toe, verhit 1-2min alvorens de dille en ei toe te voegen\nBreng op smaak, doe er een sla bij"},{"id":10,"name":"Easy Orange Chicken","tags":["Chicken","Rice","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["orange","soy sauce","brown sugar","rice vinegar","ginger","garlic","red pepper flakes","chicken thigh","egg","cornstarch","green onion"],"ingredientlist":["ORANGE SAUCE","1 large ;orange;","3 Tbsp ;soy sauce;","1.5 Tbsp ;brown sugar;","1/2 Tbsp ;rice vinegar;","1 tsp grated fresh ;ginger;","1 clove ;garlic;, minced","1/4 tsp ;red pepper flakes;","1/2 Tbsp cornstarch","STIR FRIED CHICKEN","4 boneless, skinless ;chicken thigh;s (about 1.3 lbs.)","1 large ;egg;","2 Tbsp ;cornstarch;","Pinch of salt and pepper","2 Tbsp cooking oil","4 cups cooked rice","2 ;green onion;s, sliced"],"directions":"Remove the zest from the orange, then squeeze the juice from the orange. You'll need about 1 tsp zest and 1/2 cup juice. Combine the juice and 1 tsp zest with the soy sauce, brown sugar, rice vinegar, grated ginger, minced garlic, red pepper flakes, and 1/2 Tbsp cornstarch in a small sauce pot. Before placing it over heat, whisk until the cornstarch is fully dissolved. Heat the mixture over medium-low until it begins to simmer, thicken, and turns into a glossy glaze (about 3-5 minutes). Remove the sauce from heat and set it aside.\nUse a sharp knife to remove any excess fat from the chicken thighs, then cut them.\nCombine the egg, 2 Tbsp cornstarch, and a pinch of salt and pepper in a mixing bowl and whisk until the mixture is smooth and frothy. Add the chicken pieces and stir to coat them.\nHeat a large skillet over medium to medium-high heat. Once hot, add 2 Tbsp cooking oil. Add the chicken, making sure all the pieces are touching the surface and not piled on top of one another. Let the pieces cook until they are golden brown on the bottom.\nFlip the chicken pieces, breaking them apart from one another as you turn them. Let them cook until golden brown on the second side and cooked through (about 5-7 minutes total cooking).\nTurn the heat off under the skillet and pour on the prepared orange sauce. Stir to coat the chicken pieces in sauce.\nServe the chicken and sauce over cooked rice, garnished with sliced green onions and any left over orange zest."},{"id":11,"name":"Chicken Tikka Masala","tags":["Chicken","Curry","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["700gr kippendijen","Sap van 2 citroenen","1tl rode chilipoeder","1.5 tl komijnzaad","0.5 tl korianderzaad","2 sjalotten","4 tenen knoflook","6cm gemberwortel","2 groene pepers","125gr yoghurt","0.5tl garam masala","400gr tomaten","1el olie","1tl tomatenpuree","Half bosje koriander","Suiker(om het zure weg te halen)","50gr boter","120mL room"],"directions":"Spoel het vlees af, dep droog en snijd in stukken. Wrijf het vlees in met 1tl citroensap en het chilipoeder. Rooster de zaden in een pan zonder olie, tot ze lekker beginnen te ruiken en maal ze fijn.\nSchil de ui, knoflook en gember en hak fijn. Maak de pepertjes schoon en hak fijn. Maar de sjalotjes, knoflook, de helft van de gember en de pepertjes met de afgedruppelde marinade tot een pasta. Meng deze pasta met yoghurt, garam masala en de helft van de versgemalen specerijen. Smeer het vlees goed in met deze marinade en laat het een nacht afgedekt intrekken.\nOntvel de tomaten en snijd in blokjes. Verhit de grill. Neem het vlees uit de marinade en grill aan beide kantent ongeveer 5 minuten. Vang het vocht dat eruit loopt op en bewaar dit. Neem het vlees van de grill.\nPureer de tomaten met de tomatenpuree, de rest van de gember en het citroensap, de rest van de gemalen specerijen, suiker en koriander. Smelt de boter, roer de puree erdoor en blus af met room. Voeg het vlees en het kookvocht toe. Breng aan de kook, laat 3 minuten doorkoken en serveer."},{"id":12,"name":"Kip Bolognese","tags":["Chicken","Pasta","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["2 el olijfolie","Spekreepjes","500g kipfilet in blokjes","1 wortel, in schijfjes","1 ui, gesnipperd","1 stengel bleekselderij, in boogjes","2 teentjes knoflook, kleingesneden","2 el bloem","150ml rode wijn","300ml kippenbouillon","1 el tomatenpuree","1 laurierblad","Snufje suiker"],"directions":"Verwarm de olie in een pan en bak het spek tot deze knapperig is, schep er de kip bij en back aan alle kanten bruin.\nHaal ui de pan en bak er de wortel, ui, bleekselderij en knoflook even in aan.\nRoer de bloem erdoor en giet al roerende de wijn en bouillon erbij. Men er de tomatenpuree, laurier en suiker door en laat 30min zachtjes doorkoken, tot de saus dik is.\nSchep er de spek en kip dor, warm nog even goed door."},{"id":13,"name":"BBQ Chicken Skillet","tags":["Chicken","Pasta","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken","tomatoes","green chiles","chicken broth","BBQ sauce","bacon"],"ingredientlist":["2 filets shredded pre-cooked ;chicken;","1 can diced ;tomatoes;","1 can diced ;green chiles;","250gr. fusili pasta","500ml ;chicken broth;","100ml ;BBQ sauce; ","Geraspte kaas","100gr ;bacon; strips"],"directions":"Place the chicken, pasta, chiles, and tomatoes (undrained) in a large skillet. Add two cups of chicken broth and stir to combine. Cover the skillet with a tight fitting lid, turn the heat on to high, and let it come to a boil. Once it reaches a boil, reduce the heat to low and let it simmer for 15 minutes, giving it a quick stir every 5 minutes or so.\nMeanwhile, cook the bacon in a skillet until brown and crispy. Drain the cooked bacon on a paper towel.\nOnce the pasta is cooked and most of the liquid is absorbed, drizzle the BBQ sauce over top. Sprinkle the shredded cheese over the BBQ sauce and cover the skillet with the lid. Leave the heat set on low and let the skillet sit for five minutes to melt the cheese. Once the cheese is melted, top with the crumbled bacon and sliced green onions, then serve."},{"id":14,"name":"Ultimate BBQ Chicken Quesadillas","tags":["Chicken","Quesadillas","Main Dishes","Lunch"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken","black beans","red onion","jalapeño","cilantro","cheese","chili powder","smoked paprika","BBQ Sauce","flour tortillas"],"ingredientlist":["300gr chopped cooked ;chicken;","15oz. can ;black beans;, drained","¼ ;red onion;","1 ;jalapeño;","½ cup fresh ;cilantro;","250gr shredded ;cheese;","1 tsp ;chili powder;","½ tsp ;smoked paprika;","¼ tsp salt","125ml Sweet Baby Ray's ;BBQ Sauce;","10 7-inch ;flour tortillas;"],"directions":"Add the chopped chicken and drained black beans to a large bowl. Finely dice the red onion. Remove the seeds from the jalapeño, then finely dice. Pull the cilantro leaves from their stems and roughly chop. Add the onion, jalapeño, cilantro, shredded cheddar, chili powder, smoked paprika, salt, and BBQ sauce to the bowl with the chicken and beans. Stir until everything is evenly combined.\nPlace about ⅓ cup of the BBQ chicken mixture on each tortilla and spread it evenly over one half of the surface. Fold the tortilla closed. Cook the filled and folded tortillas in a dry skillet over medium-low heat, until the outside is brown and crispy, the filling has heated through, and the cheese has melted. Cut each quesadilla in half and serve."},{"id":15,"name":"Sauce Madame","tags":["Main Dishes","Chicken"],"servings":"6 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken thighs","flour","garlic","onion","pears","grapes","fresh thyme","quince paste","Riesling","sweet wine","chicken stock","cinnamon","ginger","nutmeg","fresh parsley"],"ingredientlist":["3 lb boneless, skinless ;chicken thighs;","1 cup ;flour;","3 tsp sea salt (we like fleur de sel)","3 tsp black pepper","1 Tbsp olive oil","4 Tbsp unsalted butter","2 cloves ;garlic;, thinly sliced","1 large ;onion;, thinly sliced (we used sweet yellow)","2 ;pears;, quartered and thinly sliced","2 cups red seedless ;grapes;","5 sprigs ;fresh thyme;","2 Tbsp ;quince paste; (quince paste has the added bonus of lemon and sugar, and it is easier to find than\tquince)","1 cup ;Riesling;, or a ;sweet wine;","2 cups ;chicken stock;","1 tsp ;cinnamon;","1 tsp of ;ginger;","½ tsp ;nutmeg;","½ cup chopped ;fresh parsley;"],"directions":"Remove excess fat from the chicken and discard. In a shallow mixing bowl, add flour, 2 tsp of salt, and 2 tsp of black pepper. Mix and add chicken. Coat completely.\nAdd the olive oil and 2 Tbsp of butter in an appropriate pan to braise. Melt the butter over medium heat, and, once hot, add the chicken. Turn after 2–3 minutes, each side. We used a heavy copper pan so 3 minutes was better for us, but if your pan is lighter 2 minutes may be appropriate. The moral of that story . . . just watch your chicken.\nRemove chicken and set aside. Add the remaining butter to the pan. Add the garlic first and cook until fragrant, followed by the onion. Once the onion begins to soften, add the pears. You may need to add some additional butter at this point. Gently stir after a few minutes, and then\nadd the grapes and sprigs of thyme. Cook until the grapes become warm. Visually, you will be able to see\nwhen the grapes get warm when, like us, they start to sweat. Scoop out the quince paste and add it to the pan. Gently stir (you don’t want to damage the fruit). Then, add the Riesling and chicken stock.\nThe next ingredients to go into this beautiful pan are the spices: cinnamon, ginger, nutmeg, and the remaining salt and pepper. Stir and turn the pan up to high to get it to a rolling boil. Move the dial down to medium low—low and slow.\nPlace each piece of chicken back in to the pan. Add only one at a time and nudge each piece of chicken to get them cuddled up to the fruit and vegetables.\nCover the pan tightly and cook for 15 minutes. Do your best not to open the lid; patience. After 15 minutes, remove the lid, flip the chicken over, and, using a wooden spoon, scrape up any food that is sticking to the bottom.\nCook covered for another 20 minutes. Repeat the chicken flip and cook for a final 20 minutes, again covered. Salt and pepper to taste. Add the fresh parsley. Serve with a delicious loaf of bread—the sauce is too good not to mop up."},{"id":16,"name":"Hummus Breakfast Bowls","tags":["Breakfast","Rice"],"servings":"1 bowl","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["rice","broccoli","spinach","egg","hummus","sesame seeds","Sriracha"],"ingredientlist":["1 cup cooked ;rice;","4-5 frozen ;broccoli; florets or ;spinach;","1 large ;egg;, soft boiled or fried","2 Tbsp ;hummus;","Pinch of salt and pepper","Pinch of ;sesame seeds;",";Sriracha; to taste"],"directions":"Boil or fry one egg, leaving the yolk runny to provide extra \"sauce\" for the bowl.\nWhile the egg is cooking, add the pre-cooked rice and broccoli florets to a bowl. Microwave on high for one minute, or until the rice is hot and the florets are warmed through.\nAdd the hummus, cooked egg, and a pinch of salt and pepper to the bowl with the rice and broccoli. Drizzle with sriracha and sprinkle sesame seeds over top. Enjoy!"},{"id":17,"name":"Make Ahead Seeded Oats","tags":["Breakfast","Overnight Oats"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["oats","ground flaxseed","almonds","chia seeds","sunflower seeds","cinnamon"],"ingredientlist":["1 1/3 cup rolled ;oats;","4 Tbsp ;ground flaxseed;","4 Tbsp hulled hemp seeds or ;almonds;","2 Tbsp ;chia seeds; or ;sunflower seeds;","1 tsp ;cinnamon;","pinch salt","2 2/3 cup water, milk, or non-dairy milk sweetener of choice","Optional fresh add-ins: fresh fruit, nuts, peanut butter, jam, maple syrup"],"directions":"Add the oats, flaxseed, hemp seeds, chia seeds, cinnamon, and salt into each air-tight container (zip-top bags, reusable plastic containers, or glass containers with lids). If you are using a dry sweetener, like sugar, brown sugar, or stevia, you can add them to the dry mix. Store in a cool dry place indefinitely.\nTo prepare cold oats, add 2/3 cup water, milk, or non-dairy milk, stir to combine, then refrigerate for 8 hours or up to 3-4 days. Stir in any fresh add-ins just before serving."},{"id":18,"name":"Savoury Microwave Breakfast Mug","tags":["Breakfast","Mug"],"servings":"1 serving","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["bread pieces","pre-cooked chopped meat","chopped vegetables","cheese","butter","milk","egg"],"ingredientlist":["1 cup stale ;bread pieces;*","1/4 cup ;pre-cooked chopped meat;","1/4 cup finely ;chopped vegetables;","2 Tbsp shredded ;cheese;","1 Tbsp ;butter;","3 Tbsp ;milk;","1 large ;egg;","Pinch of salt and pepper"],"directions":"Tear or cut the bread into 1/2-inch pieces. Chop the meat and vegetables into small pieces. Shred the cheese.\n2.\tAdd the butter to the bottom of a large mug (10-12oz.) and microwave on high for 20 seconds or until it is fully melted. Whisk in the milk, egg, salt, and pepper with a fork.\nStir the meat, vegetables, and cheese into the milk and egg mixture first, then gently fold in the bread cubes until they are fully saturated.\nLet the mug sit for one minute to fully absorb the liquid, then microwave on high for about 90 seconds, or until the center is solid and it has begun to pull away from the mug around the edges. Serve hot."},{"id":19,"name":"Sourdough Pancakes","tags":["Breakfast","Pancakes","Sourdough"],"servings":"6-8 pancakes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["sourdough starter","egg","sugar","oil","baking soda","milk"],"ingredientlist":["2 cups fresh ;sourdough starter;","1 ;egg;","3 Tbsp. ;sugar;","2 Tbsp. ;oil;","1 tsp. ;baking soda;","2-4 Tbsp. ;milk;, coconut milk, or water","Butter or coconut oil for frying"],"directions":"Mix together sourdough starter, egg, sugar, oil and baking soda.\nAdd milk, coconut milk, or water to thin the batter to a pancake batter consistency. Begin with 2 tablespoons liquid and add more as needed, based on the consistency of your sourdough starter.\nHeat a griddle over medium heat. Melt a slice of butter or coconut oil on the griddle. Once the griddle is hot, add ¼ cup of batter for each pancake. Cook until golden brown on both sides."},{"id":20,"name":"Giant No-Flip Blueberry Pancake","tags":["Pancakes","Cake","Breakfast","Lunch"],"servings":"6 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["flour","cornmeal","egg","sugar","baking powder","baking soda","buttermilk","butter","blueberries"],"ingredientlist":["120 gr (1 cup) all-purpose ;flour;","40 (⅓ cup) ;cornmeal; (not coarse)","2 large ;egg;s","50 gr (¼ cup) ;sugar;","1 Tbsp. ;baking powder;","½ tsp. ;baking soda;","2 salt","375 mL (1½ cups) ;buttermilk;, divided","4 Tbsp. unsalted ;butter;, melted, divided","100gr (1 cup) fresh ;blueberries;","1 Tbsp. vegetable oil","Pure maple syrup (for serving)"],"directions":"Preheat oven to 190°C. Whisk 1 cup all-purpose flour and ⅓ cup cornmeal in a small bowl.\nWhisk 2 large eggs, ¼ cup sugar, 1 Tbsp. baking powder, 2 tsp salt, and ½ tsp. baking soda in a medium bowl until eggs are lightened and smooth, about 30 seconds.\nAdd ¾ cup buttermilk and half of the dry ingredients and whisk very gently just to barely combine. Add 2 Tbsp. melted butter, remaining ¾ cup buttermilk, and remaining dry ingredients and whisk just to combine (some lumps are okay). Using a wooden spoon, fold in 1 cup fresh blueberries.\nHeat 1 Tbsp. vegetable oil and 2 Tbsp. melted butter in a large oven-safe nonstick skillet (make sure it's at least 8 inches in diameter) over medium-high. When foaming subsides, scrape in batter and use the back of a spoon to gently nudge it all the way to the edges.\nReduce heat to medium and cook, shaking pan back and forth occasionally to ensure pancake will eventually slide out freely, until bubbles appear across surface of pancake, 5–6 minutes.\nTransfer pan to oven and cook until pancake is puffed and set, 10–12 minutes. Invert pancake onto a large plate or platter."},{"id":21,"name":"Maple Oat Banana Bread","tags":["Cake","Lunch","Breakfast"],"servings":"1 loaf","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["oat flour","whole wheat flour","baking soda","cinnamon","almond milk","apple cider vinegar","bananas","maple syrup","vanilla extract","sugar"],"ingredientlist":["2 cups ;oat flour; (blended oats)","1 cup ;whole wheat flour;","2 tsp ;baking soda;","1/2 tsp ground ;cinnamon;","1/2 tsp salt","1/4 cup ;almond milk;","1/4 tsp ;apple cider vinegar;","4 ;bananas;, mashed","1/3 cup ;maple syrup;","3 tbsp olive oil","1 tsp ;vanilla extract;","1 tbsp ;sugar;"],"directions":"Heat your oven to 180C. Grease and flour a loaf pan so the bread won't stick.\nGrab a medium bowl and mix together the flours, baking soda, cinnamon and salt. Set aside.\nIn a small glass, mix together the milk and vinegar. Then grab a large bowl and mix together the mashed banana, maple syrup, olive oil and vanilla. Add the milk mixture and mix again. Add the bowl with the dry ingredients to the wet ones and mix until there are no more dry spots in the batter.\nPour the batter into the loaf pan and sprinkle the sugar over the top. Bake until the top is golden and a toothpick comes out clean. 30-40 minutes. Let cool before cutting."},{"id":22,"name":"Granola","tags":["Breakfast","Vegan"],"servings":"enough for a few weeks","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["whole oats","sunflower seeds","pumpkin seeds","almonds","coconut oil","flaxseed","grated coconut","cinnamon","maple syrup"],"ingredientlist":["250 gr ;whole oats;","100 gr ;sunflower seeds;","75 gr ;pumpkin seeds;","75 gr sliced ;almonds;","60 gr ;coconut oil;","3 tbsp broken ;flaxseed;","50 gr ;grated coconut;","1 tbsp ground ;cinnamon;","Salt","2 tbsp ;maple syrup;"],"directions":"Heat the oven to 180 C. chop up nuts and seeds as needed. Mix the oats, grated coconut, nuts and seeds together in a large bowl.\nMelt the coconut oil and mix in the maple syrup. Mix through the granola mixture and add a good pinch of salt.\nLine a baking tray with parchment and spread the granola mixture onto the paper. Put into the oven and bake for 20-22 minutes until browned, stirring through once halfway. Cool the mixture and put into an airtight container. It should stay crunchy for a good few weeks."},{"id":23,"name":"Crêpes","tags":["Pancakes","Breakfast","Base Recipe"],"servings":"6 crêpes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg","milk","butter","flour"],"ingredientlist":["2 large ;egg;s","1 ½ cup ;milk;","45gr melted ;butter;","Salt","1 cup ;flour;"],"directions":"In a blender, combine 2 large eggs, ½ cup of water. ¾ cup of milk, 3 Tbsp of melted butter, a pinch of salt, and 1 cup of flour. \nPulse the mixture 10-12 times on low power until combined and then scrape down the sides for any loose bits of flour. Pulse a couple more times until you have a thin pancake batter. Let the mixture sit in the refrigerator for one hour to get rid of any bubbles. \nUsing a non-stick skillet or a crêpe maker that is coated with butter, pour your batter in and slowly rotate the pan until the entire surface is covered with batter and it is nice and thin. \nLet cook for 30-60 seconds over medium high heat until it is dappled brown. Flip the crêpe and let cook for an additional 15-30 seconds until it is cooked through."},{"id":24,"name":"Buckwheat Crêpes","tags":["Pancakes","Base Recipe"],"servings":"12 crêpes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["whole milk","egg","buckwheat flour","flour","butter"],"ingredientlist":["1½ to 2 cups/360 to 480 ml ;whole milk;","4 large ;egg;s","½ tsp kosher salt","1 cup/130 g ;buckwheat flour;","½ cup/65 g all-purpose ;flour;","4 tbsp/55 g unsalted ;butter;, melted, plus more for the pan"],"directions":"In a blender, combine eggs, water, milk, melted butter, a pinch of salt, and flours. \nPulse the mixture 10-12 times on low power until combined and then scrape down the sides for any loose bits of flour. Pulse a couple more times until you have a thin pancake batter. Let the mixture sit in the refrigerator for one hour to get rid of any bubbles. \nUsing a non-stick skillet or a crêpe maker that is coated with butter, pour your batter in and slowly rotate the pan until the entire surface is covered with batter and it is nice and thin. \nLet cook for 30-60 seconds over medium high heat until it is dappled brown. Flip the crêpe and let cook for an additional 15-30 seconds until it is cooked through."},{"id":25,"name":"Classic Ham and Gruyère Crêpe","tags":["Pancakes","Breakfast","Lunch"],"servings":"1 filled crepe","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["crème fraîche","Dijon mustard","Gruyère cheese","ham","walnut","capers"],"ingredientlist":["1 tsp ;crème fraîche;","½ tsp ;Dijon mustard;","1 #23#Crêpe# or #24#Buckwheat Crêpe#","¼ cup/20 g grated ;Gruyère cheese;","1 or 2 thin slices good-quality ;ham; (about 1 oz/30 g)","1 tbsp finely chopped toasted ;walnut;s (optional)","1 tsp ;capers;, rinsed and drained (optional)"],"directions":"In a small bowl, stir together the crème fraîche and mustard; set aside. Lay the crêpe presentation-side down in a small skillet and heat over medium-high heat until you feel the crêpe is getting warm, just a few seconds. Sprinkle the cheese over the crêpe, lay the ham in the center, and sprinkle the walnuts and capers (if using) over the ham and cheese.\nAs soon as the cheese begins to melt, fold the bottom, top, and then the sides of the crêpe over the filling toward the center so that the filling is enclosed and you have a flattish rectangular package. Slide the crêpe onto a plate seam-side down, spread the crème fraîche–mustard mixture on the top, and serve right away.\nIf you’re making several of these crêpes, you can slide the folded crêpe onto a baking sheet. Once you’ve made all the crêpes, reheat them for a few minutes in a 400°F/200°C/ gas 6 oven."},{"id":26,"name":"Crêpes with Sautee Pears","tags":["Pancakes","Breakfast","Lunch"],"servings":"2 filled crepes","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["oil","butter","pear","fresh thyme","black pepper","Gouda"],"ingredientlist":["1 tsp extra-virgin olive ;oil; or unsalted ;butter;","1 ripe medium ;pear; (about 5 oz/140 g), peeled, cored, and thinly sliced","¼ tsp chopped ;fresh thyme;","Kosher salt and freshly ground",";black pepper;","2 #23#Crêpes# or #24#Buckwheat Crêpes#","¾ cup/40 g lightly packed shredded aged ;Gouda;"],"directions":"Position rack in the center of the oven and preheat to 200°F/95°C. \nHeat the olive oil in a medium skillet over medium-high heat. Add the pear slices, sprinkle them with the thyme, and season generously with salt and pepper. Cook the pears, gently ﬂipping them over once and taking care not to break up the slices too much, until just tender, about 2 minutes per side. Slide the pears onto a plate.\nWipe out the skillet and return it to medium-high heat. Lay a crêpe in the skillet presentation-side up. Let the crêpe heat through for about 15 seconds, ﬂip it, and then sprinkle the surface with half of the cheese. Arrange half of the pear slices on one half of the crêpe, then fold the other half over the pears. Slide the crêpe onto a serving plate and fold it in half again to make a loose triangle. Keep the crêpe warm in the oven while you repeat with the remaining ingredients. Serve right away."},{"id":27,"name":"Crêpe Suzette","tags":["Pancakes","Breakfast","Dessert"],"servings":"2 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["butter","Sugar","orange"],"ingredientlist":["1 recipe #23#Crêpes#","3 Tbsp ;butter;",";Sugar;","1 ;orange;","Dry sherry or cognac","Vanilla ice cream to serve"],"directions":"Melt 3 tablespoons of butter in a large sauté pan and add at least 2 tablespoons of sugar. Then, add the zest and juice from any type of orange of your choice. \nBring the mixture to a simmer and gently swirl to incorporate all of the sugar. \nBegin dunking your pre-prepared crêpes into the liquid and make sure that it is nicely coated on both sides of the bottom half of the crêpe. \nLay the crêpe down in the liquid and fold it in half double quesadilla style. \nRinse and repeat with two additional crêpes and arrange them into a quadrant. Cook for about one minute on the first side before flipping to make sure that they are nice and evenly coated. \nLet the crêpes sit in the pan for 3-5 minutes over medium heat until they are nice and caramelized on one side. Arrange the crêpes on a plate.\nFlambe over the stovetop with either dry sherry or cognac. \nGently pour over the crêpes or add one scoop of vanilla ice cream to top everything off."},{"id":28,"name":"Healthyish Breakfast Sandwiches","tags":["Breakfast","Sandwich","Vegetarian"],"servings":"2 sandwiches","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["red onion","soy sauce","garlic powder","olive oil","basil","cilantro","dill","hot sauce","butter","egg","bread","cheese"],"ingredientlist":["1 medium ;red onion;, trimmed, cut in half through equator, peeled, separated into rings","1 tsp. ;soy sauce;","½ tsp. ;garlic powder;","2 Tbsp. extra-virgin ;olive oil;, divided","Kosher salt","¼ cup finely chopped soft herbs, such as ;basil;, ;cilantro;, and/or ;dill;","2 Tbsp. green or red ;hot sauce;","1 Tbsp. unsalted ;butter;","4 large ;egg;s, lightly beaten","2 whole-grain slices of ;bread;, toasted","2 oz. sliced sharp cheddar ;cheese;"],"directions":"Preheat oven to 180°. Toss onion, soy sauce, garlic powder, and 1 Tbsp. oil on a large rimmed baking sheet to coat. Season with salt. Bake, tossing once halfway through, until onion is browned around the edges and very tender, 25–35 minutes. Let cool 5 minutes.\nMeanwhile, toss herbs, hot sauce, and remaining 1 Tbsp. oil in a small bowl. Season with salt, if needed.\nMelt butter in a small nonstick skillet over medium heat. Add eggs; season with salt. Cook, stirring with a rubber spatula, until eggs have set into creamy folds, 1–2 minutes.\nSpread herb sauce on cut sides of muffins. Transfer bottom halves to a rimmed baking sheet. Top with eggs, then lay cheese over. Bake bottom halves just until cheese is melted, about 5 minutes. Top with onion and close with muffin tops."},{"id":29,"name":"Bladerdeegbroodjes met Pizza Vulling","tags":["Lunch","Take out","Sandwich","Pizza"],"servings":"10 broodjes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["bladerdeeg","gedroogde tomaat","salami","mozzarella","pesto","ei"],"ingredientlist":["10 plakken ;bladerdeeg;","6 ;gedroogde tomaat;jes","6 dunne plakken ;salami;","1 bol ;mozzarella;","5 eetlepels ;pesto;","1 ;ei;"],"directions":"Verwarm de oven op 200 graden. Laat de plakjes bladerdeeg iets ontdooien. Snijd de salami, mozzarella en tomaatjes in stukjes. Snijd de vellen bladerdeeg 1 x doormidden. Leg 1 helft op de bakplaat met bakpapier en besmeer met wat pesto en beleg met salami, tomaat en mozzarella. Snijd een paar gleufjes in de andere helft bladerdeeg en dek de belegde plak hiermee af.\nDruk de zijkanten heel goed op elkaar met een vork. Herhaal dit met alle plakken en ingrediënten. Klop het ei los en besmeer de bovenzijde van de bladerdeegbroodjes. Bak ze in 25 minuten krokant."},{"id":30,"name":"Egg Salad with Green Chiles","tags":["Breakfast","Lunch","Sandwich","Egg"],"servings":"3 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["curry powder","green onion","egg","mayonaise","green chiles"],"ingredientlist":["1-2 tsp yellow ;curry powder;","1 ;green onion;, chopped","2 large hardboiled ;egg;s, mashed","3tbsp ;mayonaise;","6 ;green chiles;, chopped","A few cranks of black pepper"],"directions":"Mix everything together, put on bread."},{"id":31,"name":"Broodje Zeedijk","tags":["Lunch","Take out","Sandwich","Chicken"],"servings":"2 grote pistolets","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["2 kleine stokbroden of pistolets","250 gram gerookte kipfilet(poelier)","4 lange plakken ontbijtspek , dun gesneden ","2 bladen gewone sla ","","saus:","5 el. zaanse mayonaise","1 el. kerrie masala ","1 tl. mosterd poeder","1 tl. cayenne poeder","2 tl. Citroensap"],"directions":"Meng alle ingrediënten voor de saus , en zet weg voor een uur.\nbak het spek zonder boter of olie naar gewenste gaarheid.\nsnijdt de stokbroodjes open, en besmeer licht met de saus , vervolgens de sla , kip, spek en als laatste weer een flinke dot saus."},{"id":32,"name":"Ultimate Soul Scrambled Eggs","tags":["Breakfast","Lunch","Fridge Clearing","Egg","Vegetarian"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["egg","milk","butter","black beans","green chiles","taco sauce","cheese","green onions","tomato"],"ingredientlist":["8 large ;egg;s","60 mL ;milk;","salt and pepper","1 Tbsp ;butter;","400 gr. can ;black beans;","100 gr  diced ;green chiles;","60 mL ;taco sauce;","100 gr ;cheese;, shredded","2 ;green onions;","1 small ;tomato;","Any other things you have lying around in the fridge"],"directions":"Rinse the can of beans in a colander and let drain as you prepare the eggs.\nIn a large bowl, combine the eggs, milk, a pinch of salt, and pepper. Whisk until fairly smooth.\nHeat a large skillet over medium-low heat. Once hot, add the butter and let it melt. Spread the butter over the surface of the skillet with a spatula. Pour the whisked eggs into the skillet and gently fold them with the spatula as they begin to set. Avoid over stirring the eggs.\nWhen the eggs are about 75% set (still soft, moist, and fluid around the edges), add the drained beans and chopped green chiles (no need to drain the chiles). Gently fold the beans and chiles into the scrambled eggs. Drizzle taco sauce over the eggs, then top with cheese.\nPlace a lid on the skillet and let it warm until the eggs are fully set and the cheese on top is melted.\nWhile the eggs are warming through, slice the green onions and dice the tomato. Top the eggs with the fresh tomato and green onion just before serving."},{"id":33,"name":"Ploughman's Sandwich","tags":["Sandwich","Lunch","Pork"],"servings":"2 sandwiches","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1 tbsp salted butter, softened","1 tbsp mayonnaise","1 tsp english mustard","4 slices multigrain bread","2 tbsp piccalilli","1/2 pink lady apple","8 slices good quality honey roast ham (leftovers would be ideal!)","4 slices cheddar cheese","1 little gem lettuce"],"directions":"Spread the butter, mayo and mustard over one side of each bread slice.\nFinely dice the apple and stir it into the piccalilli. Spread it over two slices of buttered bread, making sure that it reaches all of the edges.\nPlace the lettuce onto the buttered side of two of the slices, add the ham slices followed by the cheese slices. Make sure that the fillings all cover the whole slice of bread. Sandwich with the other slices, butter side down. Slice into quarters and enjoy!"},{"id":34,"name":"Roti John","tags":["Lunch","Sandwich","Beef"],"servings":"4 sandwiches","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["onion","garlic","green chili","green pepper","peanut oil","minced beef","curry powder","egg","baguette","butter","coriander","spring onions","sriracha","mayonnaise"],"ingredientlist":["1 small ;onion;","1 clove ;garlic;","1 ;green chili;","1 ;green pepper;","1 tbsp ;peanut oil;","300 gr ;minced beef;","1 tbsp ;curry powder;","4 ;egg;s","4 short ;baguette;s","1 tbsp ;butter;","2 sprigs ;coriander;, chopped","2 ;spring onions;, chopped","2 tbsp ;sriracha;","2 tbsp ;mayonnaise;"],"directions":"Peel and finely dice the onion. Peel and mince the garlic. Finely dice and deseed the chilli and green pepper. Heat the oil in a frying pan, over a medium-high heat and fry the onion, garlic, chilli and pepper for 10 minutes, stirring regularly, until the veg begins to soften. Transfer to a small bowl and wipe the pan clean.\nAdd a little more oil and turn the heat right up. Fry the beef, not moving it too much, so that it browns really well. Stir and repeat to get it really brown. it can end up in chunks… that’s ok! Add the veg back into the pan after 15 minutes of frying, then stir in the curry powder. Fry for another few minutes, season well with salt and leave to cool for 5 minutes.\nCrack the eggs into a large mixing bowl and whisk. Tip most of the beef mixture, saving 4 tbsp for garnish into the eggs and stir to combine everything. Slice the baguettes open lengthways and spread the beef/egg mixture over the inside of the baguette.\nWipe out your frying pan again and add the butter. Let it foam up, then add the baguette, filling side down. Fry for 2 minutes, until the egg begins to brown. Close the baguette like a sandwich and fry the outside to get it to crisp up.\nSlice the sandwich in half and garnish the top with some extra beef mince, sliced spring onions, chopped coriander, ketchup and mayonnaise. Serve up and enjoy! Makes 2 baguettes"},{"id":35,"name":"Banh Mi","tags":["Lunch","Sandwich","Pork"],"servings":"2 Baguettes","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["baguette","paté","mayonaise","cucumber","jalapeno","coriander","maggi","carrot","daikon","sugar","salt","sugar","vinegar","soy sauce","fish sauce","ginger","garlic","shallot","pork shoulder"],"ingredientlist":["2 small baguettes or 1 halved ;baguette;","100 gr ;paté;",";mayonaise;","1 ;cucumber;, in sticks","1 fresh ;jalapeno;, in rings","Half a bunch of chopped ;coriander;",";maggi;","Half a large ;carrot;, grated","Half a ;daikon;, grated","1 tsp ;sugar;","1 tsp ;salt;","2 tbsp ;sugar;, for in the pickle","4 tbsp ;vinegar;, preferably rice wine","Marinade:","1 tbsp ;soy sauce;","1 tbsp ;fish sauce;","1 tsp ;ginger;, grated","1 tsp ;garlic;, grated","1/2 ;shallot;, diced","200 gr ;pork shoulder;","Neutral oil for frying"],"directions":"Mix the carrot and daikon with the teaspoons of salt and sugar. Mix very well and set aside for at least 10 minutes. After the 10 minutes, rinse the carrot and daikon. Mix the sugar and vinegar until the sugar dissolves then add the carrot and daikon. Set aside for at least an hour.\nMix all the marinade ingredients together. Try to cut the pork shoulder in as thin as possible slices, freeze the pork an hour ahead to make this easier. Mix the meat and marinade and set aside for at least half an hour.\nHeat a skillet on high and heat the oil. Fry the pork for about 2.5 minutes on each side until it's a little crispy and sticky.\nTo assemble, cut open the baguettes and spread the mayo and pate on both sides. Add the pork, then the slaw, cucumber, jalapeno and coriander. Finish with a couple of drops of maggi."},{"id":36,"name":"Pizza Dough","tags":["Pizza","Base Recipe"],"servings":"2 pizza's","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["yeast","flour","sugar"],"ingredientlist":["7 gr instant ;yeast;","425 gr all-purpose or bread ;flour;","2 tsp salt","1 tsp ;sugar;","250 gr (1 cup) water, warm from thetap","3 Tbsp extra virgin olive oil"],"directions":"In the bowl of a stand mixer, whisk together the rapid rise yeast (if using), flour, salt, and sugar. With the dough hook attached, on the slowest speed, mix in the water and 2 tablespoons of the olive oil. When the flour is fully incorporated into a dough, increase the speed by one.\nWhen the dough begins to come away from the sides of the bowl, stop the mixer, remove the dough hook, and cover the bowl with plastic wrap and allow to ferment on the counter for 2 hours. The dough will become bubbly and much larger in size."},{"id":37,"name":"Pizza rolls","tags":["Pizza","Lunch","Fridge Clearing"],"servings":"12 rolls","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["pizza sauce","basil","garlic powder","mozzarella"],"ingredientlist":["Half of the #36#pizza dough# recipe ","2 teaspoons olive oil","150 mL (2/3 cup) ;pizza sauce;","Italian seasoning or ground ;basil;, to taste",";garlic powder;, to taste","115 gr (1/2 cup) shredded ;mozzarella; cheese","One or two pizza toppings you like"],"directions":"roll out the dough into a large rectangle, about 10x12 inches. Using your fingers, push dents into the surface of the dough rectangles to prevent bubbling. Spread the sauce over the rectangle. Season with salt, Italian seasoning and garlic powder.\nSprinkle the mozzarella over the sauce, then top with your preferred pizza toppings. Carefully roll dough rectangle into a tight log. Put the log onto a clean plate or baking sheet and leave to chill in the fridge for at least 20 minutes to make slicing easier.\nPreheat the oven to 200 C. Line a baking sheet with parchment paper. Remove the log from the fridge and slice into 12 slices. Sprinkle the tops with extra cheese if desired.\nBake the rolls for 15-20 minutes or until the sides are lightly browned. Cool for 5 minutes and serve with extra pizza sauce for dipping."},{"id":38,"name":"Buffalo Tempeh Sandwiches","tags":["Vegetarian","Sandwich","Lunch"],"servings":"4 buns","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["butter","hot sauce","smoked paprika","garlic powder","tempeh","cabbage","carrot","ranch dressing","hamburger buns","avocado"],"ingredientlist":["BUFFALO SAUCE","2 Tbsp melted ;butter;","3 Tbsp ;hot sauce;","1/8 tsp ;smoked paprika;","1/16 tsp ;garlic powder;","1/8 tsp salt","FRIED TEMPEH","225 gr (8 oz) ;tempeh;","2 Tbsp cooking oil","RANCH SLAW","225 gr (8 oz) coleslaw mix (shredded ;cabbage; and ;carrot;)","60 mL (1/4 cup) ;ranch dressing;","SANDWICHES","4 large ;hamburger buns;","1 ;avocado;"],"directions":"Whisk together the melted butter, hot sauce, smoked paprika, garlic powder, and salt. Set the buffalo sauce aside.\nAdd the coleslaw mix to a large bowl, then pour the ranch dressing over top. Stir until the shredded cabbage and carrots are coated in dressing, then refrigerate until later.\nSlice the tempeh into 1/4-inch thick slices. Heat 1 Tbsp cooking oil in a large skillet over medium. Once the skillet and oil are hot, swirl to coat the surface of the skillet in oil, then add the tempeh slices. Fry the slices until golden brown on the bottom, then flip and cook on the second side. Add an additional tablespoon of oil for the second side, if needed (tempeh tends to absorb the oil).\nPlace the fried tempeh slices in a bowl. Reheat the buffalo sauce and stir until smooth (microwave 15 seconds), then pour it over the tempeh. Stir the tempeh until it is coated in buffalo sauce.\nTo build the sandwiches, lay down a thick layer of the ranch slaw on a roll, then top with the buffalo tempah and sliced avocado. Enjoy!"},{"id":39,"name":"Croque Madame","tags":["Sandwich","Lunch","Pork"],"servings":"2 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["whole milk","bay leaves","thyme","nutmeg","flour","butter","gruyere","dijon mustard","brioche","ham","egg","parsley"],"ingredientlist":["For The White Sauce","400 ml ;whole milk;","2 ;bay leaves;","1 sprig ;thyme;","1 pinch ;nutmeg;","25 g ;flour;","25 g ;butter;","100 g ;gruyere;","1 tbsp ;dijon mustard;","To Construct","4 thick slices ;brioche;","400 g sliced ;ham;","2 tbsp oil","2 ;egg;s","1 tbsp fresh chopped ;parsley;"],"directions":"In a small saucepan bring the milk to the boil with the bay leaves, thyme and nutmeg. Melt the butter in a medium sized saucepan. Whisk in the flour and cook for a minute. Remove the bay leaves from the milk and slowly pour it into the flour, whisking constantly. Stop when you have the desired white sauce consistency. Grate in the gruyere and let it melt in, then add the mustard.\nTake 2 slices of bread per sandwich. Spread the sauce over the inside of the top and bottom bread slices. Layer the ham generously onto the bottom slice. Spread the sauce over both sides of each middle slice and place it onto the ham, then add more ham, followed by the top slice, sauce side down.\nPreheat the grill to high. Heat a frying pan over a high heat and add the sandwiches. Cook for a few minutes on each side until the bread is toasted, then transfer the sandwiches to a baking tray. Spread a little more sauce over the top of each sandwich, then grill for a minute until golden and bubbling.\nAdd the oil to a frying pan over a high heat. Crack the eggs into the frying pan and let them bubble. Spoon the hot oil over the egg for a few minutes, until the white is fully cooked and the yolk is still soft."},{"id":40,"name":"Kedgeree met Kip","tags":["Chicken","Main Dishes","Rice"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["25gr boter","2el olijfolie","1ui gesnipperd","1teen knoflook, geperst","2tl kerrie","300gr gekookte basmatirijst","200gr gekookte kip","Schil van 1 citroen(dont waste stuff)","4 gekookte eieren","Dille"],"directions":"Fruit de ui 10min, voeg de knoflook toe bak 1min\nVoeg de kerrie door bak 1min en roer de rijst erdoor\nVoeg de kip en citroenschil toe, verhit 1-2min alvorens de dille en ei toe te voegen\nBreng op smaak, doe er een sla bij"},{"id":41,"name":"Chicken Arrabbiata","tags":["Chicken","Pasta","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken thighs","flour","garlic","tomato","tomato","basil","red pepper","chicken broth","parsley","pasta"],"ingredientlist":["2 Tbsp olive oil","6 bone-in ;chicken thighs; (2.5 lbs)","Pinch salt and pepper","1/3 cup all-purpose ;flour; for dredging","4 cloves ;garlic;","15 oz can diced ;tomato;es","15 oz can crushed ;tomato;es","1/2 tsp dried ;basil;","1/4 tsp crushed ;red pepper; or more to taste","1/2 cup ;chicken broth;","handful ;parsley; for garnish (optional)","12 oz ;pasta; for serving"],"directions":"Season the chicken thighs with a pinch of salt and pepper, then dredge each piece in flour until they are lightly coated.\nHeat the olive oil in a large skillet over medium heat. When the oil is hot, add the chicken. Brown the chicken on both sides (5-7 minutes each side), then remove the chicken from the skillet. While the chicken is browning, mince the garlic.\nAfter the chicken is removed from the skillet, add the minced garlic and sauté briefly. Add cans of tomatoes, basil, crushed red pepper, and chicken broth to the skillet.\nReturn the chicken to the skillet with the sauce, and spoon some sauce over top of each piece. Allow the sauce to come up to a simmer. Simmer the chicken in the sauce for 30 minutes, turning the chicken over half way through to make sure both sides receive adequate heat.\nServe the chicken and sauce over cooked pasta and garnish with roughly chopped parsley."},{"id":42,"name":"Sweet Chili Chicken Bowls","tags":["Chicken","Rice","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["pineapple","black beans","mango","garlic","ginger","lime","sweet chili sauce","chicken breast","jasmine rice","cilantro"],"ingredientlist":["1 20 oz. can crushed ;pineapple; in juice","1 15 oz. can ;black beans;","1 medium ;mango;","3 cloves ;garlic;, minced","2 inches fresh ;ginger;, grated","1 medium ;lime;","3/4 tsp salt","1/4 cup ;sweet chili sauce;","1 large 3/4 lb. boneless, skinless ;chicken breast;","4 cups cooked ;jasmine rice;","1/4 bunch fresh ;cilantro;, optional"],"directions":"Add the crushed pineapple (with juice), black beans (rinsed and drained), cubed mango, minced garlic, grated ginger, juice from the lime, salt, and sweet chili sauce to the slow cooker. Stir to combine the ingredients.\nAdd the chicken breast to the slow cooker and cover it with the fruit and bean mixture. Place the lid on the slow cooker and cook on high for four hours (or low for 8 hours).\nAfter cooking the chicken will be very tender. Use two forks to pull the chicken apart into shreds. Stir to evenly distribute the shredded chicken throughout the mixture.\nSpoon one cup of cooked jasmine rice into a bowl followed by one cup of the sweet chili shredded chicken. Add fresh cilantro on top and serve."},{"id":43,"name":"Sweet 'n' Spicy Chicken Bowls","tags":["Chicken","Main Dishes","Rice"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["SPICE MIX","1 tsp mild chili powder","1/2 tsp cumin","1/4 tsp garlic powder","1/4 tsp smoked paprika","1/8 tsp cayenne pepper","Freshly Cracked Pepper to taste","1/4 tsp salt","1 Tbsp olive oil","1 Tbsp honey","1/2 tsp apple cider vinegar","RICE","1 cup uncooked brown rice","1 3/4 cup chicken broth","BOWL INGREDIENTS","2 chicken breast (400gr)","1 220gr. can pineapple tidbits in juice","1 400gr. can black beans","1 ripe avocado","2 green onions","1/4 bunch cilantro (optional)"],"directions":"Begin by cooking the rice. As soon as it reaches a full boil, turn the heat down to low and let simmer for 25 minutes. Let it sit undisturbed, with the lid in place for 10 minutes. Fluff with a fork.\nPrepare the honey spice mix by combining the chili powder cumin, garlic, smoked paprika, cayenne, freshly cracked pepper, salt, honey, olive oil, and apple cider vinegar in a bowl.\nChop the chicken breast into small pieces. Add it to the bowl with the honey spice mix and toss to coat. Set the seasoned meat aside while you prepare the rest of the bowl ingredients.\nRinse and drain the black beans. Drain the pineapple, then chop the tidbits into smaller pieces. Slice the green onions. Rinse and roughly chop the cilantro. Cube the avocado\nHeat a large non-stick skillet over medium heat. Add the chopped and seasoned chicken pieces and sauté until cooked through and slightly browned (5-7 minutes).\nBuild the bowls by adding 3/4 cup cooked rice to each bowl, followed by 1/4 of each of the following: cooked chicken, black beans, pineapple, avocado, green onions, and cilantro."},{"id":44,"name":"BBQ Chicken Burrito Bowl","tags":["Chicken","Main Dishes","Rice"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken breast","BBQ sauce","cooked rice","black beans","corn","zucchini","cheese","green onions","avocado"],"ingredientlist":["1 cooked ;chicken breast;","1/2 cup ;BBQ sauce;","4 cups ;cooked rice;","15 oz can ;black beans;","1 cup frozen ;corn; kernels, thawed","1 small ;zucchini;","4 oz pepper jack ;cheese;","2 ;green onions;","1 small ;avocado;"],"directions":"Chop or shred the chicken breast and mix with 2-3 tablespoons of BBQ sauce until the meat is well coated.\nDrain and rinse the black beans. Cut the zucchini into small cubes (1/4-1/2\"), shred the pepper jack, slice the green onions, and pit and slice the avocado.\nTo build the bowls, place 1 cup cooked rice in the bottom of each bowl. Divide the chicken, beans, corn, zucchini, shredded cheese, green onions, and avocado slices equally among all four bowls. Drizzle one more tablespoon of BBQ sauce over top and serve, or refrigerate until ready to eat."},{"id":45,"name":"Creamy Chicken Fajita Pasta","tags":["Chicken","Pasta","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["chili powder","smoked paprika","onion powder","garlic powder","cumin","cayenne","sugar","chicken breast","bell pepper","onion","diced tomatoes","cream cheese","green onions"],"ingredientlist":["FAJITA SPICE MIX","2 tsp ;chili powder;*","1 tsp ;smoked paprika;","1/4 tsp ;onion powder;","1/4 tsp ;garlic powder;","1/4 tsp ;cumin;","1/8 tsp ;cayenne;","1/2 tsp ;sugar;","1/2 tsp salt","","CHICKEN PASTA","1 Tbsp cooking oil","1 boneless skinless ;chicken breast; (about 0.75 lb.)","1 ;bell pepper;","1 yellow ;onion;","15 oz can fire roasted ;diced tomatoes;","4 oz ;cream cheese;","8 oz pasta (any shape)","2 ;green onions;, sliced"],"directions":"Combine the spices for the fajita spice mix in a bowl and set aside. Dice the onion and bell pepper, and cut the chicken breast into 1/2-inch cubes.\nBring a large pot of water to a boil for the pasta. Once boiling, add the pasta and continue to boil until tender. Drain the pasta in a colander and set it aside until ready to use.\nWhile waiting for the pasta to cook, heat 1 Tbsp cooking oil in a large skillet over medium heat. Once hot, add the cubed chicken and the fajita spice mix. Sauté the chicken and spices until the chicken is cooked through and slightly browned. Remove the chicken from the skillet to a clean bowl.\nAdd the onion and bell pepper to the skillet and continue to sauté over medium heat just until they begin to soften slightly on the edges and have a little brown color. Add the canned tomatoes (with juices) and the cream cheese. Stir the mixture over medium heat until the cream cheese melts in and forms a creamy sauce with the tomatoes.\nFinally, add the cooked and drained pasta and cooked chicken back to the skillet. Stir until everything is evenly combined and coated in creamy sauce. Top with sliced green onions and serve."},{"id":46,"name":"Easy Oven Fajitas","tags":["Main Dishes","Chicken","Tortillas"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chili powder","paprika","onion powder","garlic powder","cumin","cayenne pepper","sugar","onion","bell pepper","chicken breast","lime","tortillas","sour cream","cilantro"],"ingredientlist":["SEASONING","1 Tbsp ;chili powder;","1/2 Tbsp ;paprika;","1/2 tsp ;onion powder;","1/4 tsp ;garlic powder;","1/4 tsp ;cumin;","1/8 tsp ;cayenne pepper;","1 tsp ;sugar;","1/2 tsp salt","FAJITAS","2 small or 1 large ;onion;","3 ;bell pepper;s, any color","1 lb. ;chicken breast;","2 Tbsp vegetable oil","1 medium ;lime;","6-inch ;tortillas;","1/2 cup ;sour cream; (optional)","1/4 bunch ;cilantro; (optional)"],"directions":"Preheat the oven to 210 degrees. Mix all of the spices for the seasoning in a bowl and set aside.\nCut the onion and bell peppers into 1/4-inch wide strips. Place them in a large 13x15-inch casserole dish or a large baking sheet. Slice the chicken breast into very thin strips and add it to the casserole dish with the vegetables.\nDrizzle the vegetable oil over the chicken and vegetables, then sprinkle the fajita seasoning mix over top. Use your hands to toss the ingredients until everything is well coated in oil and seasoning. Bake in the preheated oven for 35-40 minutes, stirring once half way through. Squeeze the juice from half of the lime over top of the meat and vegetables after.\nWhile the fajita mix bakes, toast each tortilla, serve with sour cream and cilantro."},{"id":47,"name":"Chicken Shawarma","tags":["Chicken","Main Dishes","Wrapped"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken breast","yogurt","garlic","lemon juice","cinnamon","oregano","nutmeg","cloves","greek yogurt","garlic","dill","lettuce","cucumber","red onion","Feta"],"ingredientlist":["CHICKEN & MARINADE","2 large ;chicken breast;s (1.25 lbs)","1/2 cup plain ;yogurt;","1 Tbsp ;garlic;, minced","1 Tbsp ;lemon juice;","1/2 tsp ;cinnamon;","1/2 tsp dried ;oregano;","1/2 tsp salt","1/4 tsp ground ;nutmeg;","1/4 tsp ground ;cloves;","","YOGURT SAUCE","7 oz cup plain ;greek yogurt;","1/4 tsp ;garlic;, minced","1/4 tsp dried ;dill;","1/4 tsp salt","SANDWICH","6 big pitas, or homemade flatbread","1/2 head romaine ;lettuce;","1 medium ;cucumber;","1 ;red onion;",";Feta;(optional)"],"directions":"In a small bowl, combine the ingredients for the marinade. Add chicken to the marinade, coat well, cover and refrigerate for 4-24 hours. If desired, slice the chicken into strips before marinating to maximize the flavor.\nPrepare the yogurt sauce for the sandwiches. Open a 7 oz. container of plain greek yogurt and stir in the garlic, dill, and salt. Refrigerate until ready to use.\nAfter marinating the chicken, grill until cooked through. \nPrepare the vegetables for the sandwich. Chop, rinse, and drain the lettuce in a colander. Wash and slice the cucumber and tomato.\nBuild the chicken shawarma sandwiches. Spread the yogurt sauce on your flat bread, top with the chicken and vegetables. Roll the sandwich closed. You can wrap the sandwich in foil to help it stay closed as you eat."},{"id":48,"name":"Arroz con Pollo","tags":["Chicken","Rice","Main Dishes","Fridge Clearing"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["Olive oil","600gr of chicken(with bone if possible)","1/4 cup of flour","Salt and pepper","Paprika","Onion","1 clove of garlic","1 cup of rice","2 cups of chicken stock(or beer(or both))","1 tbsp tomato paste","Pinch of oregano","Pinch of cumin","Optional:","Olives","Mango","Peas"],"directions":"Heat oil in a large skillet that has a cover over medium high. Put the flour in a wide bowl, mix in salt, pepper and paprika. Dredge the chicken pieces lightly in the flour mixture and let brown. Use a slotted spoon to remove and set aside.\nAdd the rice to the pan to brown, add a bit more oil if needed. Stir first to coat the rice, don't stir too much. Add the onion and garlic and cook until the onions have softened.\nPlace the chicken on top of the rice. In a seperate bowl, mix together stock, tomato paste, salt and oregano. Pour over the rice and chicken. Bring to a simmer, reduce heat to low and cover. Let cook for 20-25 minutes. Fluff rice with a fork and serve."},{"id":49,"name":"Make Ahead Bean and Cheese Burritos","tags":["Base Recipe","Fridge Clearing","Main Dishes","Wrapped","Rice"],"servings":"8 burritos","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["garlic","chili powder","cumin","oregano","black beans","cheddar","green onions","taco sauce","tortillas"],"ingredientlist":["SEASONED RICE","1 Tbsp cooking oil","1 clove ;garlic;, minced","1 tsp ;chili powder;","1/4 tsp ;cumin;","1/4 tsp ;oregano;","1 cup long grain white rice","1/2 tsp salt","2 cups water","BURRITOS","2 15oz. cans ;black beans;","2 cups shredded ;cheddar;","2 ;green onions;","1/2 cup ;taco sauce;","8 large flour ;tortillas;","OPTIONAL FILLINGS","400gr marinated chicken","300gr minced meat or meat meat substitute","Scrambled eggs","Jalapenos","Pulled pork and pineapples"],"directions":"Begin making the seasoned rice first, so you can prepare the rest of the ingredients as the rice cooks. Add the cooking oil and minced garlic to a sauce pot and sauté over medium for about one minute, just to take the raw edge off the garlic.\nAdd the chili powder, cumin, oregano, and rice to the pot. Continue to sauté, stirring continuously, for about two more minutes to toast the rice and spices.\nCarefully add the water and salt to the pot, place a lid on top, and turn the heat up to high. Allow the pot to come up to a boil, then turn the heat down to low. Allow the pot to simmer on low for 15 minutes. After 15 minutes, turn the heat off, and let the rice rest undisturbed for five more minutes. Finally, fluff the rice with a fork.\nWhile the rice is cooking, rinse and drain the black beans well. Slice the green onions.\nWhen the rice is finished cooking and you're ready to assemble the burritos, stack four tortillas on a large plate and place a damp paper towel over top. Microwave for 30 seconds to steam the tortillas, to make them more pliable and easy to roll. Steam the next four tortillas only when you're ready to begin working with them.\nTo each tortilla add about 1/4 cup rice, 1/4 cup beans, 1 Tbsp taco sauce, 1/4 cup shredded cheddar, and a few slices of green onion. Roll the burritos up tightly, making sure to fold in the sides first to hold in the the filling. \nStore the burritos in an air-tight container in the refrigerator for 4-5 days, or wrap each burrito individually in parchment paper or plastic wrap, then place in a freezer bag, and store for up to three months.\nTo Cook from Refrigerated: Place the burrito in a skillet or on a grill pan and cook over medium-low heat until the outside is brown and crispy and the cheese is melted on the inside.\nTo Cook from Frozen in Microwave: Set the microwave to the defrost setting for approximately 9 minutes, or the defrost by weight setting, programmed to one pound.\nTo Cook from Frozen in the Oven: Wrap the burrito in foil and bake in a preheated 220ºC oven for approximately 45-50 minutes."},{"id":50,"name":"Creamy Salsa Chicken","tags":["Chicken","Rice","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken breast","chili powder","cumin","garlic powder","salsa","black beans","corn","sour cream","queso fresco","feta","cilantro","green onions"],"ingredientlist":["1 lb. boneless, skinless ;chicken breast;","1 tsp ;chili powder;","1/2 tsp ;cumin;","1/4 tsp ;garlic powder;","1/4 tsp salt","1/2 Tbsp cooking oil","16 oz. jar ;salsa;","15 oz. can ;black beans;","1/2 cup frozen ;corn; kernels","1/3 cup ;sour cream;","2 oz. ;queso fresco; or ;feta;","1 handful fresh ;cilantro; or sliced ;green onions;","4 cups cooked rice for serving"],"directions":"Pat the chicken dry with a paper towel. Place the chicken on a cutting board and cover it with a piece of plastic wrap. Use a mallet or rolling pin to gently pound the chicken to an even thickness.\nCombine the chili powder, cumin, garlic powder, and salt in a small bowl. Sprinkle the spices over both sides of the chicken, and then rub it over the surface to make sure it's evenly coated.\nHeat a large deep skillet over medium heat. Add the cooking oil and swirl to coat the surface. Add the chicken and cook on both sides until browned and cooked through (5 minutes each side). \nWhile the chicken is cooking, rinse and drain the black beans. Roughly chop the cilantro or slice the green onions, depending on which you prefer to use.\nTransfer the cooked chicken to a clean cutting board and let it rest while you prepare the creamy salsa. Turn the burner down to medium low. Pour the salsa into the skillet and stir to dissolve the browned bits from the bottom of the skillet. Add the black beans and frozen corn kernels and allow the sauce to heat through.\nTo prevent the sour cream from curdling when added to the salsa, first add a few spoonfuls, one at a time, to the sour cream to slowly increase its temperature and acidity. Once the sour cream is slightly warm, add it back to the rest of the salsa in the skillet and stir. Turn the heat off.\nSlice the chicken breast into strips, then place it on top of the creamy salsa sauce in the skillet. Top the skillet with crumbled cheese and cilantro or green onion. Serve over a bed of cooked rice."},{"id":51,"name":"Chicken Satay from the Slowcooker","tags":["Chicken","Main Dishes","Slowcooker","Rice"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken breast","cajun spicing","sweet potato","onion","garlic","cumin","coriander","chili powder","peanut butter","coconut milk","soy sauce","lemon juice"],"ingredientlist":["4 ;chicken breast;s","2 tbsp ;cajun spicing;","2 tbsp vegetable oil","1 ;sweet potato;, in small cubes","Freshly cracked pepper","1 large ;onion;, diced","2 cloves of ;garlic;, minced","2 tsp ;cumin;","2 tsp ground ;coriander;","1 tsp mild ;chili powder;","4 tbsp ;peanut butter;","200 mL ;coconut milk;","3 tbsp ;soy sauce;","1 tbsp ;lemon juice;","A few tablespoons of water"],"directions":"Rub the chicken breasts with cajun. Heat oil in a large pan on high and cook for about 2 minutes or until golden brown on both sides. Put them in the slowcooker and add the sweet potato and black pepper. Turn the heat down lower and sauté the onion and garlic for 5 minutes until soft. Add the cumin, coriander and chili powder and sauté for a minute. Put this mix in the slowcooker.\nMix the peanut butter and coconut milk. Heat the two up together a little to make it easier. Add the soy sauce, lemon juice and water and add to the slowcooker. Give a quick stir, cover, turn on low for 4 hours. Serve with rice and vegetables."},{"id":52,"name":"Cheats Chicken Biryani","tags":["Rice","Chicken","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["red onion","garlic","ginger","butter","chicken thighs","tomato puree","sultanas","spinach","garam masala","chilli powder","turmeric","chicken stock"],"ingredientlist":["250 g basmati rice","2 ;red onion;s","2 cloves ;garlic;","5 g ;ginger;","1 tbsp ;butter;","4 ;chicken thighs;, skin on","1/2 tbsp ;tomato puree;","1 small handful ;sultanas;","125 g ;spinach;","2 tbsp ;garam masala;","1/2 tbsp ;chilli powder;","1/2 tbsp ;turmeric;","100 ml ;chicken stock;","1 tbsp butter"],"directions":"Preheat an oven to 180ºC. Tip the dry rice into a sieve and rinse a few times in cold water. Boil a pan of salted water and chuck in the rice. Cook for 6 minutes, until just cooked but still with bite, then drain.\nMeanwhile, slice the onions and mince the garlic and ginger. Heat the butter in an ovenproof frying pan, over a medium-high heat until it’s foaming. Season the chicken thighs with salt and place them in the pan, skin side down. Fry the chicken for 10 minutes until it’s golden brown, then turn the thighs over and add the onion, garlic and ginger to the frying pan and allow to soften for 5 minutes before adding the tomato puree, sultanas, and spices. Season well with salt. Fry for another few minutes.\nRemove the chicken from the pan and set aside on. Add the spinach to wilt briefly before stirring in the rice briefly. Return the chicken to the pan then pour over the stock and place little pieces of butter all over the rice. Place the dish into the oven and cook for 15 min, until it's very dry on top.\nMeanwhile, peel and slice the red onion for garnish. Serve the rice in the frying pan at the table and top the rice with the onions, yoghurt, almond flakes and lemon wedges. Let everyone dig in!"},{"id":53,"name":"General Tso's Chicken","tags":["Chicken","Rice","Main Dishes","Deep Fry"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["For the chicken and marinade:","2 egg whites ","3 Tbsp dark soy sauce","3 Tbsp Chinese cooking wine","3 Tbsp vodka","¼ tsp baking soda","3 Tbsp cornstarch","750 gr (1 ½ lbs) boneless skinless chicken thighs","For the breading:","120 gr (1 cup) all purpose flour","120 gr (1 cup) cornstarch","1 tsp baking powder","1 tsp salt","3 Tbsp reserved marinade","For the sauce:","4 Tbsp dark soy sauce","4 Tbsp Chinese cooking wine","3 Tbsp rice wine vinegar","4 Tbsp chicken stock","50 gr (¼ cup) sugar","1 tsp roasted sesame seed oil","1 Tbsp cornstarch","6 scallions","4 cloves garlic","2 inch piece of ginger","6-12 arbol chiles (optional)"],"directions":"In a large bowl separate egg whites from 2 eggs and beat the whites until frothy. Add 3 Tbsp dark soy sauce, 3 Tbsp chinese cooking wine, and 3 Tbsp vodka. Beat together and set aside half for later use. In the same large bowl where half mixture remains, add ¼ tsp of baking soda and 3 Tbsp cornstarch, and whisk until smooth. Cut chicken into 1 inch pieces and add to mixture. Mix together by hand, making sure every piece is coated. Cover and set aside for about 20 minutes.\nIn your shallow breading dish, combine 1 cup all purpose flour, 1 cup cornstarch, 1 tsp baking powder, and 1 tsp salt. Pour in 3 Tbsp reserved marinade and incorporate using your fingers until it’s clumpy. Set aside.\nMake the sauce: In a small bowl goes 4 Tbsp dark soy sauce, 4 Tbsp chinese cooking wine, 3 Tbsp rice wine vinegar, 4 Tbsp chicken stock, ¼ cup sugar, 1 tsp roasted sesame seed oil, and 1 Tbsp cornstarch. Whisk until completely smooth.\nFrom 6 scallions, thinly slice all whites and 2 inches of the green. Next grate 4 cloves garlic and 2 inches of ginger. In a saute pan over medium high heat, simmer 2 Tbsp vegetable oil and add most of scallions, grated garlic, and grated ginger. Saute for one minute. Add a dozen arbol chiles (optional) and saute for another minute. Pour in sauce and saute for one more minute until sauce has thickened.\nHeat a quart of vegetable oil to 375°F. Coat chicken in the breading flour mixture while it’s heating. Then add to frying oil one piece at a time and make sure not to crowd, cooking each batch for about 4 minutes. Place batches on wire rack that’s set on a rimmed sheet pan, and place in oven on low heat. Repeat until all chicken is fried. \nAdd chicken to sauce mixture and coat over low heat. Serve with white rice and garnish with leftover sliced scallions. Enjoy!"},{"id":54,"name":"Creamy Chicken and Spinach Quesadillas","tags":["Quesadillas","Chicken","Wrapped"],"servings":"4 quesadillas","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken breast","chili powder","cumin","garlic powder","spinach","cheese","sour cream","tortillas"],"ingredientlist":["1 boneless skinless ;chicken breast; (about 340 gr (3/4 lb))","3/4 tsp ;chili powder;","1/4 tsp ;cumin;","1/8 tsp ;garlic powder;","1/4 tsp salt","1 Tbsp cooking oil","2 cups fresh ;spinach;","115 gr (4 oz.) Monterey jack ;cheese;, shredded","125 gr (1/2 cup) ;sour cream;","4 8-inch flour ;tortillas;"],"directions":"Place the chicken breast on a cutting board and cover with a piece of plastic wrap. Use a rolling pin or mallet to briefly pound the chicken breast to an even thickness.\nCombine the chili powder, cumin, garlic powder, and salt in a small bowl. Sprinkle the spice mixture over both sides of the chicken breast.\nHeat the cooking oil in a skillet over medium heat. Once hot, add the chicken breast and cook on each side until cooked through (about 5 minutes each side). Allow the chicken to cool for 5 minutes on a clean cutting board, then chop into tiny pieces.\nWhile the chicken is cooking, roughly chop the spinach into smaller pieces. Add the chopped chicken, spinach, cheese, and sour cream in a bowl and stir until evenly combined.\nDivide the filling between four tortillas, then fold the tortillas closed. Place the quesadillas (one or two at a time) in a skillet over medium heat. Cook on each side until the tortillas are brown and crispy, and the filling is melted (3-5 minutes each side). Slice each quesadilla in half and serve."},{"id":55,"name":"Grilled Green Chicken Curry","tags":["Chicken","Curry","Thai"],"servings":"4 servings","source":"500 Thaise gerechten p. 51","image":null,"cooktime":null,"preptime":null,"ingredienttags":["cilantro","coconut milk","lemongrass","basil","green chile","garlic","brown sugar","coriander","chicken breast","lime"],"ingredientlist":["For the marinade","8 tbsp chopped ;cilantro;","60 mL ;coconut milk;","1 tbsp chopped ;lemongrass;","5 fresh ;basil; leaves","1/2 ;green chile;, chopped","2 cloves ;garlic;, minced","1/2 tsp salt","1 tsp ;brown sugar;","1/2 tsp freshly cracked black pepper","1/4 tsp ground ;coriander;","For the chicken","4 ;chicken breast;s, halved horizontally","1 tbsp olive oil","1 ;lime; to serve"],"directions":"Start by making the marinade. Put all the ingredients for the marinade in a food processor and mix until smooth. Put the chicken in a shallow bowl and add the marinade, mix well to get everything covered. Cover the bowl(or put it in a plastic bag) and leave to marinade for at least 2 hours, or overnight.\nTake the chicken out of the marinade and gently brush on the olive oil. Heat up a grill or skillet on high heat and cook 4-5 minutes on each side until done. Take the chicken out of the pan and leave to rest for about 5 minutes before serving with lime and leftover cilantro."},{"id":56,"name":"Chicken Rogan Josh","tags":["Chicken","Curry"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["onion","garlic","ginger","red chilli","cumin","cloves","fennel seeds","cardamom pod","curry powder","chicken thigh","tomato puree","cinnamon stick","cayenne","paprika","tomato","chicken stock","cashew nuts","Greek yoghurt","coriander","lemon"],"ingredientlist":["Rogan Josh","2 white ;onion;s","2 cloves of ;garlic;","a thumb-sized piece of ;ginger;","1/2 fresh ;red chilli;","2 tsp ;cumin; seeds","6 indvidual ;cloves;","1 tsp ;fennel seeds;","4 individual ;cardamom pod;s","8 black peppercorns","2 tsp medium ;curry powder;","a splash of coconut oil","8 chopped ;chicken thigh;s","2 tsp ;tomato puree;","1 whole ;cinnamon stick;","2 tsp ;cayenne; pepper","1 tbsp ;paprika;","1 large, fresh ;tomato;","250 ml ;chicken stock;","Cashew Milk","100 g ;cashew nuts;","200 ml water","Raita","2 tbsp ;Greek yoghurt;","a handful of fresh ;coriander;","1 whole ;lemon;"],"directions":"Peel and roughly chop 1 of the onions, the garlic, ginger and chilli. Blitz them up in a spice grinder or mince finely. Slice the second onion and set aside. Chuck the cumin, cloves, fennel seeds, cardamom pods and peppercorns into a frying pan with a glug of coconut oil. Fry the spices gently for a few minutes until they become fragrant. Transfer the spices to spice grinder with the onion and grind to a paste with the curry powder. Rub the paste into the chicken and leave for 30 minutes.\nHeat some more oil in a large saucepan. Add the sliced onions and the chicken to the pan and allow to brown slightly. Throw in the remaining spice paste, the cayenne, paprika, cinnamon stick and the tomato purée. Coat the chicken and onions in the spices and tomato purée, season with salt and cook for a few minutes.\nDice the tomato and chuck the seeds and the flesh into the pan. Pour the chicken stock into the pan, bring to a boil before turning the heat down.\nAdd the cashew nuts to a blender and pour in 200ml of water. Blend until very smooth. Strain the cashew milk through a very fine sieve, into the curry.\nChop the coriander and stir it through the yoghurt with the juice of half a lemon and a Pinch of salt and pepper. Simmer the curry for 20 minutes before serving alongside pilau rice, with the coriander yoghurt on the side."},{"id":57,"name":"Chicken Curry with Lemongrass and Ginger","tags":["Chicken","Curry","Thai"],"servings":"4 servings","source":"Bill's Basics p. 138","image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken thigh","curry powder","shallot","red chile","lemongrass","ginger","fish sauce","sugar","potatoes","chicken stock","coconut milk"],"ingredientlist":["6 boneless, skinless ;chicken thigh;s, quartered","2 tbsp ;curry powder;","1 tbsp olive oil","4 thai ;shallot;s, in rings","1 ;red chile; pepper, minced","1 stalk ;lemongrass;, peeled, bruised and cut down the middle","5 cm ;ginger;, sliced","2 tbsp ;fish sauce;","1 tbsp ;sugar;","500gr ;potatoes;, peeled and chopped","400 mL ;chicken stock;","250 mL ;coconut milk;"],"directions":"Mix the chicken with the curry powder and season with salt. Heat oil in a large skillet on medium high. Add the shallots and pepper and sauté for 2 minutes. Add the chicken and fry until browned on all sides.\nAdd the lemongrass, ginger, fish sauce, sugar, potatoes and stock. Mix well and bring to a boil. Add a lid and turn down the heat. Simmer for 15-20 minutes.\nAdd the coconut milk and simmer for another 5 minutes with the lid on. Serve with chopped cilantro."},{"id":58,"name":"Kapsalon","tags":["Main Dishes","Deep Fry","Chicken"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["potatoes","chicken thighs","Shawarma seasoning","lettuce","tomato","cucumber","cheese","red onion","parsly"],"ingredientlist":["Oil for frying","1 kg/2lbs ;potatoes;","600 gr/1 lbs ;chicken thighs;","2 tbsp ;Shawarma seasoning;","500 gr ;lettuce;","3 ;tomato;es","1 ;cucumber;","8 slices of ;cheese;","1 ;red onion;","1 bunch of ;parsly;","Garlic sauce and sambal sauce to serve"],"directions":"Heat the oil in a fryer or large dutch oven to 150C. Preheat the oven to as high as it'll go. Peel the potatoes and cut into fry shapes. Rinse thoroughly to remove excess starch and pat dry with paper towels.\nFry the fries for about 5 minutes, then let cool and drip on paper towels. To speed up the cooling you can put them in the fridge or freezer.\nSlice the chicken into strips and mix together with the seasoning. Heat oil in a over medium-high heat and cook for about 10 minutes. Stir once or twice to brown all over.\nCrank up the frying oil to 200C. Fry the fries for another 3 minutes till golden and crisp. Season with salt. Slice the lettuce, dice the tomatoes and cucumber and slice the red onion.\nPut the fries into oven safe containers or a baking tray. Drape over the chicken and then layer over the cheese. Put these under the broiler for a minute or two to melt the cheese.\nServe with the lettuce, tomatoes, cucumber, onions and sauces."},{"id":59,"name":"Cheesy Chicken Enchiladas","tags":["Wrapped","Chicken","Main Dishes","Mexican"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["onion","garlic","red pepper","tomato puree","jalapenos","smoked paprika","cumin","black beans","chicken stock","chicken breast","feta","coriander","tortilla","cheddar","sour cream","lime"],"ingredientlist":["2 ;onion;s","2 cloves ;garlic;","2 ;red pepper;s","1 tbsp olive oil","2 tbsp ;tomato puree;","3 tbsp jarred ;jalapenos;","1 1/2 tbsp ;smoked paprika;","1 tbsp ;cumin; seeds","400 g ;black beans;","400 ml ;chicken stock;","3 ;chicken breast;s","75 g ;feta;, crumbled","2 tbsp fresh ;coriander;, chopped","4 large ;tortilla; wraps","100 g ;cheddar;","100 g ;sour cream;","1 ;lime;"],"directions":"Peel the onion and garlic. Dice the onion and mince the garlic. De-seed and slice the peppers. Pour the oil into a saucepan and put it over a medium heat. Add the onions and peppers to the pan and fry for 15 minutes, stirring regularly. Add the minced garlic, tomato purée, chillies, spices and beans, fry for a few more minutes then pour in the stock.\nBring the stock to a simmer, then add the chicken breasts. Poach for 20 minutes. When the chicken is cooked, pull it out of the stock and shred it before adding it back to the pan with the feta and coriander (keep a little of each back for toppings).\nDivide 3/4 of the chicken mixture between the tortilla wraps, rolling them into fajitas and placing them into an ovenproof dish. Spoon the remaining mixture over the top.\nPreheat the oven to 200ºC. Grate the cheddar over the top of the enchiladas and crumble over the feta you saved. Bake for 15-20 minutes, until the cheese is bubbling and browning.\nServe with the sour cream, a few wedges of lime and a little extra coriander to garnish!"},{"id":60,"name":"Slowcooker White Chicken Chili","tags":["Chicken","Slowcooker","Soup"],"servings":"6 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["onion","garlic","jalapeno","chicken breast"," salsa verde","cannellini beans","pinto beans","cumin","oregano","cayenne","chicken stock","cheese"],"ingredientlist":["1 yellow ;onion;","2 Cloves ;garlic;","1 ;jalapeno; (optional)","1 boneless skinless ;chicken breast; (about 340 gr (3/4 lb))","450 gr (16 oz) jar; salsa verde;","400 gr (15 oz) cans ;cannellini beans;","1 400 gr (15 oz) can ;pinto beans;","1 Tbsp ground ;cumin;","1 tsp dried ;oregano;","¼ tsp ;cayenne; pepper","¼ tsp freshly ground black pepper","2 cups ;chicken stock;","125gr/4 oz Monterrey Jack ;cheese;, shredded"],"directions":"Dice the onion and mince the garlic. Slice the jalapeńo lengthwise, scrape out the seeds with a spoon, then dice. Place the onion, garlic, jalapeño, and chicken breast in the bottom of a slow cooker.\nDrain and rinse the cannellini beans and pinto beans, then add them to the slow cooker, along with the cumin, oregano, cayenne, and freshly ground black pepper. Pour the salsa over top.\nPour two cups of chicken broth over the contents in the cooker and then give everything a brief stir. Place the lid on the slow cooker and cook on high for four hours, or on low for eight hours.\nAfter four hours on high, or eight hours on low, carefully remove the chicken breast from the slow cooker and use two forks to shred the meat. Return the meat to the slow cooker. Stir the chili, slightly mashing the beans with the back of the spoon as you stir. The mashed beans will help thicken the chili.\nServe the chili topped with shredded Monterrey Jack cheese. Other optional toppings include fresh cilantro, diced avocado, freshly squeeze lime, or tortilla chips."},{"id":61,"name":"Slowcooker Jerk Chicken","tags":["Chicken","Slowcooker"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["chicken","brown sugar","soy sauce","garlic","ginger","cinnamon","allspice","thyme","nutmeg","onion","orange","serrano","jalapeno"],"ingredientlist":["1 whole ;chicken;, divided","1/4cup packed dark ;brown sugar;","2 Tbsp vegetable oil","1/3 cup ;soy sauce;","4 cloves ;garlic;, peeled","3-4 inches fresh ;ginger;","1 Tbsp ;cinnamon;","1 tsp ;allspice;","1 tsp ;thyme;","1/4 tsp ;nutmeg;","1 medium ;onion;","1 medium ;orange;","1 medium ;serrano; or ;jalapeno; pepper"],"directions":"To a blender add the dark brown sugar, vegetable oil, soy sauce, peeled garlic, peeled ginger, cinnamon, allspice, thyme, and nutmeg. Blend until smooth. Optionally, add the serrano to the blender, too.\nArrange the chicken pieces in the slow cooker so that they are nestled tightly and as close to the bottom as possible. Pour about 2/3 of the spice rub over the chicken and use your hands to spread it all over the chicken pieces. Save the rest of the spice rub for later use.\nCut the onion into wedges and slice the orange and serrano. Add the onion, orange, and serrano to the slow cooker. Nestle the pieces down in and under the chicken so that they make close contact. Place the lid on the slow cooker, turn it on to high, and let it cook undisturbed for four hours.\nAfter four hours, carefully remove the chicken and place it on a broiler pan or a baking sheet covered with foil. Tongs work best for this as the chicken will be very hot and very delicate. Spread the rest of the spice rub carefully over the surface of the chicken. Adjust the rack in your oven so that the top of the chicken is 4-5 inches below the broiler. Broil on high for about 5 minutes or until the skin is crispy and browned. Watch the chicken closely as all broilers are different. Broilers can quickly burn food because of their high heat and close proximity of the heat source."},{"id":62,"name":"Kinnin's Fried Chicken","tags":["Deep Fry","Chicken","Main Dishes"],"servings":"2-4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["whole chicken","buttermilk","thyme","basil","oregano","celery salt","dried mustard","paprika","ginger","white pepper","MSG","flour","corn starch"],"ingredientlist":["1 ;whole chicken;","500mL/16 oz of ;buttermilk;","herbs and spices","⅔ tsp salt","½ tsp ;thyme;","½ tsp ;basil;","⅓ tsp ;oregano;","1 tsp ;celery salt;","1 tsp black pepper","1 tsp ;dried mustard;","4 tsp ;paprika;","2 tsp garlic salt","1 tsp ground ;ginger;","3 tsp ;white pepper;","¾ tsp ;MSG;","1 tsp kosher salt","250gr/2 cups ;flour;","60gr/½ cup of ;corn starch;","Canola and Peanut oil, for frying"],"directions":"Break down chicken into 8 pieces. Save wing and spine pieces for making chicken stock.\nInto a large food-safe bucket, add 16 oz of buttermilk and 12 herbs and spices along with an extra tablespoon of kosher salt and chicken pieces.\nPress chicken down into the buttermilk brine and give it a good mix until they are evenly coated and keep the bucket in the fridge for at least 6 hours and up to 24 hours. Take it out once or twice during its marinade time to give it good stir.\nIn a wide casserole dish, add 12 herbs and spices, 2 cups of all purpose flour and half cup of corn starch, and whisk together. \nAdd a few tablespoons of marinade to the dredge, and mix it up with your fingers or a fork until creating tiny little bits of breading that are going to stick to the chicken.\nBread all of the chicken at once and let those sit there for about 10 minutes.\nHeat canola and peanut oils to 200C/400°F, frying for 6-9 minutes until golden brown and crisp. Dark meat should reach 175°F and white meat should register 165°F. Place on a wire rack and keep in a low temperature oven until all of the chicken has finished frying."},{"id":63,"name":"Hoisin Stir Fry Bowls with Spicy Peanut Sauce","tags":["Beef","Pork","Main Dishes","Rice"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["peanut butter","sriracha","soy sauce","ginger","brown sugar","garlic","ground pork","mushroom","carrot","bell pepper","hoisin","soy sauce","sesame oil","peanuts","green onions"],"ingredientlist":["Peanut Sauce","1/4 cup natural-style ;peanut butter;","1 Tbsp ;sriracha;","1 tsp ;soy sauce;","1 tsp grated fresh ;ginger;","1 tsp ;brown sugar;","3 Tbsp hot water","Pork and Vegetable Mix","1/2 Tbsp neutral cooking oil","2 cloves ;garlic;","1 tsp grated fresh ginger","250gr ;ground pork;, chicken or turkey","250gr button ;mushroom;s","1 large ;carrot;","1 red ;bell pepper;","1/3 cup ;hoisin; sauce","1 Tbsp ;soy sauce;","1 tsp toasted ;sesame oil;","Bowl Ingredients","4 cups cooked rice","1/4 cup ;peanuts;, chopped","2-3 ;green onions;, sliced"],"directions":"In a small bowl, combine the peanut butter, sriracha, soy sauce, brown sugar, and grated fresh ginger. Stir in one tablespoon of hot water at a time until the sauce is thin enough to drizzle.\nMince the garlic and grate another teaspoon of fresh ginger. Heat the cooking oil in a large skillet over medium flame. Add the garlic and ginger to the hot skillet and sauté for about one minute. Add the pork and continue to sauté until the pork is cooked through and crumbled.\nWhile the pork is cooking, rinse the mushrooms then chop them into small pieces. Once the pork is cooked through, add the chopped mushrooms and continue to sauté until the mushrooms have wilted and released all their moisture.\nWhile the mushrooms are cooking, peel the carrot then shred it using a large-holed cheese grater. Finely dice the red bell pepper. Once the mushrooms have cooked down, add the shredded carrot, diced bell pepper, hoisin sauce, toasted sesame oil, and soy sauce to the skillet. Stir and cook until everything is coated in sauce and heated through.\nTo build the bowls, start with one cup cooked rice, then add 3/4-1 cup of the meat and vegetable mixture. Sprinkle a few sliced green onions on top, then drizzle 1-2 Tbsp of the spicy peanut sauce over everything. Finish with about 1 Tbsp of the chopped peanuts."},{"id":64,"name":"One Pot Chili Pasta","tags":["Pasta","Beef","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["onion ","garlic","ground beef","flour","chili powder","tomato sauce","diced tomatoes","black beans","kidney beans","corn","macaroni","beef broth","cheese"],"ingredientlist":["1 Tbsp olive oil","1 medium ;onion ;","2 cloves ;garlic;","300gr. ;ground beef;","2 Tbsp ;flour;","2 Tbsp ;chili powder;","1 (15 oz.) can ;tomato sauce;","1 (15 oz.) can ;diced tomatoes;","1 (15 oz.) can ;black beans;","1 (15 oz.) can ;kidney beans;","250mL frozen ;corn; kernels","500mL uncooked elbow ;macaroni;","500mL ;beef broth;","1 cup shredded ;cheese;"],"directions":"Cook onions and garlic in a large pot with olive oil until soft and transparent. Add the ground beef, brown.\nAdd the flour and chili powder to the pot and stir to coat the meat. Cook the coated meat for 1-2 minutes more. \nDrain and rinse the black and kidney beans. Add the beans, tomato sauce, diced tomato, and corn kernels to the pot. Stir well.\nAdd the dry macaroni and the beef broth to the pot and stir to combine. Place a lid on top, turn the heat up to high, and let the pot come to a boil. Once it reaches a boil, give it a quick stir to loosen any pasta stuck to the bottom of the pot, replace the lid, and turn the heat down to medium-low. Let the pot simmer on medium-low for about 15 minutes, or until the pasta is soft and has absorbed most of the liquid. Stir the pot one or two times during the 15 minutes to loosen any pasta stuck to the bottom.\nOnce the pasta is fully cooked, turn the heat off and add the cheese. Stir the cheese into the pasta until it has melted in and become slightly creamy. Serve hot."},{"id":65,"name":"Bolognese","tags":["Pasta","Beef","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1 el olijfolie","300gr rundergehakt","100gr pancetta","2 uien gesnipperd","1 winterwortel, in kleine blokjes","3 stengels bleekselderij, in boogjes","Handvol perterselie","2el tomatenpuree","1 blik tomatenblojes","250ml groentebouillon","200ml droge witte wijn","1 laurieblad","Snufje suiker"],"directions":"Verhit de olie in een grote, diepe pan en voeg het gehakt toe.\nMaak los met een vork en bak, samen met de pancetta en de gesnipperde uien, al omscheppend bruin en rul.\nVoeg de blokjes wortels en de stukjes bleekselderij toe en bak enkele minuten mee\nRoer de peterselie, tomatenpuree, tomaten, bouillon, witte wijn, laurier en suiker erdoor\nBreng het geheel aan de kook. Temper het vuur en laat de saus circa 30min zachtjes pruttelen."},{"id":66,"name":"Chili Cheese Beef 'n' Mac","tags":["Beef","Pasta","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["ground beef","flour","chili powder","smoked paprika","oregano","tomato sauce","beef broth","macaroni","cheese"],"ingredientlist":["1 Tbsp olive oil","500g ;ground beef;","2 cloves garlic","1 small onion","2 Tbsp all-purpose ;flour;","1 Tbsp ;chili powder;","1/2 tsp ;smoked paprika;","1/2 tsp dried ;oregano;","250mL ;tomato sauce;","500mL ;beef broth;","2 cups 1/2 lb. dry ;macaroni;","200g shredded sharp cheddar ;cheese;"],"directions":"Brown the ground beef in a large pot over medium along with 1 Tbsp of olive oil. While the beef is browning, dice the onion and mince the garlic.\nAdd the diced onion and minced garlic to the browned beef. Continue to cook and stir over medium heat until the onions are soft and translucent. Once the onions have softened, add 2 Tbsp of flour and cook for one minute more while constantly stirring. It’s okay if it coats the bottom of the pot, just make sure the heat is not so high that the flour burns.\nAdd the chili powder, smoked paprika, oregano, tomato sauce, and 500mL of beef broth. Stir to dissolve any bits that are stuck to the bottom of the pot.\nAdd the dry pasta, place a lid on top, and allow it to come up to a simmer. Once it reaches a simmer, reduce the heat to low, and let simmer for about 15 minutes or until the pasta is soft and has absorbed all of the liquid. Stir every few minutes to make sure it’s not sticking on the bottom of the pot. \nOnce the pasta has finished cooking, turn the heat off and stir in the shredded cheese. Serve hot."},{"id":67,"name":"Stroganoff met Balletjes","tags":["Beef","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["500 gr gehakt (half om half)","1 ei","3 eetlepels paneermeel","1 theelepel paprikapoeder ","Een snufje van, oregano, basilicum, peterselie, koriander, cayennepeper","1 teen knoflook","300 gr rijst","1 ui","2 paprika's","250 gr champignons","1 klein blikje tomatenpuree","250 ml bouillon","1 eetlepel maïzena","125 ml creme fraiche","Snuf peper en zout","Boter of olie om te bakken"],"directions":"Doe het gehakt in een kom en meng met het ei, paneermeel, peper en zout. Draai hier kleine balletjes van. Verhit wat olie in een hapjespan en bak de gehaktballetjes in ca. 10 min bruin en gaar. \nSnipper de ui en knoflook fijn en fruit deze aan in de pan van de balletjes. Voeg de paprika in blokjes toe. Voeg na een paar minuten de champignons toe. Breng op smaak met paprikapoeder. Roer na 5 minuten de tomatenpuree en bouillon er bij en breng het mengsel aan de kook. \nRoer ongeveer 1 eetlepel maïzena los met 1 eetlepel water in een klein glaasje. Giet dit bij de tomatensaus en laat de saus een wat indikken. Laat de saus een kwartiertje pruttelen. Kook ondertussen de rijst gaar.\nRoer de creme fraiche door de groentesaus. schep dan ook de gehaktballetjes er door en warm nog even mee. Proef of er nog een snufje peper of zout nodig is. Serveer de strogranoff met wat peterselie in top en de rijst. Ook lekker met pasta of aardappeltjes."},{"id":68,"name":"Burritos met Gehakt Chorizo vulling","tags":["Beef","Pork","Wrapped","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["150g chorizo, in stukjes","500g mager rundergehakt","1 ui, gesnipperd","2 teentjes knoflook","½ tl komijn","3 el tomatenpuree","Zout","12 tortilla’s","150g geraspte kaas","Zure room"],"directions":"Verhit de oven voor op 200°C. Verhit een braadpan op hoog vuur en bak hierin de worst en het gehakt in zo’n 5 min rul en lichtbruin.\nVoeg de ui, knoflook, komijn en de tomatenpuree toe en laat alles 10 min zachtjes pruttelen, breng op smaak met zout.\nVerdeel het mengsel over de tortillas en bestrooi het geheel met de kaas. Vouw ze mooi dicht.\nDoe de burritos zo’n 10min in de oven totdat ze bruin en knapperig zijn. Serveer met zure room en een pittige saus"},{"id":69,"name":"Keftedakia, Greek Meatballs","tags":["Beef","Main Dishes","Rice"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["beef","egg","butter","red onion","bell pepper","garlic","tomato puree","diced tomatoes","feta","mozzarella"],"ingredientlist":["Meatballs","0.5 tsp salt","0.5 tsp paprika","0.5 tsp ground cumin","0.5 garlic powder","¼ tsp onion powder","¼ tsp black pepper","¼ tsp cinnamon","0.5 tsp ground coriander","1 tsp thyme","1 tsp oregano","0.5 tsp parsley","¼ cayenne powder","500gr (1 lb) ;beef; or lamb mince","1 ;egg;","Sauce","Olive oil","Knob of ;butter;","2 ;red onion;s, diced","1 red, yellow and green ;bell pepper;, diced","2 cloves of ;garlic;, minced","1 can of ;tomato puree;","1 can (400gr, 15 oz) ;diced tomatoes;","Salt and pepper","Smoked paprika","Oregano","200gr ;feta;","1 ball of ;mozzarella;, sliced"],"directions":"Preheat the oven to 180° C. Mix everything together for the meatballs and make little balls out of them. Heat the oil in a big pan and fry the balls until browned. Put them into a baking dish.\nAdd the knob of butter and after letting it melt throw in the onion and bell peppers. Sauté them until soften them up a little bit. Then add the garlic and tomato puree, let it simmer for a few minutes before adding the diced tomatoes. Add paprika, oregano and salt and pepper to taste.\nCrumble the feta in and around the meatballs, leave bigger chunks to get nice cheesy pockets. Pour over the tomato sauce and top with the slices of mozzarella. Put into the oven for 25-30 minutes until the mozzarella is browned. Serve with tomato rice or a salad."},{"id":70,"name":"Chili Corn Carne","tags":["Beef","Main Dishes","Rice","Fridge Clearing"],"servings":"6 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["onion","beef mince","chilli powder","cinnamon","cumin","turmeric","beef stock","tomato","kidney beans","coriander"],"ingredientlist":["1 large brown ;onion;","2 cloves garlic","1 tbsp olive oil","750 g ;beef mince;","1 tsp hot ;chilli powder;","1 tsp ;cinnamon; powder","1 tsp ground ;cumin;","1/2 tsp ;turmeric; powder","1 good ;beef stock; cube","400 g tinned ;tomato;es","400 g tin red ;kidney beans; with chilli sauce","1 tsp ;coriander; powder"],"directions":"Peel and dice the onion and garlic. Pour the oil into a large saucepan over a medium heat and add the onion and garlic. Sweat for 10 minutes.\nAdd the beef mince in large-ish chunks, turn the heat up high and brown the outside for 5 minutes (gives different textures of mince). Stir in spices and carry on cooking for 5 minutes\nAdd stock cube, tomatoes, kidney beans plus anything else you want from a selection of flavoursome things I often use tomato puree, tomato ketchup, brown sauce, red wine, beer or worcestershire sauce. Bring to the boil for 5 minutes. Put a lid on the pan and turn hob down to the lowest setting - leave for 1 hour, stirring every few minutes. After 1 hour, take lid off and leave to cook for another hour, or until thick, very gloopy texture is achieved. You could use a heat diffuser to keep cooking temperature as low as possible.\nServe with boiled rice or cornbread and sour cream."},{"id":71,"name":"Green Chile Turkey Burgers","tags":["Burger","Beef","Chicken","Main Dishes"],"servings":"5 burgers","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["beef","green chiles","cumin","garlic powder","green onions","cheese","avocado"],"ingredientlist":["500gr ground turkey or ;beef;","4 oz. can diced ;green chiles;, drained","1/2 tsp ground ;cumin;","1/4 tsp ;garlic powder;","1/4 tsp salt","2-3 ;green onions;, sliced","2 oz pepper jack ;cheese;, shredded","hamburger buns","1 large ;avocado; (optional)"],"directions":"Place the ground meat, green chiles (drained), sliced green onions, shredded pepper jack, cumin, garlic powder, and salt in a large bowl. Mix the ingredients until well combined. Divide and shape the mixture into five patties. The mixture will be fairly wet.\nCook the burgers in a skillet, on a grill, or using an indoor grill like a George Foreman, until they are cooked through (internal temperature of 165ºF) and well browned on the outside. Cooking time will depend on the method, size, and thickness of your patties. \nServe each patty on a bun with a slice of tomato, a couple slices of avocado, and a smear of mayonnaise."},{"id":72,"name":"Greek Turkey or Beef Burgers","tags":["Burger","Beef","Chicken","Main Dishes"],"servings":"6 burgers","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["greek yogurt","lemon","dill","turkey","beef","sun dried tomatoes","red onion","spinach","feta","oregano","breadcrumbs","egg","cucumber"],"ingredientlist":["oz. plain ;greek yogurt;","1 medium fresh ;lemon;","1/4 tsp minced garlic","1/4 tsp dried ;dill;","1.25 lb. ground ;turkey; or ;beef;","halves ;sun dried tomatoes;","1 medium ;red onion;","2 oz. frozen ;spinach;","1/4 cup crumbled ;feta;","1 tsp dried ;oregano;","1/2 tsp minced garlic","1/3 cup ;breadcrumbs;","1 large ;egg;","1 medium ;cucumber;","hamburger buns","to taste salt and pepper"],"directions":"Prepare the yogurt sauce by combining the yogurt, 1/4 tsp minced garlic, dry dill, juice of half the lemon and a dash of salt. Stir everything to combine and then refrigerate to allow the flavours to blend while you make the burgers.\nThaw the frozen spinach and squeeze out as much moisture as possible. Roughly chop the spinac. Also chop the sun dried tomatoes and 1/4 of the red onion.\nIn a bowl combine the ground turkey with the spinach, sun dried tomatoes, red onion, feta, 1/2 tsp minced garlic, dried oregano, egg, bread crumbs, 1/2 tsp of salt and some freshly ground pepper. Stir everything until it is evenly combined. Shape the mixture into six patties.\nCook the burgers on a counter top grill, a non-stick skillet or over open flame. Spread the yogurt sauce on both sides of a bun, add a warm burger and top with thin slices of red onion and cucumber. Enjoy!"},{"id":73,"name":"One-Pot Gingery Chicken and Rice With Peanut Sauce","tags":["Chicken","Rice","Main Dishes"],"servings":"6 servings","source":"https://www.bonappetit.com/recipe/one-pot-chicken-and-rice","image":"","cooktime":null,"preptime":null,"ingredienttags":["chicken thighs","cucumber","cilantro"],"ingredientlist":["Chicken and Rice","6 small skin-on, bone-in ;chicken thighs; (about 3 lb.)","¾ tsp. kosher salt, plus more","2 large shallots, finely chopped","8 garlic cloves, finely chopped","1 2\" piece ginger, peeled, finely chopped","2 cups high-quality basmati rice, rinsed","2 whole star anise","1 Tbsp. soy sauce","Sauce and Assembly","½ cup creamy peanut butter","2 Tbsp. soy sauce","2 Tbsp. unseasoned rice vinegar","5 tsp. Sriracha","1 1\" piece ginger, peeled, finely chopped","1½ tsp. honey","1 English hothouse ;cucumber;, halved lengthwise, thinly sliced on a diagonal","1 cup ;cilantro; leaves with tender stems"],"directions":"Chicken and Rice\nPat chicken dry and season all over with salt. Arrange, skin side down, in a cold, dry medium Dutch oven and set over medium heat. Cook, undisturbed, until skin is golden brown and crisp and easily releases from pot, 8–10 minutes. Slide thighs around to different spots (this will ensure even browning) and continue to cook until deeply browned, 3–5 minutes longer. Transfer chicken to a plate. Let pot cool 2 minutes.\nSet pot over medium-low heat; add shallots, garlic, and ginger and cook, stirring constantly, until very fragrant but not browned, about 2 minutes. Stir in rice and star anise and cook, stirring constantly, 1 minute. Stir in soy sauce, ¾ tsp. salt, and 3 cups water. Nestle chicken back into rice mixture in pot, arranging skin side up. Increase heat to medium and bring liquid to a simmer. Immediately cover pot, reduce heat to low, and cook 25 minutes. Remove from heat and let chicken and rice sit 10 minutes.\nSauce and Assembly\nWhile the chicken and rice are cooking, make the sauce. Whisk peanut butter, soy sauce, vinegar, Sriracha, ginger, honey, and ¼ cup warm water in a small bowl until smooth and pourable. If sauce still looks a little thick, continuing adding water until it reaches a drizzle-able consistency.\nRemove lid from pot and fluff rice with a fork. Pluck out and discard star anise. Serve chicken and rice with peanut sauce, cucumber, and cilantro alongside."},{"id":74,"name":"Dal","tags":["Curry","Vegetarian","Rice"],"servings":"4 servings","source":"https://sortedfood.com/recipe/9646","image":null,"cooktime":null,"preptime":null,"ingredienttags":["lentils","green chilli","tomato","coriander"],"ingredientlist":["250 g yellow or red ;lentils;","1 onion","2 cloves of garlic","2 cm piece of root ginger","2 ;green chilli;es","1 tsp turmeric","1/2 tsp asafoetida","2 tsp coriander powder","1 tsp chilli powder","1 tsp salt","4 ;tomato;es","1 bunch of fresh ;coriander;","2 tbsp ghee"],"directions":"Rinse the lentils thoroughly in cold water, then soak in cold water for 2 - 3 hours, refreshing the water occasionally. Boil the lentils in a pot with 1 litre of salted water for 1 hour, stirring occasionally and adding more water if required, you’re aiming for a thick soup consistency.\nPeel and blitz the onions, garlic, ginger and chilli (with seeds) for the dal into a paste using a food processor, or dice really fine. Heat the ghee in a frying pan, add the paste to fry for a few minutes until softened and beginning to brown. Add the asafoetida, turmeric, chilli powder, coriander powder and fry for a few more minutes.\nToss the fried mixture in with the dal, then stir in the diced tomatoes, salt and pepper. Pour into a dish and sprinkle with freshly chopped coriander."},{"id":75,"name":"Chicken Saag","tags":["Chicken","Curry","Main Dishes"],"servings":"4 servings","source":"https://sortedfood.com/recipe/9646","image":null,"cooktime":null,"preptime":null,"ingredienttags":["spinach","chicken thighs","tomato","cream"],"ingredientlist":["400 g fresh ;spinach;","750 g boneless ;chicken thighs;","2 white onions","2 cm piece of root ginger","4 cloves of garlic","1 cinnamon stick","400 g tinned ;tomato;es","1 tsp chilli powder","2 tsp ground coriander","1 tsp ground cumin","1 tsp garam masala","4 tbsp double ;cream;","1 pinch of salt"],"directions":"Pour boiling water over the spinach in a large bowl, then leave for a minute until wilted. Drain and purée in a blender, using a tiny bit of water if required.\nPeel and finely chop the onions, garlic and ginger for the saag. Dice the chicken into bite-sized pieces, cutting away any sinew or fat. Heat a little oil or ghee in a deep pan, add the chopped onion, garlic and ginger then fry on a medium heat for a few minutes until softened. Tip in the chicken and lightly fry to sear on all sides. Pour in the tinned tomatoes, the chilli powder, ground coriander, garam masala, cumin and cinnamon stick.\nBubble over a medium heat for about 10 minutes then add the puréed spinach and mix thoroughly. Cover and leave to simmer for a further 5-10 minutes until the chicken is completely cooked. Finish with the cream and simmer for a minute before seasoning with salt to your taste. Keep warm until you’re ready to serve."},{"id":76,"name":"Pilau Rice","tags":["Rice","Carby Side Dish"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["600 g Basmati rice","900 ml boiling water","1 cinnamon stick","2 star anise","3 cardamom pods","1 tbsp salt"],"directions":"Place the rice in a large baking dish with the cinnamon stick, star anise and cardamom pods. Pour the boiling water over the rice, stir and cover with tin foil. Bake in an oven at 200 degrees C for 25-30 minutes until the rice is cooked and plump."},{"id":77,"name":"Buttermilk pancakes","tags":["Breakfast","Pancakes"],"servings":"6 pancakes","source":"https://www.bbc.co.uk/food/recipes/canadianbuttermilkpa_70009","image":null,"cooktime":null,"preptime":null,"ingredienttags":["buttermilk","egg"],"ingredientlist":["4fl oz/120ml ;buttermilk;","5oz/150g plain flour","½ level tsp baking powder","pinch of salt","3 large free-range ;egg;s, beaten","about 1-2oz/25-50g lard or butter"],"directions":"First sieve the flour, baking powder and salt together in a roomy bowl and make a well in the centre. After that, whisk the buttermilk and 3fl oz/75ml cold water together in a jug and gradually whisk this into the bowl, slowly incorporating the flour with each new addition of liquid. Finally, add the eggs a little at a time until you have a smooth batter.\nNow place a large, solid frying pan over a medium heat, add 2 teaspoons of the lard and heat it until the fat shimmers. Then, using a tablespoon of batter per pancake, place 2 or 3 spoonfuls into the pan.\nThey will take about 1 minute to turn golden brown, then turn them over using a spatula and fork, being careful not to splash yourself with the hot fat. Give them another 45 seconds on the other side, by which time they should have puffed up like little soufflés, then briefly rest them on some kitchen paper to absorb any excess fat.\nRepeat this with the rest of the batter, adding a little more lard if necessary. They will keep warm in a low oven, but to enjoy them at their best, have everyone seated to eat them as soon as they come out of the pan."},{"id":78,"name":"Chorizo Breakfast Hash","tags":["Breakfast","Lunch","Pork","Egg"],"servings":"4 servings","source":"https://www.budgetbytes.com/chorizo-breakfast-hash/","image":null,"cooktime":null,"preptime":null,"ingredienttags":["potato","chorizo","sausage","bell pepper","egg","sour cream","salsa"],"ingredientlist":["500 gr (1 lb) baby red ;potato;es","2 Tbsp cooking oil","250 gr (1/2 lb) Mexican ;chorizo; or other fresh ;sausage;","1 yellow onion","1 green ;bell pepper;","Pinch of salt and pepper","1/2 tsp chili powder","3 green onions, sliced","4 large ;egg;s, fried (optional)","4 Tbsp ;sour cream; (optional)","4 Tbsp ;salsa;"],"directions":"Wash the potatoes well, then place them in a large sauce pot and cover with water. Place a lid on the pot and bring it up to a boil over high heat. Boil the potatoes just until they are tender enough to pierce with a fork, but not so soft that they'll fall apart when pierced (about 7-10 minutes, depending on the size of the potatoes). Drain the potatoes and let them cool slightly.\nWhile the potatoes are boiling, begin cooking the chorizo. Heat a large skillet over medium, then add a tablespoon of cooking oil. Swirl the oil to coat the surface, then add the chorizo (if it's in links, squeeze it out of the casing into the skillet). Cook the chorizo, breaking it up into smaller pieces as it cooks, until it's brown, crispy, and cooked through (about 5-7 minutes). Use a slotted spoon to remove the cooked chorizo to a clean bowl.\nWhile the chorizo is cooking, finely dice the bell pepper and onion. After removing the chorizo from the skillet, add the diced bell pepper and onion to the remaining fat and oil in the skillet, along with a pinch of salt and pepper. Sauté the onion and bell pepper until they are soft and browned on the edges (5-7 minutes). The moisture from the vegetables should help loosen the browned bits from the bottom of the skillet, which will in turn flavor the vegetables. Use the slotted spoon to remove the cooked bell pepper and onion to the bowl with the chorizo.\nWhile the bell pepper and onion are cooking, dice the boiled potatoes into 1/4-inch cubes. After removing the bell pepper and onion from the skillet, add an additional tablespoon of oil and swirl to coat the surface of the skillet. Add the diced potatoes along with another pinch of salt and pepper, and a 1/2 tsp of chili powder. Cook the potatoes in the hot oil, stirring only occasionally, until the potatoes are brown and crispy (about 10 minutes). Avoid stirring too often as this will prevent the potatoes from forming a brown crispy exterior.\nFinally, add the chorizo, bell pepper, and onion back to the skillet and stir to combine. Top with sliced green onion. Divide the hash between four plates, add a fried egg, and top with a dollop of sour cream and salsa."},{"id":79,"name":"Chicago Deep Dish Pizza","tags":["Pizza","Main Dishes","Pork"],"servings":"2 Pizzas","source":"https://sortedfood.com/recipe/8759","image":null,"cooktime":null,"preptime":null,"ingredienttags":["red wine","tomato","Parmesan","mozarella","sausage","fresh basil"],"ingredientlist":["1 recipe #36#Pizza Dough#","Tomato Sauce","3 cloves of garlic","1 tbsp olive oil","100 ml ;red wine;","1 tbsp tomato purée","400 g tin of chopped ;tomato;es","Toppings","1 tbsp butter","2 tbsp ;Parmesan;, grated","300 g low moisture ;mozarella;","100 g creamy fresh mozarella","250 g Italian pork ;sausage;","1 small white onion","1 handful of ;fresh basil;"],"directions":"First make the #36#Pizza Dough# according to the recipe.\nPeel and chop the garlic and gently fry in the olive oil until soft and aromatic. Splash in the wine, then reduce by three quarters over a medium-high heat. Pour in the tomato purée and tinned tomatoes. Stir and simmer for 15 minutes to reduce, then allow to cool.\nPreheat the oven to 180ºC. Brush the inside of a 20cm cake tin with the butter and scatter with a little grated Parmesan. Halve the risen dough, roll it on a lightly floured surface, then lay it into your pan (you can use any shape you want) so that it covers the bottom and sides. Trim away any excess dough.\nSlice the mozzarella, pat dry and arrange over the dough to create an entire layer about 1cm thick. Sprinkle over some of the grated creamy mozzarella, then spoon over a little tomato sauce, a couple of tablespoons is fine. Squeeze the sausage meat from their skins, break into pieces and scatter over sauce with some chopped onion.\nPlace the pizza in the oven and cook for 35-40 minutes, until the base and sausages are cooked. Scatter over the fresh basil leaves, drizzle with extra virgin olive oil and serve up! Makes 2 round deep pizzas"},{"id":80,"name":"Ranch Dressing","tags":["Saus","Dressing"],"servings":"4 x 2 tbsp","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["mayonnaise","plain yogurt","lemon juice","green onions"],"ingredientlist":["60 mL (1/4 cup) ;mayonnaise;","60 mL (1/4 cup) ;plain yogurt;","1 tsp ;lemon juice;","3/16 tsp garlic powder","1/8 tsp onion powder","1 Tbsp finely chopped fresh parsley, loosely packed","1 ;green onions;, finely chopped","freshly cracked pepper","1/8 tsp sugar (optional)","1 Tbsp milk (optional)"],"directions":"Combine all of the ingredients in a bowl and stir to combine.\nUse the dressing immediately, or for the best flavor refrigerate for 30 minutes to allow the flavors to blend.\nStore the ranch dressing in the refrigerator for up to 5 days."},{"id":81,"name":"Tartare Sauce","tags":["Saus"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg yolks","Dijon mustard","white wine vinegar","lemon juice","pickles","capers","parsley","green olives"],"ingredientlist":["2 ;egg yolks;","1 tbsp ;Dijon mustard;","3 tbsp ;white wine vinegar;","200ml/7fl oz vegetable oil, plus extra for deep-frying","squeeze ;lemon juice;","½ red onion, chopped","1 tbsp ;pickles;, roughly chopped","1 tbsp ;capers;, roughly chopped","small handful ;parsley;, finely chopped","4–5 ;green olives;, chopped"],"directions":"Whisk together the egg yolks, mustard and vinegar and gradually pour in the oil in a steady stream until you have a thick, creamy mayonnaise. Season to taste and add a squeeze of lemon.\nStir in the onion, gherkins, capers, parsley and olives. The sauce should be quite piquant and chunky and have the consistency of very thick double cream."},{"id":82,"name":"Mexican Rice","tags":["Carby Side Dish","Rice"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["tomato sauce","chicken broth"],"ingredientlist":["3 tablespoons vegetable oil ","1 cup uncooked long-grain rice ","1 teaspoon garlic salt ","½ teaspoon ground cumin ","¼ cup chopped onion ","½ cup ;tomato sauce;","2 cups ;chicken broth;"],"directions":"Heat oil in a large saucepan over medium heat and add rice. Cook, stirring constantly, until puffed and golden. While rice is cooking, sprinkle with salt and cumin.\nStir in onions and cook until tender. Stir in tomato sauce and chicken broth; bring to a boil. Reduce heat to low, cover and simmer for 20 to 25 minutes. Fluff with a fork."},{"id":83,"name":"Char Sui","tags":["Pork","Main Dishes"],"servings":"6 servings","source":"https://www.marionskitchen.com/homemade-chinese-bbq-charsiu-pork/","image":"","cooktime":null,"preptime":null,"ingredienttags":["pork shoulder","hoisin","Sherry","honey"],"ingredientlist":["1.5 kg (3.3 lb) piece pork neck (also called boston butt or ;pork shoulder;)","¼ cup ;hoisin; sauce","¼ cup brown sugar","¼ cup Chinese Shaoxing wine or ;Sherry;","¼ cup ;honey;","3 tbsp light soy sauce","2 tbsp oyster sauce","1 tsp sea salt","½ tsp Chinese 5-spice powder","3 garlic cloves, finely grated","1 tbsp beetroot powder or 1/4 red food colouring"],"directions":"Slice the pork neck lengthways to form 3 long pieces.\nPlace all ingredients except the pork into a large bowl and mix until well combined.\nPlace the pork and the marinade in a ziplock bag. Seal and shake well until the pork is evenly coated. Set aside to marinate in the fridge overnight.\nPreheat oven to 180°C/350°F.\nLine a roasting tray with foil. Place a rack on top. Remove the pork pieces from the marinade and place onto the rack. Pour water into the bottom of the roasting tin (ensure the water level is below the pork). The water and the foil will help to stop the sweet marinade from burning on your roasting tray. Cook in preheated oven for 20 minutes.\nIn the meantime, pour the marinade out of the ziplock bag and into a small saucepan over medium heat. Bring to the boil and simmer for 5 minutes or until thickened slightly. Remove from heat and divide the mixture between 2 bowls. One half will be for basting and the other can be used as a serving sauce.\nRemove the pork from the oven. Baste both sides of the pork with the thickened marinade. Place back into the oven to cook for another 20 minutes or until cooked through. Remove from the oven, add another layer of basting sauce and rest for 10 minutes before slicing."},{"id":84,"name":"Pork Crackling","tags":["Pork","Snack","Side Dish"],"servings":"8 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["Pork skin, there needs to be at least .5cm – 1cm of fat under the skin. Ask your butcher to score the skin for you, they have the knives for it.","Boiling water","¼ c salt"],"directions":"Pre heat oven to a very hot 220°\nPut the scored pork skin on a plate and place in the kitchen sink.\nPour over boiling water and you will see the score marks open up. This is an important part to getting the salt to sit on it.\nRemove from the sink and pat dry, lay on a large baking tray with shallow to mid height sides. There will be quite a bit of liquid fat and you don’t want that dripping all over your oven.\nRub the salt all over the top of the skin making sure you get it in the score marks.\nPlace in the oven, top shelf and cook for about 20-30 mins. Keep an eye on it and turn up or down the temperature after 20 mins if it hasn’t browned or is getting too brown.\nIt is perfect when it’s golden in colour and the skin has bubbled up."},{"id":85,"name":"Chana masala","tags":["Curry","Vegetarian","Rice"],"servings":"2 servings","source":"https://www.bbcgoodfood.com/recipes/chana-masala-pomegranate-raita","image":null,"cooktime":null,"preptime":null,"ingredienttags":["green chilli","cumin seeds","mustard seeds","garam masala","turmeric","chickpeas","tomato"],"ingredientlist":["1 tbsp rapeseed oil","2 onions, halved and thinly sliced","1 tbsp chopped ginger","2 large garlic cloves, finely grated or crushed","1 ;green chilli;, halved, deseeded and thinly sliced","½ tsp ;cumin seeds;","½ tsp ;mustard seeds;","½ tsp ;garam masala;","½ tsp ;turmeric;","1 tsp ground coriander","400g can ;chickpeas;, undrained","4 small ;tomato;es (about 160g), cut into wedges","2 tsp vegetable bouillon powder","cooked wholegrain rice, to serve (optional)"],"directions":"Heat the oil in a large non-stick pan, then cook the onions, ginger, garlic and chilli for 15-20 mins.\nAdd the spices, chickpeas, the liquid from the can, ¾ can cold water, the tomatoes and bouillon. Cover and simmer for 10 mins.\nServe with rice and a raita"},{"id":86,"name":"Greek Salmon Parces","tags":["Main Dishes","Vis"],"servings":"2 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["salmon","pine nuts","spinach","feta","basil","honey","filo pastry","potato"],"ingredientlist":["2 ;salmon; fillets, skinned (approx 120g in weight each)","1 handful(s) ;pine nuts;, toasted","2 handful(s) fresh ;spinach;, washed","1 chunk(s) ;feta;","1 sprig(s) ;basil; leaves","1 squeeze ;honey;","1 butter, melted","1 sheet(s) ;filo pastry;","1 plain flour for dusting","1 handful(s) asparagus spears to serve","2 small ;potato;es to cut and roast"],"directions":"Preheat the oven to 180°C. Wilt the spinach in a dry pan with a tsp of water, cool and then squeeze out any extra water.\nPut the pine nuts, spinach, feta, basil and honey in a small blender and blitz until you have a rough paste. If you do not have a chopper, chop all the ingredients finely and mix together.\nPut two sheets of pastry on a floured surface, side by side, and brush with butter. fold each sheet in half to make it double thickness. slice each salmon fillet in half and lay one half of each at the bottom of each sheet.\nPut a dollop of the mixture onto each salmon fillet and place the other half of salmon on top to form a sandwich, then top with more paste. roll up the pastry so the salmon should be wrapped about 3 times, tucking in the edges before you get to the end and sealing with butter.\nBrush with butter and place on a tray with greaseproof paper. bake in the oven until golden brown and salmon is cooked, about 20 minutes.\nServe with cooked asparagus and diced roasted potatoes."},{"id":87,"name":"Pulled Chicken Sandwich","tags":["Chicken","Lunch","Sandwich"],"servings":"2 large sandwiches","source":"https://sortedfood.com/NCIPulledChickenSandwich","image":null,"cooktime":null,"preptime":null,"ingredienttags":["chicken breast","chicken stock","yoghurt","mango chutney","baguette"],"ingredientlist":["2 ;chicken breast;s","1 ;chicken stock; cube","2 white onions","1 tbsp veg oil","1 tbsp curry powder","2 tbsp fresh coriander","4 tbsp natural ;yoghurt;","2 tbsp ;mango chutney;","2 white ;baguette; batons","1 lemon","100 g fresh crisp salad"],"directions":"Half fill a medium sized saucepan with hot water and heat to a boil on the hob, covered with a lid on for speed. Trim the chicken breasts to remove any fat or white bits of sinew from them. Whisk the stock cube into the boiling water, then turn the heat down to a gentle simmer. Lower in the chicken breast and poach, without a lid, for 15 minutes, making sure there is little to no movement in the water but the temperature stays just below a simmer. Wash the board and knife to get rid of raw chicken.\nPeel and slice the onions. Fry the sliced onions in a small saucepan with the vegetable oil and a lid, over a medium heat, for 5 minutes until soft and smelling sweet. Spoon in the curry powder and continue to cook for another minute as you stir so that it doesn’t burn on the bottom of the pan, then leave the onions to cool.\nScoop the chicken out of the water once poached and check the thickest part of the chicken breast is cooked through. (Cut into it to make sure there are no pink bits and the juices that run onto the chopping board you’re using are clear.) Allow to cool until just warm. Strip the chicken into long thin pieces (best to use your clean fingers once the chicken is cool enough) and leave to cool completely.\nChop the coriander as fine as possible and beat into the yoghurt and mango chutney in a bowl. Mix the cooled onions and cooled stripped up chicken with the yogurt mixture then season to taste. An optional squeeze of lemon juice can be really good to lift the flavour.\nSlice open the crusty white baguette batons carefully with a serrated knife and stuff with plenty of the filling, including some crisp lettuce if you prefer."},{"id":88,"name":"Swedish Meatballs","tags":["Beef","Pork","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["breadcrumbs","cream","ground pork","ground beef","allspice","nutmeg","beef stock","lingonberry jam","sour cream","parsley","dill","raspberries","potato"],"ingredientlist":["For The Meatballs","1 large brown onion","1 tbsp rapeseed oil","50 g fresh ;breadcrumbs;","100 ml double ;cream;","250 g ;ground pork; mince","250 g ;ground beef; mince","1 tsp ;allspice; powder","1/2 tsp ;nutmeg;","2 tsp soft light brown sugar","2 tbsp rapeseed oil","For The Sauce","1 tbsp salted butter","1 tbsp plain flour","300 ml ;beef stock;","1 tbsp ;lingonberry jam;","1 tbsp double cream","1 tbsp ;sour cream;","1 sprig ;parsley;, finely chopped","1 sprig ;dill;, finely chopped","To Serve","4 tbsp lingonberry jam","100 g fresh ;raspberries;","1 sprig dill","4 portions mashed ;potato;es"],"directions":"Peel and finely dice the onion. Heat the oil in a frying pan over a medium heat and add the onion. Fry gently for 20 minutes, until golden brown and soft, then leave to cool. Tip the breadcrumbs into a small bowl and pour in the cream. Soak for 10 minutes. In another mixing bowl combine the pork and the beef. Add the allspice powder, nutmeg and brown sugar with the soaked bread and the cooled onions.\nShape the meatballs into ball, slightly smaller than a golf ball. Use the frying pan used for the onions and add another 2 tbsp of oil. Heat over a high heat. Add the meatballs and coat them in the oil. Leave them to brown, turning every few minutes to colour evenly. Cook for 5 minutes, then remove from the pan to a plate.\nAdd the butter to the pan and heat until it melts and bubbles. Stir in the flour to make a roux and cook out for a few minutes. Pour in the beef stock a little at a time, stirring each time until the sauce becomes smooth. After adding all of the beef stock, scoop in the lingonberry jam and let it melt into the sauce, then return the meatballs to the pan. Simmer for 10 minutes to cook the meatballs through.\nWhen ready to serve add the double cream and the sour cream along with the chopped herbs and stir them into the sauce. Serve a good scoop of mash with a bunch of meatballs and a generous helping of sauce on each plate. Add a spoon of lingonberry jam, a few fresh raspberries and a few sprigs of dill. Serves 4"},{"id":89,"name":"American Goulash","tags":["Beef","Pasta","Main Dishes"],"servings":"6 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["bell pepper","ground beef","red wine","tomato","tomato sauce"],"ingredientlist":["1 Tbsp olive oil","1 medium onion","4 cloves garlic","2 ;bell pepper;s","1 lb ;ground beef;","1/2 cup ;red wine;","1 28oz. can diced ;tomato;es","1 15oz. can ;tomato sauce;","2 Tbsp soy sauce","2 whole bay leaves (optional)","1/2 tsp oregano","1/2 tsp basil","1/4 tsp red pepper flakes","1/2 cup water","2 cups elbow macaroni (about 1/2 lb.)","salt to taste"],"directions":"Dice the onion and mince the garlic. Sauté both in a large soup pot with the olive oil over medium heat until the onions are translucent. While the onion and garlic are sautéing, dice the bell peppers, then add them to the pot and continue to sauté for about two minutes more.\nAdd the ground beef to the pot with the vegetables and continue to sauté over medium until the beef is cooked through. Add the red wine to the pot and stir to dissolve any browned bits off the bottom of the pot.\nAdd the diced tomatoes (with juices), tomato sauce, soy sauce, bay leaves, oregano, basil, crushed red pepper, and water to the pot. Stir to combine, place a lid on the pot, and allow it to come up to a boil. Once boiling, turn it down to low, and let the sauce simmer for 30 minutes with the lid on, stirring occasionally.\nAfter the sauce has simmered for 30 minutes, add the macaroni and stir to combine. Continue to let the macaroni simmer in the sauce, with the lid on, stirring occasionally, until the pasta is tender (about 10-12 minutes).\nOnce the pasta is tender, taste the goulash and add salt to taste. Remove the bay leaves, then serve."},{"id":90,"name":"Steak Burgers","tags":["Beef","Burger","Main Dishes"],"servings":"4 double patties, or 8 single patties","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["ribeye","ground beef"],"ingredientlist":["1 ;ribeye; steak","50 g cold beef dripping","500 g 15% fat ;ground beef; mince","3 tbsp mayo","1 tbsp tomato ketchup","2 tbsp bbq sauce","8 rashers smoked streaky bacon","1 red onion","1 baby gem lettuce","1 tbsp olive oil","8 slices cheddar cheese","4-8 brioche buns"],"directions":"Put the steak in the freezer for an hour before starting. Dice the steak and add it to a food processor with the cold beef dripping. Blitz until it’s a rough mince but not like a paste.\nCombine the steak mince and the pre-bought mince. Shape them into thin 100g patties that are slightly larger than your buns and chill them in the fridge.\nPreheat the oven to 200ºC. Lay the bacon onto a baking tray lined with greaseproof paper. Bake the bacon for 10-12 minutes until it's crispy. Meanwhile prepare your toppings! Combine the mayo, ketchup and BBQ sauce into one amazing sauce. Boil a small pan of water then peel and slice the onion into whole rings. Pour boiling water over the red onions and soak for 20 seconds to mellow the flavour. They should still hold their form.\nGet a frying pan (preferably with a lid) smoking hot over a high heat. Season the burgers with oil, salt and pepper. Fry the burgers for 2 minutes on each side, then place a slice of cheese over each of them. You might have to cook them in batches. Place the lid onto the pan and let the cheese melt for a minute then take them out of the pan to rest.\nSlice the buns and put them in the same pan to toast. Cook until they begin to blacken. Assemble you burgers! Spread the sauce over the bottom buns and the lids, then from the bottom add lettuce, a double stack of burgers, tomato, gherkins and onion. Top with with your lid and dig in. Serve with handcut chips! Makes 4 double burgers"},{"id":91,"name":"Argentinian Beef Empanadas","tags":["Snack","Freezer Foods","Beef","Lunch"],"servings":"36 empanadas (yes, that much)","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["ground beef","bell pepper","chicken stock","raisins","Puff Pastry Dough","green olives"],"ingredientlist":["3 Tbsp. extra-virgin olive oil, divided","1 kg (2 lb). ;ground beef; (20% fat)","2 medium onions, chopped","2 small red ;bell pepper;s, seeded, chopped","Kosher salt, freshly ground pepper","3 Tbsp. ground cumin","2 Tbsp. sweet paprika","1 Tbsp. dried oregano","¼ tsp. cayenne pepper","350 mL (1½ cups) low-sodium ;chicken stock; or broth","2 tsp. sugar","75 gr (½ cup) ;raisins;","3 packages (12 each) ;Puff Pastry Dough;","50 gr (½ cup) pitted ;green olives; (Picholine or Spanish), rinsed well, cut in half lengthwise"],"directions":"Heat 2 Tbsp. oil in a large pot over high. Cook beef, breaking up with a spoon, until browned but not completely cooked through, 6–8 minutes. Transfer to a medium bowl with a slotted spoon, leaving as much fat in pan as possible.\nReduce heat to medium and cook onion, bell peppers, and remaining 1 Tbsp. oil, stirring, until tender but not browned, 6–8 minutes; season with salt and black pepper. Add cumin, paprika, oregano, and cayenne and cook, stirring, until fragrant, about 1 minute. Add chicken stock and reserved beef along with any accumulated juices to pot. Stir in sugar, 2 tsp. salt, and ¼ tsp. black pepper. Bring to a simmer and cook, stirring and scraping up any brown bits, until most of the liquid is evaporated, 15–20 minutes; taste and season with salt and black pepper, if needed. Stir in raisins. Transfer to a medium bowl, cover, and chill at least 3 hours.\nPreheat oven to 375°. Let dough sit at room temperature 15 minutes to temper. Remove 6 rounds from package, keeping plastic divider underneath, and arrange on a work surface. Place 2 Tbsp. filling in the center of each round. Top with 2 olive halves. Brush water around half of outer edge of each round. Using plastic divider to help you, fold round over filling and pinch edges to seal. Using a fork, crimp edges. Remove plastic and transfer empanada to a parchment-lined sheet tray, spacing 1\" apart. Repeat with remaining rounds.\nBake empanadas, rotating tray halfway through, until golden brown and slightly darker around the edges, 25–35 minutes.\nDo Ahead: Filling can be made 3 days ahead. Keep chilled. Unbaked empanadas can be made 3 months ahead; freeze on sheet tray, then transfer to freezer bags and keep frozen."},{"id":92,"name":"Varkensvlee met Paprika","tags":["Main Dishes","Pork","Rice"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["3 el olie","750g varkensvlees, in blokjes","1 ui, in ringen","3 groene paprika, in stukjes","2 tomaten, ontveld en in stukjes","½ tl gemalen komijn","½ tl oregano","3 el peterselie","2 dl kippenbouillon","1 tl citroensap","Zout en peper","Gekookte rijst(als bijgerecht)"],"directions":"Verhit olie in een grote pan en bak de varkensblokjes bruin. Haal het vlees eruit en hou apart\nFruit de ui en knoflook in het bakvet.\nVoeg de paprika en tomaat toe en fruit voor 2min mee\nVoeg de komijn, oregano, peterselie en bouillon toe en breng aan de kook.\nVoeg de varkensblokjes toe, draai het vuur laag en laat ca. 1½ uur zachtjes koken tot het vlees gaar is.\nNeem de deksel van de pan en draai vuur hoog. Laat de saus tot ongeveer de helft inkoken. Af en toe roeren.\nMaak op smaak met citroensap, zout en peper."},{"id":93,"name":"Easy Spaghetti Carbonara","tags":["Pasta","Egg","Pork","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["spaghetti","pancetta","bacon","spring onions","egg","crème fraiche","parmesan"],"ingredientlist":["500 gr cooked ;spaghetti;","1 tsbp olive oil","300 gr ;pancetta; or ;bacon;","4 ;spring onions;","2 cloves of garlic","A pinch of cayenne pepper to taste","2 ;egg;s","2 tbsp ;crème fraiche;","40 gr ;parmesan; cheese, grated"],"directions":"In a large pan, bring a good amount of water and salt to boil and add the spaghetti. Cook until al dente, about 8 minutes or to taste.\nIn de meantime, Heat oil in a pan on high. Add the pancetta and fry off until golden brown, slightly crispy. \nWhile the pancetta is cooking, cut the spring onions in rings, and mince the garlic. Drain the excess fat off the pancetta and add in the onions and garlic together with the cayenne pepper. Let cook for a few minutes. Whisk together the egg, creme fraiche, parmesan and some salt and pepper together until smooth.\nDrain the pasta and put it back into the pan, off the heat. Stir in the pancetta mix followed by the egg mix. Stir well and serve."},{"id":94,"name":"Pittig Gekruide Bruine Bonenschotel met Rookworst","tags":["Main Dishes","Pork"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1 grote pot bruine bonen, uitgelekt","2 middelgrote uien gesnipperd","2 teentjes knoflook","1 middelgrote prei, halve ringen","1 paprika","2 eetlepels zonnebloemolie","2 theelepels gedroogde tijm","1 theelepel kerriepoeder","½ theelepel cayennepeper","1 kleine rookworst, in plakjes ","3 eetlepels pindakaas","2 eetlepels witte natuurazijn","2 eetlepels ketjap manis","2 theelepels sambal oelek","4 augurken in kleine stukjes","10 Amsterdamse uien in stukjes"],"directions":"Verhit de olie en bak hierin de ui en knoflook glazig. Voeg de prei en de paprika toe.\nVoeg het kerriepoeder, de cayennepeper en de tijm toe en roerbak die samen met de plakjes rookworst ook even mee.\nRoer de pindakaas los met de azijn, ketjap en de sambal en doe dit in de pan bij de groenten. Verwarm dit zolang tot de pindakaas goed is opgelost.\nDoe de bruine bonen, samen met de stukjes augurk en Amsterdamse uien in de pan.\nRoer alles goed door elkaar en verwarm de bruine bonenschotel tot alles goed warm is."},{"id":95,"name":"Roasted Bratwurst with Peppers and Onions","tags":["Pork","Sandwich","Main Dishes"],"servings":"5 sandwiches, 2 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["red wine vinegar","mustard","bell pepper","bratwurst","cheddar"],"ingredientlist":["2 Tbsp olive oil","1 Tbsp ;red wine vinegar;","1/2 Tbsp coarse ;mustard;","1/4 tsp garlic powder","1/8 tsp salt","Freshly cracked pepper","3 ;bell pepper;s (any color)","1 onion","5 ;bratwurst; links","5 buns","2 oz. ;cheddar; (optional topping)","4 Tbsp mustard (optional topping)"],"directions":"Preheat the oven to 210ºC. In a small bowl stir together the olive oil, red wine vinegar, coarse mustard, garlic powder, salt, and pepper. Set the vinaigrette aside.\nSlice the bell peppers and onion into 1/4-inch strips and place them on a large baking sheet. Add the bratwurst links to the baking sheet, then drizzle the vinaigrette over top. Toss the peppers, onions, and bratwurst until everything is coated in vinaigrette.\nPlace the in the oven and roast for 20 minutes, then give everything a good stir. Then roast for another 20-25 minutes, or until browned.\nStuff the bratwurst, peppers, and onions into the buns and top with shredded cheddar if desired. Place them for about 5 minutes to melt the cheese and toast the buns. Top with more mustard just before serving."},{"id":96,"name":"Teriyaki Meatball Bowls","tags":["Beef","Pork","Main Dishes","Rice"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["ground pork","egg","breadcrumbs","green onions","rice vinegar","green onions"],"ingredientlist":["Meatballs","500gr(1 lb). ;ground pork;","1 large ;egg;","1/2 cup plain ;breadcrumbs;","1 clove garlic, minced","1 inch fresh ginger","1/2 tsp soy sauce","2 whole ;green onions;","10-15 cranks freshly cracked black pepper","Teriyaki Glaze","100mL (1/2 cup) soy sauce","100gr (1/2 cup) brown sugar","100mL (1/2 cup) water","1/2 Tbsp toasted sesame oil","1 Tbsp ;rice vinegar;","4cm (2 inches) fresh ginger","2 Tbsp corn starch","1 Tbsp sesame seeds","Rice Bowls","1/2 cups dry jasmine rice","2 whole ;green onions;"],"directions":"Preheat the oven to 210 degrees. Place the ground pork in a large bowl. Peel the ginger and then grate it using a small holed cheese grater into the bowl. Mince the garlic, slice the green onions, and add them to the bowl. Also add the egg, breadcrumbs, soy sauce, and black pepper. Mix these ingredients really well\nCover a baking sheet with foil. Roll the meatball mixture into small balls, about one tablespoon each. You should yield about 30 meatballs. Bake in the preheated oven until golden brown (about 35-40 minutes).\nWhile the meatballs are in the oven, begin cooking the rice according to the package directions.\nalso prepare the teriyaki glaze. In a medium pot combine the soy sauce, water, brown sugar, rice vinegar, and sesame oil. Peel and grate the ginger into the pot. Heat over a low flame until the brown sugar is dissolved.\nDissolve the cornstarch in just enough water to make it pourable. Pour it into the pot with the glaze ingredients. Turn the heat up to medium high, stir and cook until thickened. Once thickened, add the sesame seeds.\nWhen the meatballs come out of the oven, transfer them from the baking sheet into the pot with the glaze. Stir to coat. Fluff the rice with a fork. Build the bowls by placing one cup of rice in a bowl, add five meatballs and a couple of spoons of extra teriyaki glaze, then sprinkle a few sliced green onions over top. Serve with a salad."},{"id":97,"name":"Gumbo","tags":["Pork","Chicken","Shellfish","Vis","Main Dishes","Rice"],"servings":"6 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["sausage","bell pepper","celery","chicken broth","tomato","chicken thighs","shrimp","green peas","green onions"],"ingredientlist":["½ cup all-purpose flour","70 gr butter","1 350 gr smoked ;sausage;, ¼ inch rounds","1 large onion, diced","1 green ;bell pepper;, diced","4 ribs ;celery;, thinly sliced","1 tsp salt","1 tsp ground black pepper","1 tsp smoked paprika","1 Tbsp dried oregano","4 cloves garlic, minced","500 mL ;chicken broth;, stock, or beer","1 400 gr can diced ;tomato;es","350 gr ;chicken thighs;, diced in ¾ inch pieces","350 gr ;shrimp;, peeled and deveined","1 cup frozen ;green peas;","2 ;green onions;, thinly sliced"],"directions":"Heat the skillet over medium heat. Add butter and flour to the skillet and combine as the butter melts. Stir regularly every 30 seconds for 10 minutes, or until the roux is the color of milk chocolate.\nAdd the sausage, onion, bell pepper, celery, salt, pepper, and paprika to the skillet and mix it into the roux. Sauté until the onions are translucent, about 6–8 minutes. Add oregano and garlic and continue to sauté for an additional minute. Slowly pour in the broth, stock, or water and then the can of tomatoes.\nBring the skillet to a boil, then lower the heat to low. Add chicken to the skillet and mix in. Simmer, uncovered, for 1 hour, stirring occasionally. Add shrimp and okra to the gumbo and simmer for an additional 15 minutes.\nServe hot with rice and top with scallions."},{"id":98,"name":"Schnitzels","tags":["Pork","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg","breadcrumbs","pork","steak","lemon"],"ingredientlist":["2 tbsp vegetable oil","2 ;egg;s","100 g flour","200 g toasted fresh ;breadcrumbs;","2 tsp cayenne pepper","4 ;pork; or veal ;steak;s (300g each)","50 g butter","50 g lard","1 ;lemon;","1/2 bunch parsley"],"directions":"Put the eggs in a bowl and whisk until frothy. Tip flour into another large bowl and the breadcrumbs into another with the cayenne powder. Season both with salt and pepper. Roll a layer of clingfilm over a chopping board and place a pork steak down. Lay another sheet of clingfilm over the top and bash the meat very thin (0.5cm) using a meat tenderiser or a rolling pin. Repeat for all of the steaks.\nLine a large chopping board or tray with greaseproof paper. Coat each steak with the flour, then the egg yolks, egg whites and finally the breadcrumbs. Lay the finished steaks onto the lined board or tray.\nAdd the butter and the lard to a large frying pan and heat over a medium high heat until it’s foaming. Add the steaks and fry for 3-4 minutes on each side until the breadcrumbs are crispy and a deep golden brown.\nDrain any excess oil on the schnitzels on kitchen paper and put them on plates. Add a lemon wedge to each plate and tuck in while it’s hot! Serve with fries"},{"id":99,"name":"Tahoe Padas","tags":["Vegetarian","Rice"],"servings":"2 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1 recept #106#Dry Fried Tofu#","1 ui, gesnipperd","1 teentje knoflook","Ketjap manis","Sambal of peper","Laos","Olijfolie","Rijst(liefst zilvervlies)"],"directions":"Zet de rijst op\nVerhit olie in een pan en voeg daar de tahoe bij toe, bak tot bruin aan meerdere kanten.\nHaal de tahoe uit de pan en leg in keukenpapier of theedoek, probeer de olie in de pan te houden.\nFruit de ui in dezelfde pan tot glanzend, voeg dan de knoflook toe, bak even mee en voeg dan de laos en sambal toe\nVoeg daarna de tahoe en ketjap toe, laat een tijdje sudderen\nLekker met komkommersla"},{"id":100,"name":"Roasted Chickpea and Broccoli Burritos","tags":["Vegetarian","Wrapped","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["bell pepper","broccoli","chickpeas","tortillas"],"ingredientlist":["1 large yellow onion","1 red ;bell pepper;","1 large crown of ;broccoli;","2 cans of ;chickpeas;","3tbsp olive oil","2tbsp soy sause","2tsp chili powder","1tsp ground cumin","1tsp smoked paprika",".5tsp ground coriander","Cayenne pepper, to taste","4 cloves of garlic, minced",".5 of a lime","4-6 ;tortillas;","Burrito trimmings such as, spinach, avocados and red salsa"],"directions":"Preheat oven to 220°C. grab a large rimmed baking sheet\nChop up the onion, bell pepper and broccoli until they're the size of a chickpea. Place all the chopped up veggies in a large bowl with the cooked chickpeas. Pour in the oil and soy sauce, stir, and then throw all the spices in there. Put in a baking sheet and bake for 20min.\nTake it out of the oven, add the garlic and stir it around. Bake for another 15min. squeeze the lime juice over the pan and stir the roasted chickpeas and veggie around. Now make burritos!"},{"id":101,"name":"Refried Beans","tags":["Veggie Side Dish","Side Dish","Vegetarian"],"servings":"8 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["beans","jalapeno"],"ingredientlist":["500gr Brown(or pinto) ;beans;","1 medium onion","1 medium ;jalapeno;","2 cloves garlic","1 tsp cumin ","1/2 Tbs chili powder","10-15 cranks cracked black pepper","1.4L water","2-3 tsp salt"],"directions":"Dice the onion. Remove the seeds and ribs from the jalapeño by scraping with a spoon. Dice the jalapeño and mince the garlic. Place the onion, garlic, and jalapeño in the slow cooker along with the cumin, chili powder, and black pepper. Do not add the salt.\nAdd the sorted and rinsed beans to the slow cooker along with 1.4L of water. Stir everything to distribute the seasoning. Secure the lid and cook on high for 4-5 hours or on low for 8. It’s okay if they cook longer, they’ll just be easier to mash.\nAfter cooking, remove about 1 cup of the water and reserve it in a bowl. Mash the beans and add the reserved water back in as needed. Make the beans a little thinner in texture than you’d expect because they will thicken as they cool. Season the mashed beans with salt, beginning with one teaspoon and adding more to taste. I used approximately 1 Tbsp but add a little at a time until you’re satisfied. Serve warm!"},{"id":102,"name":"Weeknight Enchiladas","tags":["Vegetarian","Wrapped","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["tomato paste","tortillas","cheese","avocado","cilantro","green onions"],"ingredientlist":["SAUCE","2 Tbsp vegetable or canola oil","2 Tbsp chili powder","2 Tbsp flour","2 cups water","3 oz. ;tomato paste;","½ tsp cumin","½ tsp garlic powder","¼ tsp cayenne pepper","¾ tsp salt","ENCHILADAS","16 small corn ;tortillas;","1 recipe #101#refried beans#","8 oz. Pepper Jack ;cheese;, shredded (2 cups)","1/2 large ;avocado;, sliced thin","1/4 bunch ;cilantro; (or ;green onions;), roughly chopped"],"directions":"Begin by making the sauce. In a small sauce pot, combine the chili powder, flour, and oil. Heat over a medium flame, while stirring, for one to two minutes to toast the spices and flour. Whisk in the water, tomato paste, cumin, garlic powder, and cayenne pepper. Allow the mixture to come to a simmer. Once thick enough to coat a spoon, taste and add salt \nToast the tortillas. Prepare a casserole dish by coating with non-stick spray, then spread a layer of enchilada sauce over the bottom (1/2 to 1 cup). Preheat the oven to 180 degrees.\nAdd about 1/4 cup of refried beans to each tortilla, plus a small pinch of shredded cheese. Roll the tortilla tightly around the beans and cheese, then place in the casserole dish. Pour another 1 cup enchilada sauce over the rolled enchiladas in the dish, leaving some of the edges exposed. Top with the remaining shredded cheese.\nBake the casserole in the oven for 25-30 minutes. Top with thin slices of avocado and chopped cilantro leaves (or sliced green onions)."},{"id":103,"name":"Pittige Pompoen Pasteitjes","tags":["Vegetarian","Main Dishes","Freezer Foods"],"servings":"6 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["deeg","300g bloem","1tl kurkuma","1tl zout","4el olijfolie","1 eidooier","Vulling","800gr poempoen in blokjes","2el olijfolie","1 ui","2 tenen knoflook","1tl gemberwortel","1tl kaneel","1 blik van 400g linzen","2 eidooiers"],"directions":"Doe voor het deeg de bloem, kurkuma en zout in een kom. Voeg de olie eidooier en 1 ¼ dl ijswater toe. Meng alles met een vork, druk allen bij elkaar en kneed tot glad en elastisch. Vorm 12 ballen en laat het 1 uur rusten onder vochtige doek\nVerwam de oven tot 200°C. verdeel de pompoen op een bakplaat  en dump er 1el olijfolie over, doe er zout en peper over. Laat ze 30min in de oven roosteren tot goudbruin\nVerhit de tweede el olijfolie in een braadpan op halfhoog tot tot hoog vuur en smoor de ui in 5min glazig.\nVoeg de knoflook gember en kaneel toe smoor nog 2min. Stort de ui in een mengkom en voeg de linzen en pompoen toe. Prak alles grof met een vork en breng op smaak. Laat het mengsel koud worden\nRol elke deegbal uit tot een cirkel en verdeel 2-3 el vulling over een helft. Bestrijk de rand met water en vouw het over de vulling heen. Druk aan met tanden van een vork.\nLeg de pasteitjes op een bakplaat, bestrijk ze met eidooier en bak ze in 25min gaar."},{"id":104,"name":"Pagan Pancakes","tags":["Pancakes","Main Dishes","Vegetarian"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["shallots","sage","flour","buttermilk","whole milk"],"ingredientlist":["1 Tbsp unsalted butter","2 large ;shallots;, sliced","1 Tbsp finely chopped fresh ;sage;","1 cup all-purpose ;flour;","1 tsp baking powder","½ tsp baking soda","½ tsp salt","1 Tbsp sugar","1 large egg, beaten","1 cup ;buttermilk;","½ cup ;whole milk;","1 cup grated mild cheddar","1 cup grated sharp cheddar"],"directions":"In a small sauté pan, heat the butter and add the shallots and fresh sage. This will brown and soften quickly, even on medium heat, so keep a good eye on this.\nRemove from heat and allow to cool. In a large mixing bowl, add the dry ingredients (flour, baking powder, baking soda, salt, and sugar), and combine.\nAdd the egg, buttermilk, and milk to the dry ingredients. Mix thoroughly, removing all lumps. Add the cooled shallots and sage, and mix. Then add the cheese and fully incorporate in the mixing bowl. Set the mixture aside for 20 minutes. Heat skillet or griddle. Add butter to the hot pan and cook as normal."},{"id":105,"name":"Mac 'n' Cheese","tags":["Fridge Clearing","Main Dishes","Vegetarian"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["40 gr butter plus extra for greasing","50 gr flour","500 ml milk","300 gr macaroni","Salt and pepper","A pinch of cayenne","1 tsp oregano","100 gr cheese (preferably old gouda or cheddar)","100 gr gruyere","25 gr breadcrumbs","Any optional veg or jalapenos or meats"],"directions":"Preheat the oven at 200° C. Bring water to a boil and cook the pasta with salt. Drain and set aside. While the pasta is cooking grate the cheeses and butter an oven dish.\nAfter the pasta is done, melt the butter in a small pan. Add the flour and stir properly. Let cook for just a little bit to remove the flour taste. Then add the milk a little bit at a time, start with about a tablespoon then gradually add more each time. Whisk smooth in-between adding the milk.\nAdd the cheeses and melt until it's incorporated into the sauce. Add the cayenne, oregano and the optional veg and/or meat. Stir the sauce into the cooked pasta.\nPour everything into the oven dish and cover it with breadcrumbs. Put the dish in the oven for about 25 minutes. Serve with a fresh salad."},{"id":106,"name":"Dry Fried Tofu","tags":["Vegan"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1 block tofu, pressed for 30 minutes","Pinch of salt"],"directions":"Cut the tofu vertically into planks 1/4 inch thick and then cuts them in half widthwise.\nPreheat a large wok or cast-iron skillet over medium heat. Once the pan is hot, add the tofu in a single layer. You might have to do this in two batches.\nSprinkle a pinch of salt over the tofu and start gently pressing down on the tofu with your spatula. You'll hear the steam escape from under the tofu as you do this. It sounds like screams but keep the fuck on. After 3-4 minutes, the bottom sides should look golden brown. Flip them over and repeat. When the tofu is cooked all over you can cut it into anything you want."},{"id":107,"name":"Slow Cooker Vegetarian Lentil Chili","tags":["Vegetarian","Slowcooker","Main Dishes"],"servings":"6 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["tomato","black beans","kidney beans","lentils"],"ingredientlist":["1 yellow onion","2 cloves garlic","1 15oz. can petite diced ;tomato;es (with juices)","1 6oz. can tomato paste","1 15oz. can ;black beans;, drained","1 15oz. can ;kidney beans;, drained","1 cup brown ;lentils;, uncooked","1 Tbsp chili powder","1 tsp smoked paprika","1 tsp cumin","1/2 tsp onion powder","1/4 tsp garlic powder","1/4 tsp cayenne pepper","1/2 tsp salt","freshly cracked pepper","2 Tbsp coconut oil","cups vegetable broth"],"directions":"Dice the onion and mince the garlic. Add the onion and garlic to the slow cooker, along with all the other ingredients to the slow cooker. Stir the ingredients in the slow cooker to combine.\nPlace a lid on the slow cooker and cook on high for four hours (or low for 8 hours). After cooking, the lentils should be tender. Taste the chili and add salt to taste, if needed (this will depend on the salt content of your broth). \nServe the chili hot, with your favorite toppings like something creamy (cheese, sour cream, or avocado), something green (green onion, cilantro, or avocado), and sometimes something starchy (tortilla chips, oyster crackers, cornbread, or crusty bread for dipping)."},{"id":108,"name":"Guacamole","tags":["Saus"],"servings":null,"source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["2 avocados","1 klein uitje, fijngesneden","2 teentjes knoflook","Sap van 1 limoen","Tabasco naar smaak, of 1tl sambal","2el yogonaise of mayonaise","Snufje zout","Snufje korianderpoeder","Eventueel vlees van 1 tomaatje"],"directions":"Ontpit de avocado en haal het vlees uit de schil. Maal fijn op een bordje met een vork, leg in een kommetje.\nVoeg de andere ingrediënten toe, roer alles door elkaar heen en laat een tijdje staan."},{"id":109,"name":"Sweet Potato, Squash, and Black Bean Enchiladas","tags":["Wrapped","Vegan","Main Dishes","Mexican"],"servings":"4 servings","source":"Thug Kitchen","image":"","cooktime":null,"preptime":null,"ingredienttags":["sweet potato","squash","pumpkin","black beans"],"ingredientlist":["Enchilada sauce","500 ml vegetable stock","140 gram tomato puree(two small cans)","2.5 tbsp chili seasoning","2 tsp ground cumin","1.5 tsp dried oregano","2 to 3 cloves garlic, minced","2 tsp soy sauce","1 tbsp lime juice","Filling","1 large ;sweet potato;(about 500 gr)","2 tsp olive oil","1 onion","1 medium yellow ;squash; or ;pumpkin;, grated into 1 cup","1 tsp chili seasoning","0.5 tsp ground cumin","0.5 tsp salt","2 cloves garlic, minced","400 gr cooked ;black beans;","1 tsp maple syrup","8 tortillas","#108#Guacamole# to serve"],"directions":"Preheat the oven to 200° C. Make the sauce. Put everything except the lime juice in a saucepan and bring to a simmer. Whisk until the tomato puree is incorporated. Let that simmer for 10-15 minutes so it thickens a little. Add the lime juice and take of the heat to cool.\nCook the potato in any way you like. For instance, stab it with a fork then put it in the microwave for 5 minutes. Flip over and cook for 5 minutes more. Make sure it ends up chopped into pieces. Mash a little bit, chunks are okay.\nWhile the potato cooks, grab a large skillet and heat the oil over medium heat. Sauté the onion until it begins to brown, about 3-5 minutes. Add the squash and cook for another minute. Add the chili powder, cumin, salt, garlic, and black beans. Cook together for another 2 minutes and then fold in the mashed potato and maple syrup and turn off the heat. Mix until combined.\nCover the bottom of a baking dish with about 1 cup of the sauce. Warm up your tortillas to soften them. Put one tablespoon of sauce on a tortilla and then a couple of spoonfulls of filling. Roll them up and set them seam-side down in the dish.\nCover the enchiladas with the remaining sauce, cover the dish tightly with foil and put in the oven for 20 minutes. Take off the foil and cook it for 5 more minutes. Serve with the guacamole."},{"id":110,"name":"Vegetarian Shepherd's Pie","tags":["Vegetarian","Main Dishes"],"servings":"6 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["lentils","carrots","celery","mushrooms","peas","potato"],"ingredientlist":["1 cup cooked ;lentils; (optional)*","2 cloves garlic","1 yellow onion","1 Tbsp olive oil","3 ;carrots;","2 stalks ;celery;","8 oz. button ;mushrooms;","3/4 tsp salt","1 tsp dried thyme","1/2 tsp smoked paprika","Freshly cracked pepper","1 Tbsp tomato paste","1 Tbsp flour","1 cup vegetable broth","1 cup frozen ;peas;","4 cups mashed ;potato;es"],"directions":"Mince the garlic and dice the onion. Sauté the onion and garlic with olive oil in a large skillet over medium heat until the onions are soft and transparent (3-5 minutes).\nWhile the onions and garlic are cooking, peel and dice the carrots, dice the celery, and slice the mushrooms. Once the onions are soft, add the carrots and celery to the skillet and continue to sauté until the celery begins to soften slightly (5 minutes).\nFinally, add the mushrooms, salt, thyme, smoked paprika, and freshly cracked pepper to the skillet. Continue to sauté until the mushrooms have fully softened (3-5 minutes). Add the tomato paste and flour to the skillet. Stir and cook the vegetables with the flour and tomato paste until the vegetables are coated and the pasty mixture begins to coat the bottom of the skillet.\nAdd the vegetable broth to the skillet, stirring to dissolve the flour and tomato paste from the bottom of the skillet. Allow the broth to come up to a simmer, at which point it will become slightly thicker. Stir in the cooked lentils and frozen peas, and allow to mixture to heat through.\nPreheat the oven to 210ºC. Pour the vegetable mixture into a casserole dish, or use your skillet if it is oven safe. Spread the mashed potatoes out over the surface of the vegetables and gravy.\nBake the shepherd's pie in the fully preheated oven for 15 minutes."},{"id":111,"name":"White Bean and Lentil Burgers","tags":["Burger","Vegan","Main Dishes"],"servings":"8 patties, 4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["lentils","white beans","jalapeno"],"ingredientlist":["80gr dry red ;lentils; (1/3 cup)","150 mL water (2/3 cup)","2 400gr(15oz) cans of ;white beans;","1/2 red onion, chopped","3 cloves garlic, minced","1 ;jalapeno;, minced","60gr breadcrumbs (1/2 cup)","1.5 tsp smoked paprika","1.5 tsp all-purpose seasoning blend (pick your fav)","1 tsp ground cumin","1 tbsp olive oil","1/2 tsp of salt","Grated zest of 1/2 lime","Burger fixings, buns, lettuce, sauce, onions etc"],"directions":"Combine the lentils and water in a saucepan and bring to a boil. Reduce the heat and let simmer until the lentils are soft and mushy and the water is mostly gone, about 10 minutes. Drain away any extra water and let the lentils cool while you prep the rest.\nMash the white beans in a large bowl and then add the lentils and the rest of the ingredients(not counting the fixings). If you find the mixture too wet to hold its shape, add some more breadcrumbs. Shape the mix into patties and put them on an oiled baking sheet. Chill the patties in the fridge, covered for at least 30 minutes up to 4 hours.\nPreheat the oven to 210 degrees C when you're ready to cook the patties. Coat the patties lightly with some cooking spray or oil and bake them for about 30 minutes, flipping them halfway. You want them to be golden on both sides. Serve them up with your favourite burger fixings and enjoy."},{"id":112,"name":"Vegetable Biryani for the Slowcooker","tags":["Vegan","Vegetarian","Rice","Slowcooker","Main Dishes"],"servings":"8 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["sweet potato","green beans","peas","coconut milk","cashews","saffron","rosewater"],"ingredientlist":["2 tbsp vegetable oil","2 large onions, diced","2 cloves garlic, minced","2 tsp minced ginger","2 tsp curry powder","1 tsp garam masala","1 tsp ground cumin","1 tsp cinnamon","6 cardamom seeds","1 red pepper, diced","1 ;sweet potato;, peeled and diced","200 gr ;green beans;","150 gr frozen ;peas;","Salt and pepper","300 mL vegetable stock","120 mL ;coconut milk;","125 gr roasted ;cashews;","A few threads of ;saffron;","1 tsp ;rosewater;","600 gr uncoocked basmati, rinsed and drained","Chopped coriander to serve"],"directions":"Grease the inside of the cooker. Heat the oil in a large skillet en sauté the onion until soft. Add the garlic and ginger until it starts smelling really good. Stir in the curry powder, garam masala, cumin, cinnamon and cardamom and cook for another 4 minutes or so.\nPut this in the slowcooker and add the red pepper, sweet potato, green beans and frozen peas. Season with salt and pepper. Stir in the stock and coconut milk and add the cashews.\nSteep the saffron in a small bowl with boiling water and add the rosewater to it. Boil the rice for about 5 minutes and drain. Put the rice on top of the vegetable mix and then add the rosewater mix.\nPut the lid on and cook on low for 4 hours. Serve with chopped coriander and naanbread."},{"id":113,"name":"BBQ Tofu Sliders","tags":["Vegetarian","Burger","Main Dishes"],"servings":"3 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["tofu","BBQ Sauce"],"ingredientlist":["BBQ Tofu","14 oz. block firm or extra firm ;tofu;","1 tsp smoked paprika","1/4 tsp garlic powder","1/2 tsp salt","freshly cracked pepper","1 Tbsp cornstarch","Tbsp cooking oil","1/4 cup ;BBQ Sauce;","Simple Coleslaw","1/2 lb. shredded cabbage slaw mix* (about 3 cups)","1/3 cup mayonnaise","1/2 Tbsp honey","1 tsp Dijon mustard","1 tsp apple cider vinegar","1/4 tsp salt","Freshly cracked pepper","For Serving","Tbsp BBQ sauce","Buns"],"directions":"Press the tofu for about 30 minutes. Once pressed, transfer the tofu to a cutting board and roughly chop into random 1/2-inch sized pieces. Place the chopped tofu in a bowl.\nIn a separate small bowl, stir together the smoked paprika, garlic powder, salt, and some freshly cracked pepper. Sprinkle this over the tofu, then gently stir the tofu until it is coated in the spices.\nAdd 1 tsp cornstarch to the tofu and gently fold until coated. Repeat two more times until 1 Tbsp cornstarch total has been added to the tofu.\nHeat 2 Tbsp cooking oil in a large non-stick skillet over medium heat (cast-iron or teflon, your choice). Once the oil is very hot, add the tofu to the skillet. Let the tofu cook, stirring only occasionally, for about ten minutes, or until it appears firm and darkened on the outside edges.\nRemove the tofu from the heat, add the 1/4 cup BBQ sauce, and stir to coat.\nWhile the tofu is cooking, prepare the simple coleslaw. In a medium bowl stir together the mayonnaise, honey, Dijon, vinegar, salt, and pepper. Add the shredded cabbage coleslaw mix, then stir until it is coated in the dressing.\nTo serve the sliders, scoop about 1/3 of the BBQ tofu onto each bun, then drizzle each with an extra tablespoon of BBQ sauce. Finish each slider off with a heaping scoop of the simple coleslaw and finally, the top half of the bun. Enjoy!"},{"id":114,"name":"Pulled Chicken Sandwich","tags":["Sandwich","Chicken"],"servings":"2","source":"https://sortedfood.com/NCIPulledChickenSandwich","image":"","cooktime":null,"preptime":null,"ingredienttags":["chicken breasts","chicken stock","yoghurt","mango chutney","baguette"],"ingredientlist":["2 ;chicken breasts;","1 ;chicken stock; cube","2 white onions","1 tbsp veg oil","1 tbsp curry powder","2 tbsp fresh coriander","4 tbsp natural ;yoghurt;","2 tbsp ;mango chutney;","2 white ;baguette; batons","1 lemon","100 g crisp lettuce"],"directions":"Half fill a medium sized saucepan with hot water and heat to a boil on the hob, covered with a lid on for speed. Trim the chicken breasts to remove any fat or white bits of sinew from them. Whisk the stock cube into the boiling water, then turn the heat down to a gentle simmer. Lower in the chicken breast and poach, without a lid, for 15 minutes, making sure there is little to no movement in the water but the temperature stays just below a simmer. Wash the board and knife to get rid of raw chicken.\nPeel and slice the onions. Fry the sliced onions in a small saucepan with the vegetable oil and a lid, over a medium heat, for 5 minutes until soft and smelling sweet. Spoon in the curry powder and continue to cook for another minute as you stir so that it doesn’t burn on the bottom of the pan, then leave the onions to cool.\nScoop the chicken out of the water once poached and check the thickest part of the chicken breast is cooked through. (Cut into it to make sure there are no pink bits and the juices that run onto the chopping board you’re using are clear.) Allow to cool until just warm. Strip the chicken into long thin pieces (best to use your clean fingers once the chicken is cool enough) and leave to cool completely.\nChop the coriander as fine as possible and beat into the yoghurt and mango chutney in a bowl. Mix the cooled onions and cooled stripped up chicken with the yogurt mixture then season to taste. An optional squeeze of lemon juice can be really good to lift the flavour.\nSlice open the crusty white baguette batons carefully with a serrated knife and stuff with plenty of the filling, including some crisp lettuce if you prefer."},{"id":115,"name":"Fancy Kapsalon","tags":["Beef","Fries"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["potatoes","bavette","steak","cheese","coriander"],"ingredientlist":["1 kg ;potatoes;","200 g ;bavette; or minute ;steak;","1 tbsp olive oil","100 g cheddar ;cheese;","2 spring onions","2 green chillies","1/2 bunch fresh ;coriander;","1 lime","1 tbsp sriracha","2 tbsp mayonnaise"],"directions":"Preheat the oven to 200ºC. Microwave the potatoes in two batches,10 minutes for each batch, until they’re soft all the way through. Scoop out the middles and save the flesh for something like mash, croquettes or soup. Slice the skins lengthways into 3-4 wide strips. Place the skins onto a baking tray and bake for 20 minutes, until deep brown and crisp.\nRemove the skins and switch the oven to the grill setting, as high as it will go. Season the steak generously with salt and pepper and rub with a little oil. Get a pan smoking hot then add the steak. Cook for 2 minutes on each side and allow to rest. Slice the steak as thinly as possible and add it to a mixing bowl.\nGrate the cheese, slice the spring onions, dice the chillies and chop the coriander. Add them all to the bowl with the steak. Transfer the skins into an ovenproof dish and layer them with the beef mix. Keep piling the skins and beef mix high. Grill for a few minutes, until the cheese is melting and oozy and the beef is blackening and crisp.\nTop with any remaining chilli slices, chopped coriander, lime wedges and squeezes of sriracha and mayo. Serves 4."},{"id":116,"name":"BA's Best Lasagna","tags":["Beef","Pasta"],"servings":"8 servings","source":"https://www.bonappetit.com/recipe/ba-best-lasagna","image":"","cooktime":null,"preptime":null,"ingredienttags":["ground pork","ground beef","bacon","celery","carrot","tomato","chicken broth","whole milk","Parmesan"],"ingredientlist":["Ragù Bolognese","2 lb. ;ground pork;","1 lb. ;ground beef; chuck (20% fat)","Kosher salt, freshly ground pepper","2 Tbsp. extra-virgin olive oil","2 oz. pancetta or slab ;bacon;, chopped","1 medium onion, finely chopped","1 ;celery; stalk, finely chopped","1 medium ;carrot;, peeled, finely chopped","6 garlic cloves, sliced","2 Tbsp. tomato paste","¾ cup dry white wine","1 28-oz. can whole peeled ;tomato;es","1 cup low-sodium ;chicken broth;","1 cup ;whole milk;","Béchamel","7 Tbsp. unsalted butter","¼ cup plus 3 Tbsp. all-purpose flour","6 cups whole milk","4 oz. ;Parmesan;, coarsely grated (about 1 cup)","Pinch of cayenne pepper","Pinch of ground nutmeg","Kosher salt, freshly ground pepper","Assembly","1¼ lb. dried lasagna noodles (we like De Cecco since they are wide and short)","Kosher salt","Extra-virgin olive oil (for greasing)"],"directions":"Ragù Bolognese\nPreheat oven to 110C°. Mix pork and beef with your hands in a large bowl; season generously with salt and pepper, then mix again. Form into about 18 large meatballs (they don’t need to be perfect—you’ll be mashing them later).\nHeat oil in a large Dutch oven over medium-high. Working in 2 batches, cook meatballs, turning occasionally and reducing heat if bottom of pot looks in danger of scorching, until browned all over, about 6 minutes per batch. Transfer to a rimmed baking sheet as they’re done.\nReduce heat to medium. Add pancetta and cook, stirring often, until lightly browned and beginning to crisp, about 5 minutes. Add onion, celery, carrot, and garlic and cook, stirring occasionally, until softened, 6–8 minutes. Add tomato paste and cook, stirring constantly, until paste darkens, about 2 minutes. Add wine and cook, stirring occasionally, until nearly completely evaporated, 4–5 minutes. Add tomatoes, crushing with your hands, and increase heat to medium-high. Cook, stirring occasionally, until liquid is jammy and reduced by about half, 8–10 minutes. Add broth and milk and return meat to pot. Bring to a simmer. Cover pot, leaving lid slightly ajar, and transfer to oven. Bake sauce (no need to stir, but check after 1–2 hours to ensure liquid is at a low simmer, adjusting oven temperature as needed) until meatballs are falling-apart tender, 3–4 hours.\nUsing a potato masher, break meatballs apart and incorporate into liquid (you should have about 8 cups ragù); season with salt and pepper. Reduce over medium-low heat if needed to thicken.\nBéchamel\nMelt butter in a large saucepan over medium heat. Whisk in flour and cook, whisking occasionally, until flour begins to smell a bit nutty, about 4 minutes. Quickly whisk in milk and increase heat to medium-high. Bring to a simmer and cook, whisking occasionally, until béchamel thickens, about 4 minutes. Reduce heat to medium-low and cook, whisking occasionally, until smooth and velvety, about 10 minutes. Remove from heat and whisk in Parmesan, cayenne, and nutmeg (you should have about 6 cups); season with salt and pepper. Transfer to a large bowl, cover with plastic wrap, and use within 1 hour or chill.\nAssembly\nPreheat oven to 160C°. Cook noodles in a large pot of boiling salted water, stirring occasionally and separating noodles so they don’t stick to each other, until just starting to soften but still snap in half rather than bend when folded; 3 minutes is the magic number. They will be so firm it will just seem all wrong, but this is what separates al dente lasagna layers from gummy ones. Transfer noodles to a large bowl of cold water to cool. Drain and lie flat in a single layer on a rimmed baking sheet, separated by parchment or wax paper.\nLightly oil a 13x9\" glass or ceramic baking dish. Spread 1½ cups ragù in dish. Lay a single layer of noodles over ragù (you will need to cut some noodles in half in order to fill all gaps). Spoon 1¼ cups béchamel over noodles, spreading in an even layer with a small offset spatula. Top béchamel with 1½ cups ragù. Repeat, creating 5 layers of pasta (or 6, depending on how deep your pan is) and ending with remaining 1 cup béchamel. It should come right to the top edge of the dish, and the top layer of pasta will get super crunchy when baked.\nCover with a lightly oiled piece of foil and set on a rimmed baking sheet (just to catch drips). Bake lasagna until bubbling gently around the edges, about 1 hour. Remove from oven and increase oven temperature to 220°; carefully place rack in top of oven. Uncover and continue to bake until top is browned and crisp around the edges, 10–15 minutes.\nLet sit 10 minutes before serving."},{"id":117,"name":"Slow-Roast Gochujang Chicken","tags":["Chicken","Main Dishes"],"servings":"4 servings","source":"https://www.bonappetit.com/recipe/slow-roast-gochujang-chicken","image":"","cooktime":null,"preptime":null,"ingredienttags":["whole chicken","gochujang","ginger","potatoes","green onions","lime","honey"],"ingredientlist":["1 3½–4-lb. ;whole chicken;","1 Tbsp. salt, plus more","Freshly ground black pepper","5 Tbsp. ;gochujang; (Korean hot pepper paste)","¼ cup plus 2 Tbsp. extra-virgin olive oil","2 heads of garlic","1 ½\" piece fresh ;ginger;","1½ lb. baby Yukon Gold ;potatoes; (about 1½\" in diameter)","5 ;green onions;","2 ;lime;s","2 tsp. ;honey;"],"directions":"Place a rack in middle of oven; preheat to 150C°. Pat chicken dry with paper towels. Place on a small rimmed baking sheet. Season 1 3½–4-lb. whole chicken all over with 1 Tbsp. salt and lots of freshly ground black pepper, making sure to season the inside cavity.\nWhisk 5 Tbsp. gochujang and ¼ cup extra-virgin olive oil in a medium bowl until combined. Finely grate 3 garlic cloves (from one of the heads of garlic) into gochujang oil. Peel 1 ½\" piece fresh ginger (a spoon can get the job done), then grate into gochujang oil; whisk to combine.\nCut what’s left of the head of garlic in half crosswise. Repeat with second head of garlic. Stuff 2 garlic halves inside cavity of chicken. Tie legs together with kitchen twine. Using a pastry brush, brush half of gochujang oil over chicken.\nToss 1½ lb. baby Yukon Gold potatoes and remaining 2 garlic halves and 2 Tbsp. extra-virgin olive oil in remaining gochujang oil until well coated. Season lightly with salt and pepper and toss again to combine.\nArrange potatoes in a 12\" cast-iron skillet, scooting them toward edges of pan to make space for chicken. Nestle garlic halves (cut sides down) in center of skillet. Place chicken over garlic—as it roasts, it will infuse the fat (and thus, the potatoes) with flavor. If any potatoes have shimmied their way under the chicken, use tongs to arrange them around it.\nRoast chicken and potatoes, turning potatoes once or twice to coat in juices and oil that accumulate in pan, until potatoes are very tender when pressed with the back of a spoon, and chicken skin is deep reddish-golden brown in color, 2½–3 hours. When you wiggle the legs of the chicken, they should feel loose in the joints, meaning the meat is fall-apart tender. Transfer chicken to a cutting board and let rest 10–15 minutes.\nMeanwhile, use the back of a large spoon or a potato masher to gently smash potatoes in skillet, exposing some of their flesh to juices underneath so they can soak them up.\nFinish the potatoes: Thinly slice 5 scallions on a long diagonal. Cut 2 limes in half. Cut 1 half into wedges and set aside. Stir 2 tsp. honey and juice of remaining lime half into potatoes. Taste potatoes and season with more salt if needed. Scatter sliced scallions over potatoes.\nCarve chicken, then arrange pieces over potatoes and scallions. Serve right out of skillet with remaining lime wedges alongside for squeezing, and squeeze out the sweet, slow-roasted garlic cloves as you wish."},{"id":118,"name":"Chili Colorado","tags":["Pork","Mexican","Main Dishes","Tortillas"],"servings":"4-6 servings","source":"https://www.bonappetit.com/recipes/article/groat-ricks-chili-colorado","image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["5 dried anchos ","2 dried pasillas","2 dried guajillos","3 cups of boiling chicken stock","2 pounds of boneless pork shoulder","2 bay leaves ","1 tbsp ground cumin","a couple of tsp chopped fresh sage","a couple of tsp chopped fresh oregano (Mexican oregano if you have it)","5 cups of chicken stock"],"directions":"Take 5 anchos, 2 pasillas, and 2 guajillos, and remove the stems and seeds. Look for chiles that are soft and pliable, like a raisin. If they are brittle, they are old and will be flavorless—don't use them!\nCover chiles with 3 cups of boiling chicken stock and let them steam, covered with plastic wrap, for about 30 minutes until they are plump and tender. Put the chiles and all of the soaking liquid into a blender and purée until very smooth.\nCut 2 pounds of boneless pork shoulder into ½” pieces, season with salt and pepper, and brown the meat in a large, heavy pot over medium-high heat with a little bit of vegetable oil to keep it from sticking. Chop up a bunch of garlic (about 6 garlic cloves) and throw it in the pot along with two bay leaves, a tablespoon of ground cumin, and a couple of teaspoons of chopped fresh sage and chopped fresh oregano (Mexican oregano if you have it). Stir that around for about a minute, or until very fragrant. Add in 5 cups of chicken stock and simmer uncovered for about an hour. Then, stir in the chile purée and simmer for another 45 minutes until the meat is very tender and the sauce is a thick, mahogany-red color. Season with additional salt and pepper.\nServe with rice and/or tortillas"},{"id":119,"name":"Cajun Salmon Burgers","tags":["Vis","Burger","Lunch","Main Dishes"],"servings":"2 servings","source":"https://www.budgetbytes.com/cajun-salmon-burgers/","image":"","cooktime":null,"preptime":null,"ingredienttags":["Salmon","egg","mayo"],"ingredientlist":["107 gr (6 oz) Canned ;Salmon; (boneless, skinless)","60 mL (1/4 cup) breadcrumbs","1 large ;egg;","1 Tbsp ;mayo;nnaise","1/2 tsp coarse ground mustard","1 green onion, sliced","CAJUN SEASONING","1/2 tsp smoked paprika","1/4 tsp oregano","1/4 tsp thyme","1/8 tsp garlic powder","1/8 tsp onion powder","1 pinch cayenne (or to taste)","1 pinch freshly cracked pepper","1/8 tsp salt","FOR COOKING:","1/2 Tbsp cooking oil","1/2 Tbsp butter","OPTIONAL FOR SERVING:","2 buns","60 mL (1/4 cup) guacamole","250 mL (1 cup) lettuce"],"directions":"Drain the canned salmon and add it to a bowl with the breadcrumbs, egg, mayonnaise, mustard, green onion, and Cajun seasoning spices. Stir to combine the ingredients, then refrigerate for 30 minutes to allow time for the spices to blend and the breadcrumbs to absorb moisture.\nAfter 30 minutes, shape the salmon mixture into two patties, about 3-4 inches in diameter each.\nHeat the oil and butter over medium heat in a large skillet. Once the butter is melted and begins to foam, add the salmon burgers and cook for 3-5 minutes on each side, or until the burgers are well browned.\nTo serve, place one burger on each bun, add 2 Tbsp guacamole to each, and top with a small handful of spring mix. Enjoy!"},{"id":120,"name":"(Not) Butter Chicken","tags":["Chicken","Curry","Rice","Main Dishes"],"servings":"6 servings","source":"https://www.budgetbytes.com/not-butter-chicken/","image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1.25 lbs. 2 lg chicken breasts","3 Tbsp butter or Ghee","3 cloves garlic","1 med onion","1 inch fresh ginger","1 Tbsp garam masala","1/4 tsp cayenne pepper","1 400 gr (15 oz) can tomato sauce","1 400 gr (15 oz) can diced tomatoes","125 mL (1/2 cup) plain yogurt","1 125 mL (1/2 cup)s jasmine or basmati rice","2 60 mL (1/4 cup)s water"],"directions":"Trim the fat from the chicken breasts and cut them into small chunks. Set chicken aside. Dice the onion and mince the garlic and ginger.\nIn a large pot, melt the butter over medium/high heat. When the butter is nice and hot (careful not to burn it) add the chicken chunks and brown them on all sides. Remove the chicken from the pot and set aside. It’s okay if it isn’t cooked through because it will simmer in the sauce later.\nReduce the heat to medium and add the onions, garlic and ginger. Saute the mix for 2-3 minutes or until they begin to soften. Add the garam masala and cayenne pepper. Continue to cook and stir for 2 minutes more.\nAdd the tomato sauce and diced tomatoes. Stir until everything is evenly combined. Add the chicken back in, place a lid on top and reduce the heat to medium-low. Allow the mixture to simmer for one hour or until the chicken is tender and cooked through.\nWhile the pot is simmering, begin to cook the rice. Combine 1.5 cups of rice and 2.25 cups of water in a medium pot. Place a lid on top and heat over a high flame until boiling. Once it comes to a full boil, immediately reduce the heat to low and let simmer for 20 minutes. After 20 minutes, turn the heat off and keep the lid in place until ready to serve.\nAfter the chicken and tomato mixture has simmered, break the chicken into smaller pieces if desired (the chicken should be soft and easily broken apart). Stir in the plain yogurt. Serve the chicken mixture over a bed of rice. Garnish with cilantro if desired."},{"id":121,"name":"Mayonnaise","tags":["Saus"],"servings":"1 cup","source":"https://www.epicurious.com/recipes/food/views/mayonnaise-241083","image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg","mustard","vinegar","lemon juice"],"ingredientlist":["1 large ;egg; yolk, at room temperature 30 minutes","1/2 teaspoon Dijon ;mustard;","3/4 cup olive or vegetable oil (or a combination), divided","1 teaspoon white-wine ;vinegar; or cider vinegar","1 1/2 teaspoons fresh ;lemon juice;","1/4 teaspoon white pepper"],"directions":"Whisk together yolk, mustard, and 1/4 teaspoon salt until combined well. Add about 1/4 cup oil drop by drop, whisking constantly until mixture begins to thicken. Whisk in vinegar and lemon juice, then add remaining 1/2 cup oil in a very slow, thin stream, whisking constantly until well blended. If at any time it appears that oil is not being incorporated, stop adding oil and whisk mixture vigorously until smooth, then continue adding oil. Whisk in salt to taste and white pepper. Chill, surface covered with plastic wrap, until ready to use."},{"id":122,"name":"Classic Creamed Spinach","tags":["Veggie Side Dish","Vegetarian"],"servings":"4-6 servings","source":"One Pan to Rule Them All p167","image":null,"cooktime":null,"preptime":null,"ingredienttags":["spinach","heavy cream","Parmesan"],"ingredientlist":["3 Tbsp extra virgin olive oil","1 large onion, thinly sliced","3 cloves garlic, minced","2 lb baby ;spinach;","¾ cup ;heavy cream;","1 tsp salt","½ tsp ground black pepper","¼ cup ;Parmesan; cheese, grated"],"directions":"Heat the skillet over medium heat. Add the onions and sauté until the onions become translucent, about 6–8 minutes. Add the garlic and stir through for an additional minute. Add a handful of spinach to the skillet at a time, allowing each handful to wilt as it is stirred through the onions and garlic.\nSauté the spinach for 3–4 minutes. Add the heavy cream, salt, pepper, and cheese to the skillet and stir the mixture until everything is evenly distributed. Turn the heat to low and allow the mixture to cook until the cream is thickened, about 6–8 minutes.\nServe the spinach hot."},{"id":123,"name":"Monte Cristo Sandwiches","tags":["Beef","Sandwich","Lunch"],"servings":"6 servings","source":"One Pan to Rule Them All p51","image":null,"cooktime":null,"preptime":null,"ingredienttags":["egg","milk","mayo","cheese","mozzarella","corned beef"],"ingredientlist":["4 ;egg;s","1 cup ;milk;","½ tsp salt","½ tsp garlic powder","½ tsp chili powder","12 slices (½ inch) white, rye, or sourdough bread","6 Tbsp ;mayo;nnaise","12 slices provolone ;cheese; or ;mozzarella;","1 lb ;corned beef;, deli-sliced","6 Tbsp extra virgin olive oil"],"directions":"Preheat the oven to 90C°. In a mixing bowl, whisk together eggs, milk, salt, garlic powder, and chili powder. Pour this mixture into a rimmed baking pan, a 9-inch pie plate, or a wide,\nshallow bowl.\nOn half of the bread slices, spread ½ tablespoon of mayonnaise, one slice of provolone cheese, 3–4 slices of corned beef, another slice of provolone, and top with a second slice of bread spread with ½ tablespoon of mayonnaise.\nPrepare a wire rack over a rimmed baking sheet next to the stove. Heat 2 tablespoons of the oil in a skillet over medium-low heat. Take the first two sandwiches and dip each side into the egg mixture for about 5 seconds.\nWhen the oil begins to shimmer, place the first two sandwiches in the skillet. Cook each side until golden brown, 2–3 minutes. Remove the sandwich to the wire rack and repeat to finish all of the sandwiches, adding more oil to the pan, as necessary.\nPlace the wire rack and baking sheet in the oven for 10 minutes. Remove sandwiches from the oven, cut in half, and serve warm."},{"id":124,"name":"Rigatoni in Red Pepper Sauce","tags":["Pasta","Vegetarian","Main Dishes"],"servings":"6 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":["bell pepper","tomato","basil","bay leaf","mozzarella","Parmesan"],"ingredientlist":["2 Tbsp plus 1 tsp salt","500 gr rigatoni pasta ","2 onions, thinly sliced","3 red ;bell pepper;s, thinly sliced","2 tsp vegetable oil","3 cloves garlic, minced","1 400gr can of chopped ;tomato;es","½ tsp ;basil;","½ tsp thyme","¼ tsp crushed red chiles (optional)","1 ;bay leaf;","125 gr ;mozzarella; cheese, shredded","100 gr ;Parmesan; cheese, grated"],"directions":"Preheat the oven to 200°C. Heat the skillet over medium heat and add vegetable oil. When the oil begins to shimmer, layer the sliced onions on the bottom. Then spread the peppers on top of the onions. Let it lightly fry for about 10 minutes, until the onions are lightly browned and the peppers have begun to “sweat.”\nAdd the garlic and stir everything together. Sauté until you can smell the garlic, about 30 seconds. Immediately pour in the can of tomatoes, including the juice. Add ½ cup of water along with the basil, thyme, bay leaf, 1 teaspoon of salt, and optionally, the crushed chiles. Turn the heat to low and simmer for 30 minutes.\nWhile the sauce is simmering, bring water to a rolling boil in a large pot over high heat. When the water begins to boil, add the remaining 2 tablespoons of salt and the pasta. Cook for 10 minutes, occasionally stirring to ensure the pasta does not stick to the pot. Drain the pasta in a colander, and set aside while you finish the sauce.\nRemove the bay leaf from the skillet and pour everything else into a blender or food processor. Blend the sauce until smooth.\nIn a small bowl, mix the mozzarella and Parmesan cheeses together. Pour the pasta, sauce, and all but 1/3 of the cheese mixture into the skillet, stirring to coat everything. Sprinkle the top with the reserved cheese, and transfer the skillet into the oven. Bake for 25-30 minutes, or until the cheese is nicely browned.\nAllow the rigatoni to rest for 10 minutes before serving hot."},{"id":125,"name":"Spinach White Bean Enchiladas","tags":["Wrapped","Vegetarian","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["tortillas","cheese","spinach","white beans","cilantro","cream cheese","whole milk"],"ingredientlist":["12 small corn ;tortillas;","100 gr ;cheese;","250 gr frozen chopped ;spinach;, defrosted","400 gr can ;white beans;","1/4 tsp garlic powder","1/2 tsp cumin","1/4 tsp salt","Freshly cracked pepper","Handful fresh chopped ;cilantro; for garnish (optional)","Cheese Sauce","1 Tbsp butter","1 clove garlic, minced","100 gr ;cream cheese;","180 mL ;whole milk;","1/4 tsp salt","100 gr cheese"],"directions":"Toast the tortillas on each side in a dry skillet over medium-low heat until they are a slightly stiff and have browned just a bit on the edges. Stack them on a plate until ready to use. Shred an 200 gram block of cheese. Separate in two halves.\nSqueeze as much moisture out of the thawed spinach as possible. Place the spinach in a large bowl. Rinse and drain the white beans, then add them to the bowl with the spinach. Also add half. of the shredded cheese, garlic powder, cumin, salt, and a little freshly cracked pepper. Stir until the mixture is evenly combined.\nPreheat the oven to 180ºC. Begin preparing the cheese sauce by adding the butter and minced garlic to a small sauce pot. Sauté the garlic in the butter for one minute over medium heat. Add the milk and cream cheese to the pot. Stir and heat until the cream cheese has fully melted into the milk and the mixture has thickened slightly. Season with salt. Begin adding the remaining shredded cheese, a handful at a time. Once all the cheese has been melted into the sauce, turn the heat off and allow it to cool slightly.\nCoat the inside of a casserole dish with butter. Begin filling the toasted tortillas with the spinach and white bean mixture and rolling them closed. Line up the filled tortillas in the casserole dish, seam sides facing down. Choose a casserole dish that fits 12 of the rolled enchiladas snugly to help keep them from unrolling.\nOnce the tortillas are filled and in the casserole dish, pour the pepper jack sauce over top. Bake the enchiladas in the preheated oven for 35-40 minutes, or until the edges of the tortillas are brown and the pepper jack sauce is thick and browned on the edges. Sprinkle chopped cilantro over top, if desired."},{"id":126,"name":"West African Peanut Stew","tags":["Vegan","Vegetarian","Main Dishes","Rice"],"servings":"6 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["sweet potato","tomato paste","peanut butter","spinach","cilantro","peanuts"],"ingredientlist":["1 Tbsp olive oil","4 cloves garlic","1 Tbsp grated fresh ginger","1 ;sweet potato; (about 500 gr (1 lb))","1 medium onion","1 tsp cumin","1/4 tsp crushed red pepper","1 170 gr (6 oz) can ;tomato paste;","1/2 cup natural style ;peanut butter;","6 cups vegetable broth","1/2 bunch ;spinach; (4-6 cups chopped)","OPTIONAL GARNISHES","1/4 bunch ;cilantro;","4.5 cups cooked brown rice","1/3 cup chopped ;peanuts;"],"directions":"Peel and grate the ginger using a small holed cheese grater. Mince the garlic, and dice the onion. Sauté the onion, ginger, and garlic in a large pot with the olive oil over medium heat for 2-3 minutes, or until the onion becomes soft and translucent.\nWhile the onion, ginger, and garlic are sautéing, peel and dice the sweet potato into 1/2-inch cubes. Add the sweet potato cubes, cumin, and red pepper to the pot and sauté for about 5 more minutes.\nAdd the tomato paste, peanut butter, and vegetable broth to the pot. Stir until the peanut butter and tomato paste have mostly dissolved into the broth. Place a lid on the pot and turn the heat up to high. Allow the stew to come up to a boil. Once it reaches a boil, turn the heat down to medium-low and allow it to simmer for 15-20 minutes, or until the sweet potatoes are very soft.\nWhile the soup is simmering, chop the spinach. Once the stew has simmered for 15-20 minutes and the sweet potatoes are very soft, stir in the spinach. Let the stew simmer for about 5 minutes more, then begin to smash the sweet potatoes against the side of the pot to help thicken the stew.\nFinally, taste the stew and add salt or red pepper, if desired. Serve the stew with a scoop of cooked rice (about 3/4 cup), a few chopped peanuts, fresh cilantro, and a drizzle of sriracha, if desired."},{"id":127,"name":"Pasta met Zalmsaus met Oregano en Erwtjes","tags":["Pasta","Vis","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1el olijfolie","1 ui","100ml witte wijn","200ml visbouillon","300ml room","200g zalmfilet in repen","200g doperwtjes","Handje oregano"],"directions":"Verwam de olie in een pan en bak de ui aan. Roer de witte wijn bouillon en room erdoor en laat to eenderde inkoken.\nMeng de zalm, erwtjes en oregano erdoor, kloar."},{"id":128,"name":"Pasta met Tonijnsaus","tags":["Pasta","Vis","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["Basil","1 citroen","100ml olijfolie","200g tonijn","1 blikje ansjovis","2 tenen knoflook","2el kappertjes","2el zwarte olijven","1 rode peper","100ml droge witte wijn","500g tomaten"],"directions":"Meng zout, peper, basil, cintroenrasp, sap en 100ml olie door elkaar en smeer de tonijn ermee. Laat 30min marineren.\nVerwam 1el olijfolie in een pan en roer er de ansjovis door tot hij is gesmolten\nMeng er de knoflook, kappertjes, olijven en peper door en roerbak dit 1min. Schep de tonijn met de marinade erdoor en laat aan alle kanten dichtschroeien.\nBreng in een andere pan de wijn met de tomaten aan de kook en laat 5min op laag vuur doorkoken. Schep door het tonijnmengsel.\nBreng indien nodig op smaak met zout en peper"},{"id":129,"name":"Fish and Chips","tags":["Main Dishes","Fries","Deep Fry","Vis"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["75g bloem","½ tl paprikapoeder","1 tl komijnzaad","2 eieren, losgeklopt","80gr paneermeel","500gr witte visfilets in repen","2el olijfolie","25g boter"],"directions":"Vermeng in diep bord de bloem, paprikapoeder, komijn, zeezout en peper. Klop eieren los in een tweede bord en de paneermeel met zout in peper op een derde platte bord.\nVerhit de olie en boter in een koekenpan, wentel de vis een voor een door de 3 borden en doe ze in de pan. Bak ze lichtbruin.\nVergeet niet de azijn en citroen!"},{"id":130,"name":"Pokkfiskur","tags":["Vis","Main Dishes"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["potatoes"],"ingredientlist":["500 gr ;potatoes;, peeled and cooked","500 gr haddock or cod, cooked","1 Onion, diced","350 mL milk","50 gr butter","3 tbsp flour","Salt and pepper","Chives","Dark rye bread"],"directions":"Break up the fish into flakes. Chop the potatoes roughly. Heat the milk up in a microwave, about 3 minutes will do.\nPut the butter in a pan and sauté over a medium heat until soft and translucent. Sprinkle the flour over the onion, stir well and let the flour cook out for a few minutes. Gradually stir in the milk. Simmer for 5 minutes, stirring often.\nAdd the fish and stir briskly to break up the flakes even more. Season liberally with salt and pepper. Add the potatoes and stir gently. Cook over a low heat until heated through. Serve hot with the dark rye bread, chives and butter."},{"id":131,"name":"Tuna on Toasted Quinoa","tags":["Vis","Main Dishes","Rice"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["quinoa","beets","orange","cider vinegar","mustard","honey","maple syrup","tuna","cannellini ","Egg","olives","radishes"],"ingredientlist":["2 Tbsp butter","1 cup [180 g] ;quinoa;","2 cups [480 ml] chicken or vegetable broth","2 cooked ;beets;","1⁄2 tsp fnely grated ;orange; zest","1 tsp fresh orange juice","1⁄4 tsp salt","5 Tbsp [80 ml] canola or vegetable oil","2 Tbsp ;cider vinegar;","1 Tbsp Dijon ;mustard;","1⁄2 tsp ;honey; or ;maple syrup;","Salt and freshly ground black pepper","One 5-oz [140-g] can olive oil-packed ;tuna;,","drained","One 141⁄2-oz [415-g] can ;cannellini ;","2 to 4 Hard-Boiled ;Egg;s, peeled and quartered lengthwise","8 to 12 green ;olives;, pitted and chopped","8 ;radishes;, cut into little wedges"],"directions":"In a large frying pan over medium-high heat, melt the butter. Add the quinoa and cook, stirring frequently, until it is toasted and browned, 3 to 5 minutes. Pour in the broth, bring to a boil, cover, turn the heat to low, and cook, undisturbed, until the quinoa is tender and ﬂuﬀy and the liquid is absorbed, about 20 minutes. Uncover and ﬂuﬀ with a fork.\nChop the beets into bite size pieces, and steam or warm through. Transfer into a bowl, add the orange zest, juice and salt and toss to coat evenly. In a small bowl, whisk together the oil, vinegar, mustard, and maple syrup. Season with salt and pepper.\nDivide the quinoa among four bowls. Arrange the tuna, beets and greens, and beans in three separate and equal sections on top of the quinoa. Top with the eggs, drizzle on the vinaigrette, garnish with the olives and radishes, and serve."},{"id":132,"name":"Baked Chimichurri Fish Bowls","tags":["Vis","Main Dishes","Rice"],"servings":"4 servings","source":null,"image":null,"cooktime":null,"preptime":null,"ingredienttags":["red cabbage","carrot","cilantro","lemon","lime juice","vinegar","parsley","cilantro","oregano","cod"],"ingredientlist":["Simple Slaw","1/2 head ;red cabbage; (about 4 cups shredded)","1 ;carrot;","Handful fresh ;cilantro;","Tbsp ;lemon; or ;lime juice;","1 Tbsp neutral oil (like canola)","1/2 tsp salt","Chimichurri","1/2 cup olive oil","1/4 cup red wine ;vinegar;","1 cup packed Italian ;parsley;","1/2 cup packed ;cilantro;","cloves garlic","1 tsp dried ;oregano;","1/2 tsp cumin","1/4 tsp red pepper flakes","1/2 tsp salt","Fish and Rice","(5oz) ;cod; steaks","cups cooked rice"],"directions":"Prepare the slaw first so that the salt and lemon juice have time to soften the cabbage. Slice or shred the cabbage as thinly as possible. Use a large-holed cheese grater to shred the carrot. Roughly chop a handful of cilantro leaves.\nCombine the cabbage, carrot, cilantro, lemon juice, oil, and salt in a bowl. Stir to combine. Let the cabbage sit for at least 30 minutes to soften, stirring occasionally.\nCombine all the ingredients for the chimichurri in a food processor or blender and pulse until the herbs are finely chopped.\nBegin preheating the oven to 200ºC. Place the cod steaks in a baking dish. Spoon half of the chimichurri over top, reserving the other half for drizzling over the bowls after baking. Bake the fish for 12-15 minutes, or until it is cooked through.\nTo build the bowls, place one cup cooked rice in a bowl, top with a heaping cup of the slaw (make sure to stir just before serving), and then place the baked fish on top. Drizzle some of the remaining chimichurri over the entire bowl and enjoy!"},{"id":133,"name":"Hongaarse Goulash","tags":["Beef","Stew","Slowcooker","Main Dishes"],"servings":"4 servings","source":"","image":"","cooktime":null,"preptime":null,"ingredienttags":[],"ingredientlist":["1kg runderlappen","50gr roomboter","150gr spekreepjes","1 grote ui","2 teentjes knoflook","4 paprika's(rood en groen)","2el bloem","1el cayennepeper","1el goulash kruiden","1 blik tomatenstukjes","1dl rode wijn","2dl rundvleesbouillon","2tl tijm","4 vastkokende aardappelen","250gr sperziebonen"],"directions":"Snijd het vlees in stukken en wentel ze door de bloem. Verhit de boter in een braadpan en bak het vlees op matig hoog vuur in ca. 5min al omscheppend rondom bruin.\nBack the spekreepjes ca. 2 minuten zachtjes mee.\nPel en snipper de ui en knoflook, snijd de paprika's in stukken. Schep de ui, knoflook en paprika door het vlees en bak alles nog ca. 2 minuten.\nStrooi de cayennepeper en goulash kruiden erover en bak dit 2 minuten mee.\nSchenk de tomaten, de wijn en de bouillon langs de rand van de pan bij het vlees en voeg de tijm toe. Breng het geheel aan de kook en laat de goulash afgedekt 2 uur heel zachtjes sudderen.\nSchil de aardappelen en snijd ze in kleine blokjes. Haal de sperziebonen af en snijd ze in drieën. Schep het erdoor heen en smoor het gerecht nog ca. 45 minuten gaar.\nLekker met rijst of pasta."}]